#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Account

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Account_structs.hpp"


namespace SDK
{

// Class Account.ExternalAccountProvider
// 0x0010 (0x0038 - 0x0028)
class UExternalAccountProvider final : public UObject
{
public:
	TArray<struct FExternalAccountServiceConfig>  Services;                                          // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExternalAccountProvider">();
	}
	static class UExternalAccountProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExternalAccountProvider>();
	}
};

// Class Account.OnlineAccountCommon
// 0x08B0 (0x08D8 - 0x0028)
class UOnlineAccountCommon : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 AvailabilityServiceGameName;                       // 0x0038(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRequireLightswitchAtStartup;                      // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 EulaKey;                                           // 0x0050(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         EulaKeys;                                          // 0x0060(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TMap<class FString, class FString>            EulaKeyMapping;                                    // 0x0070(0x0050)(Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnableWaitingRoom;                                // 0x00C0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FWebEnvUrl>                     WebCreateEpicAccountUrl;                           // 0x00C8(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bAllowLocalLogout;                                 // 0x00D8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x37];                                      // 0x00D9(0x0037)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DefaultLoginStepTimeout;                           // 0x0110(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class FName, float>                      CustomLoginStepTimeouts;                           // 0x0118(0x0050)(Config, NativeAccessSpecifierPrivate)
	bool                                          bEnableDevLoginStepTimeouts;                       // 0x0168(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_169[0x67];                                     // 0x0169(0x0067)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 RedeemAccessUrl;                                   // 0x01D0(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 RequestFreeAccessUrl;                              // 0x01E0(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 RealGameAccessUrl;                                 // 0x01F0(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SkipRedeemOfflinePurchasesChance;                  // 0x0200(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseFreeAccessInsteadOfGameAccess;                 // 0x0204(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldGrantFreeAccess;                            // 0x0205(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_206[0x1];                                      // 0x0206(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bAllowHomeSharingAccess;                           // 0x0207(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRequireUGCPrivilege;                              // 0x0208(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209[0x227];                                    // 0x0209(0x0227)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         AccessGrantDelaySeconds;                           // 0x0430(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UWaitingRoomState*                      WaitingRoomState;                                  // 0x0438(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_440[0x498];                                    // 0x0440(0x0498)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineAccountCommon">();
	}
	static class UOnlineAccountCommon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAccountCommon>();
	}
};

// Class Account.WaitingRoomState
// 0x0060 (0x0088 - 0x0028)
class UWaitingRoomState final : public UObject
{
public:
	uint8                                         Pad_28[0x34];                                      // 0x0028(0x0034)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         GracePeriodMins;                                   // 0x005C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x28];                                      // 0x0060(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaitingRoomState">();
	}
	static class UWaitingRoomState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaitingRoomState>();
	}
};

}

