#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ActivityBrowserRow_NEW_VM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C
// 0x0078 (0x0440 - 0x03C8)
class UActivityBrowserRow_NEW_VM_C final : public UFortActivityBrowserRowList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnLoadingMore;                                     // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPeek;                                            // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          InactiveDarken;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveOverlayDim;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingMorePages_C*                WBP_LoadingMorePages;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UActivityBrowserArrowButton_C*>  ArrowButtons;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   FontHoverAnimateParam;                             // 0x0418(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontPressedAnimateParam;                           // 0x041C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        LoadingMoreDisplayDelay;                           // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreVisible;                              // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreQueryActive;                          // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           LoadingMoreDelayTimer;                             // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void Set_Font_Category_Size();
	void ResetOnRowActiveInactiveAnimation(bool IsRowActive);
	void ResetOnPeekAnimation();
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnQueryStatusChanged(bool bIsActive);
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void FinishedLoadingMoreDelay();
	void Finished_3E73331A4DD3EBC5CBA16D833A7500EF();
	void Finished_31D944D34F22F7FC82BF4F889F26EF09();
	void ExecuteUbergraph_ActivityBrowserRow_NEW_VM(int32 EntryPoint);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserRow_NEW_VM_C">();
	}
	static class UActivityBrowserRow_NEW_VM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserRow_NEW_VM_C>();
	}
};

}

