#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AdvancedWidgets

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AdvancedWidgets.RadialSlider.SetAngularOffset
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_SetAngularOffset final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetCenterBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct RadialSlider_SetCenterBackgroundColor final
{
public:
	struct FLinearColor                           InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetCustomDefaultValue
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_SetCustomDefaultValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetHandStartEndRatio
// 0x0010 (0x0010 - 0x0000)
struct RadialSlider_SetHandStartEndRatio final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetLocked
// 0x0001 (0x0001 - 0x0000)
struct RadialSlider_SetLocked final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetShowSliderHand
// 0x0001 (0x0001 - 0x0000)
struct RadialSlider_SetShowSliderHand final
{
public:
	bool                                          InShowSliderHand;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetShowSliderHandle
// 0x0001 (0x0001 - 0x0000)
struct RadialSlider_SetShowSliderHandle final
{
public:
	bool                                          InShowSliderHandle;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetSliderBarColor
// 0x0010 (0x0010 - 0x0000)
struct RadialSlider_SetSliderBarColor final
{
public:
	struct FLinearColor                           InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetSliderHandleColor
// 0x0010 (0x0010 - 0x0000)
struct RadialSlider_SetSliderHandleColor final
{
public:
	struct FLinearColor                           InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetSliderHandleEndAngle
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_SetSliderHandleEndAngle final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetSliderHandleStartAngle
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_SetSliderHandleStartAngle final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetSliderProgressColor
// 0x0010 (0x0010 - 0x0000)
struct RadialSlider_SetSliderProgressColor final
{
public:
	struct FLinearColor                           InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetSliderRange
// 0x0088 (0x0088 - 0x0000)
struct RadialSlider_SetSliderRange final
{
public:
	struct FRuntimeFloatCurve                     InSliderRange;                                     // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetStepSize
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_SetStepSize final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetUseVerticalDrag
// 0x0001 (0x0001 - 0x0000)
struct RadialSlider_SetUseVerticalDrag final
{
public:
	bool                                          InUseVerticalDrag;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetValue
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.SetValueTags
// 0x0010 (0x0010 - 0x0000)
struct RadialSlider_SetValueTags final
{
public:
	TArray<float>                                 InValueTags;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.GetCustomDefaultValue
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_GetCustomDefaultValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.GetNormalizedSliderHandlePosition
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_GetNormalizedSliderHandlePosition final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AdvancedWidgets.RadialSlider.GetValue
// 0x0004 (0x0004 - 0x0000)
struct RadialSlider_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

