#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AIDebuggerRuntime

#include "Basic.hpp"

#include "AIDebuggerRuntime_structs.hpp"
#include "GameplayMessages_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AIDebuggerRuntime.AIDebuggerCheatManager.EnableNavMeshVisualizer
// 0x0001 (0x0001 - 0x0000)
struct AIDebuggerCheatManager_EnableNavMeshVisualizer final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AIDebuggerRuntime.AIDebuggerCheatManager.StartAIDebugger
// 0x0010 (0x0010 - 0x0000)
struct AIDebuggerCheatManager_StartAIDebugger final
{
public:
	class FString                                 AIDebuggerSoftClassPath;                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AIDebuggerRuntime.FortControllerComponent_AIDebugger.OnPlayerExitedIsland
// 0x0018 (0x0018 - 0x0000)
struct FortControllerComponent_AIDebugger_OnPlayerExitedIsland final
{
public:
	struct FEventMessageTag                       Channel;                                           // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPlayerExitSpatialActorContextWithPawn PlayerExitSpatialActorContext;                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AIDebuggerRuntime.FortControllerComponent_AIDebugger.SetVisualizationEnable
// 0x0002 (0x0002 - 0x0000)
struct FortControllerComponent_AIDebugger_SetVisualizationEnable final
{
public:
	EAIDebuggerVisualization                      VisualizationType;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AIDebuggerRuntime.FortControllerComponent_AIDebugger.VisualizeNavMeshID
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_AIDebugger_VisualizeNavMeshID final
{
public:
	int32                                         NavMeshID;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AIDebuggerRuntime.FortControllerComponent_AIDebugger.GetOrCreateRenderer
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_AIDebugger_GetOrCreateRenderer final
{
public:
	class UAIDebuggerRendererComponent*           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AIDebuggerRuntime.FortControllerComponent_AIDebugger.IsVisualizationEnabled
// 0x0002 (0x0002 - 0x0000)
struct FortControllerComponent_AIDebugger_IsVisualizationEnabled final
{
public:
	EAIDebuggerVisualization                      VisualizationType;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

