#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AIPatrolPath

#include "Basic.hpp"


namespace SDK
{

// Enum AIPatrolPath.EAIPatrolPathVersion
// NumValues: 0x0006
enum class EAIPatrolPathVersion : uint8
{
	InitialVersion                           = 0,
	TemplateFromQuickBarVersion              = 1,
	PatrolPointMovedToUserSettingsVersion    = 2,
	VersionPlusOne                           = 3,
	LatestVersion                            = 2,
	EAIPatrolPathVersion_MAX                 = 4,
};

// Enum AIPatrolPath.SegmentPathStatus
// NumValues: 0x0006
enum class ESegmentPathStatus : uint8
{
	INVALID                                  = 0,
	CALCULATING                              = 1,
	RECALCULATING_PENDING                    = 2,
	PATH_FAILED                              = 3,
	PATH_SUCCESS                             = 4,
	SegmentPathStatus_MAX                    = 5,
};

// ScriptStruct AIPatrolPath.PatrolPathSegmentDetails
// 0x0108 (0x0108 - 0x0000)
struct FPatrolPathSegmentDetails final
{
public:
	uint8                                         Pad_0[0xA8];                                       // 0x0000(0x00A8)(Fixing Size After Last Property [ Dumper-8 ])
	class UNavigationPath*                        Path;                                              // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIPatrolPathComponent*                 Start;                                             // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIPatrolPathComponent*                 End;                                               // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x48];                                      // 0x00C0(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

