#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ArenaViewMeTab

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ArenaViewMeTab.ArenaViewMeTab_C.ExecuteUbergraph_ArenaViewMeTab
// 0x01E8 (0x01E8 - 0x0000)
struct ArenaViewMeTab_C_ExecuteUbergraph_ArenaViewMeTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortTournamentDisplayInfo             K2Node_CustomEvent_ColorInfo;                      // 0x0008(0x01D0)()
	class UArenaPersonalView_C*                   K2Node_DynamicCast_AsArena_Personal_View;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ArenaViewMeTab.ArenaViewMeTab_C.Colorize
// 0x01D0 (0x01D0 - 0x0000)
struct ArenaViewMeTab_C_Colorize final
{
public:
	struct FFortTournamentDisplayInfo             ColorInfo;                                         // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

