#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AssembledMeshSystem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AssembledMeshSystem_structs.hpp"
#include "StructUtils_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AssembledMeshSystem.AssembledMeshSchema
// 0x0188 (0x01B8 - 0x0030)
class UAssembledMeshSchema final : public UPrimaryDataAsset
{
public:
	struct FGameplayTag                           MeshSchemaTag;                                     // 0x0030(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UCustomizableObjectInstance> CustomizableObjectInstance;                    // 0x0038(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCustomizableObject>     CustomizableObject;                                // 0x0058(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            SelectedIntParams;                                 // 0x0078(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, float>                    SelectedFloatParams;                               // 0x00C8(0x0050)(NativeAccessSpecifierPublic)
	struct FAssembledMeshAttachmentRules          AttachmentRules;                                   // 0x0118(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AnimClass;                                         // 0x0168(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SoundLibraryTags;                                  // 0x0188(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               AdditionalData;                                    // 0x01A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssembledMeshSchema">();
	}
	static class UAssembledMeshSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssembledMeshSchema>();
	}
};

// Class AssembledMeshSystem.AssembledMeshUserComponent
// 0x0038 (0x00D8 - 0x00A0)
class UAssembledMeshUserComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UAssembledMeshSchema*>           MeshParts;                                         // 0x00B0(0x0010)(Edit, Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FAssembledComponentReferences>  MeshPartComponents;                                // 0x00C0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                          bAssignMeshPartsOnBeginPlay;                       // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CustomizationCompleted(const int32 PartIndex);
	void GatherAndAssignAssembledMeshParts();
	class USkeletalMeshComponent* GetAttachToComponent();
	void OnRep_MeshParts();
	void SetMeshPart(class UAssembledMeshSchema* InMeshPart);

	class UAssembledMeshSchema* GetMeshPart() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssembledMeshUserComponent">();
	}
	static class UAssembledMeshUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssembledMeshUserComponent>();
	}
};

}

