#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AthenaWatchers

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaWatchers.AthenaWatchers_C.SpectatorsBegan
// 0x0001 (0x0001 - 0x0000)
struct AthenaWatchers_C_SpectatorsBegan final
{
public:
	bool                                          bBigGroup;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AthenaWatchers.AthenaWatchers_C.SpectatorsAdded
// 0x0001 (0x0001 - 0x0000)
struct AthenaWatchers_C_SpectatorsAdded final
{
public:
	bool                                          bBigGroup;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AthenaWatchers.AthenaWatchers_C.SpectatorCountChanged_BP
// 0x0004 (0x0004 - 0x0000)
struct AthenaWatchers_C_SpectatorCountChanged_BP final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AthenaWatchers.AthenaWatchers_C.ExecuteUbergraph_AthenaWatchers
// 0x0018 (0x0018 - 0x0000)
struct AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBigGroup_1;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBigGroup;                            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         K2Node_Event_NewCount;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

