#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Athena_VariantCustomizationSelector

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_VariantCustomizationSelector.Athena_VariantCustomizationSelector_C
// 0x0078 (0x0360 - 0x02E8)
class UAthena_VariantCustomizationSelector_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortVariantSelectorVM*                 FortVariantSelectorVM;                             // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               Container_PrimaryTabs;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Container_SecondaryTabs;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_VariantOptions;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoCapes;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PrimaryFilter;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SecondaryFilter;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_C*                      WBP_UIKit_Tabs_PrimaryFilter;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_C*                      WBP_UIKit_Tabs_SecondaryFilter;                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowCapeRestriction;                              // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnVariantRowsSet;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             DefaultFilterIcon;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetVariantRows(TArray<class UFortVariantSetVM*>& VariantSetVMs);
	void SetSecondaryFiltersVisibility(TArray<class UFortVariantSelectorSubFilterVM*>& SubFilters);
	void SetSecondaryFiltersViewModel(TArray<class UFortVariantSelectorSubFilterVM*>& SubFilters);
	void SetPrimaryFiltersVisibility(TArray<class UFortVariantSelectorFilterVM*>& Filters);
	void SetPrimaryFiltersViewModel(TArray<class UFortVariantSelectorFilterVM*>& Filters);
	void PreConstruct(bool IsDesignTime);
	void OnSecondaryFilterTabSelected(class FName TabID);
	void OnPrimaryFilterTabSelected(class FName TabID);
	void OnPrimaryFilterSelectionChanged(class UObject* Item, bool bIsSelected);
	void On_Secondary_Filter_Changed(class UObject* Item, bool bIsSelected);
	void Get_Icon(TSoftObjectPtr<class UObject> Asset, class UTexture2D** Texture);
	void ExecuteUbergraph_Athena_VariantCustomizationSelector(int32 EntryPoint);
	void Destruct();
	void Construct();

	void GetFocusTarget(class UWidget** Target) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_VariantCustomizationSelector_C">();
	}
	static class UAthena_VariantCustomizationSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_VariantCustomizationSelector_C>();
	}
};

}

