#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AthenaFrontEndMiniMapManager

#include "Basic.hpp"

#include "WeeklyMapImages_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaFrontEndMiniMapManager.AthenaFrontEndMiniMapManager_C
// 0x0040 (0x0510 - 0x04D0)
class AAthenaFrontEndMiniMapManager_C final : public AFortFrontEndMiniMapManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         WeekOffset;                                        // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FWeeklyMapImages>               WeeklyMapImages;                                   // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture*                               MapTextureToUse;                                   // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               MapOpacityTextureToUse;                            // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               DiscoverabilityTextureToUse;                       // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ProcessLocalPlayerControllers();
	void OverrideDiscoveryTextureParameter(class UMaterialInstanceDynamic* StencilMID);
	void OnLoaded_CD1281E5466FE910E9243996A15BCA7E(class UObject* Loaded);
	void OnLoaded_C4ACD66342B728F64013EEBA5493D7DE(class UObject* Loaded);
	void OnLoaded_A6499F9143933E805D1FA5B551082E73(class UObject* Loaded);
	void ExecuteUbergraph_AthenaFrontEndMiniMapManager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaFrontEndMiniMapManager_C">();
	}
	static class AAthenaFrontEndMiniMapManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaFrontEndMiniMapManager_C>();
	}
};

}

