#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AtomRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Enum AtomRuntime.EAtomModelMergedMeshSelection
// NumValues: 0x0004
enum class EAtomModelMergedMeshSelection : uint8
{
	AllMeshes                                = 0,
	OnlyOpaqueMeshes                         = 1,
	OnlyTransparentMeshes                    = 2,
	EAtomModelMergedMeshSelection_MAX        = 3,
};

// Enum AtomRuntime.EAtomMaterialType
// NumValues: 0x0006
enum class EAtomMaterialType : uint8
{
	Standard                                 = 0,
	Transparent                              = 1,
	Glitter                                  = 2,
	Opalescent                               = 3,
	Metallic                                 = 4,
	EAtomMaterialType_MAX                    = 5,
};

// Enum AtomRuntime.EAtomPrimitiveCollisionVolumeType
// NumValues: 0x0007
enum class EAtomPrimitiveCollisionVolumeType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	Cylinder                                 = 3,
	Tube                                     = 4,
	Crate                                    = 5,
	EAtomPrimitiveCollisionVolumeType_MAX    = 6,
};

// Enum AtomRuntime.EPrimitiveAutoCollisionType
// NumValues: 0x0008
enum class EPrimitiveAutoCollisionType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	NDOP10_X                                 = 2,
	NDOP10_Y                                 = 3,
	NDOP10_Z                                 = 4,
	NDOP18                                   = 5,
	NDOP26                                   = 6,
	EPrimitiveAutoCollisionType_MAX          = 7,
};

// Enum AtomRuntime.EPrimitiveGeometryComplexity
// NumValues: 0x0004
enum class EPrimitiveGeometryComplexity : uint8
{
	JustShell                                = 0,
	ShellWithInsideDetails                   = 1,
	ShellWithFlatCap                         = 2,
	EPrimitiveGeometryComplexity_MAX         = 3,
};

// Enum AtomRuntime.EGetCommonPartDescriptionResult
// NumValues: 0x0003
enum class EGetCommonPartDescriptionResult : uint8
{
	Valid                                    = 0,
	Invalid                                  = 1,
	EGetCommonPartDescriptionResult_MAX      = 2,
};

// Enum AtomRuntime.EAtomShaderType
// NumValues: 0x000B
enum class EAtomShaderType : uint32
{
	Unknown                                  = 0,
	ShinyPlastic                             = 1,
	MattePlastic                             = 2,
	Rubber                                   = 3,
	ShinySteel                               = 4,
	BrushedSteel                             = 5,
	MatteSteel                               = 6,
	Glitter                                  = 7,
	Metallic                                 = 8,
	Opalescence                              = 9,
	EAtomShaderType_MAX                      = 10,
};

// Enum AtomRuntime.EColorEffects
// NumValues: 0x0005
enum class EColorEffects : uint8
{
	None                                     = 0,
	Metallic                                 = 1,
	Glitter                                  = 2,
	Opalescent                               = 3,
	EColorEffects_MAX                        = 4,
};

// Enum AtomRuntime.EAtomModelCommonPartOptimizationFlag
// NumValues: 0x0007
enum class EAtomModelCommonPartOptimizationFlag : uint8
{
	None                                     = 0,
	RemoveConnected                          = 1,
	RemoveKnobs                              = 2,
	RemoveTubes                              = 4,
	RemovePins                               = 8,
	All                                      = 15,
	EAtomModelCommonPartOptimizationFlag_MAX = 16,
};

// Enum AtomRuntime.EAtomModelPivotAnchor
// NumValues: 0x0005
enum class EAtomModelPivotAnchor : uint32
{
	Original                                 = 0,
	TopCenter                                = 1,
	Center                                   = 2,
	BottomCenter                             = 3,
	EAtomModelPivotAnchor_MAX                = 4,
};

// Enum AtomRuntime.EAtomIssue
// NumValues: 0x0011
enum class EAtomIssue : uint32
{
	None                                     = 0,
	FailedToLoadModelFile                    = 1,
	UnsupportedLxFMLVersion                  = 2,
	UnsupportedLxFMLSticker                  = 3,
	MissingPrimitive                         = 4,
	MismatchedPrimitive                      = 5,
	UnsupportedPrimitive                     = 6,
	UnplacedPrimitive                        = 7,
	MissingPrimitiveSourceGeometry           = 8,
	ExcludedByFilter                         = 9,
	UnsupportedCommonPart                    = 10,
	OldVersionPrimitive                      = 11,
	UnknownDecorationTexture                 = 12,
	UnknownDecorationSurface                 = 13,
	DuplicatedSelectionSet                   = 14,
	EmptySelectionSet                        = 15,
	EAtomIssue_MAX                           = 16,
};

// Enum AtomRuntime.EAtomModelInstanceType
// NumValues: 0x0006
enum class EAtomModelInstanceType : uint8
{
	Components                               = 0,
	Actors                                   = 1,
	HISM                                     = 2,
	ComponentsWithVertexColor                = 3,
	RenderStylesComponents                   = 4,
	EAtomModelInstanceType_MAX               = 5,
};

// Enum AtomRuntime.EAtomPlatform
// NumValues: 0x0016
enum class EAtomPlatform : uint8
{
	NA                                       = 0,
	Duplo                                    = 1,
	Atom                                     = 2,
	Technic                                  = 3,
	Clickits                                 = 4,
	ActionFigures                            = 5,
	Outdoor                                  = 6,
	SoftPrimitives                           = 7,
	ExtendedLine                             = 8,
	Scala                                    = 9,
	Znap                                     = 10,
	Toolo                                    = 11,
	Storage                                  = 12,
	MusicBuilder                             = 13,
	StoryBuilder                             = 14,
	Quatro                                   = 15,
	Ccbs                                     = 16,
	Primo1                                   = 17,
	AtomFoundation                           = 18,
	DieCutToStickers                         = 98,
	GeneralPlatform                          = 99,
	EAtomPlatform_MAX                        = 100,
};

// Enum AtomRuntime.EAtomCommonPartType
// NumValues: 0x001A
enum class EAtomCommonPartType : uint8
{
	None                                     = 0,
	Dknob_01_C                               = 1,
	Dknob_01_D                               = 2,
	Dpin_01_C                                = 3,
	Dtube_01_C                               = 4,
	Dtube_02_C                               = 5,
	Dtube_03_C                               = 6,
	Dtube_04_C                               = 7,
	knob_01_C                                = 8,
	knob_01_D                                = 9,
	knob_01_P                                = 10,
	knob_01_PC                               = 11,
	knob_02_P                                = 12,
	knob_02_PC                               = 13,
	knob_03_P                                = 14,
	knob_03_PC                               = 15,
	knob_04_P                                = 16,
	knob_04_PC                               = 17,
	pin_01_C                                 = 18,
	pin_01_D                                 = 19,
	pin_02_C                                 = 20,
	pin_02_D                                 = 21,
	tube_01_D                                = 22,
	tube_02_D                                = 23,
	tube_03_D                                = 24,
	EAtomCommonPartType_MAX                  = 25,
};

// Enum AtomRuntime.EAtomCommonPartCategory
// NumValues: 0x0005
enum class EAtomCommonPartCategory : uint8
{
	None                                     = 0,
	Knob                                     = 1,
	Pin                                      = 2,
	Tube                                     = 3,
	EAtomCommonPartCategory_MAX              = 4,
};

// Enum AtomRuntime.EAtomPrimitiveImportWarningFlags
// NumValues: 0x0009
enum class EAtomPrimitiveImportWarningFlags : uint8
{
	None                                     = 0,
	UnableToFindUnwrappedMeshUVSet           = 1,
	BrokenPrincipalUVSet                     = 2,
	InvalidFBXFile                           = 4,
	InvalidMeshInFBXScene                    = 8,
	CommonPartMeshNotFound                   = 16,
	FullyTriangulated                        = 32,
	TransformedMeshes                        = 64,
	EAtomPrimitiveImportWarningFlags_MAX     = 65,
};

// Enum AtomRuntime.EAtomPrimitiveGeoOptimization
// NumValues: 0x0004
enum class EAtomPrimitiveGeoOptimization : uint8
{
	Default                                  = 0,
	UseForDetailOnly                         = 1,
	UseApproximationForLODs                  = 2,
	EAtomPrimitiveGeoOptimization_MAX        = 3,
};

// Enum AtomRuntime.EAtomPrimitiveGeoOptimization_Old
// NumValues: 0x0004
enum class EAtomPrimitiveGeoOptimization_Old : uint32
{
	Default                                  = 0,
	UseForDetailOnly                         = 1,
	UseApproximationForLODs                  = 2,
	EAtomPrimitiveGeoOptimization_MAX        = 3,
};

// Enum AtomRuntime.EAtomPrimitiveApproximationShapeType
// NumValues: 0x0006
enum class EAtomPrimitiveApproximationShapeType : uint8
{
	Auto                                     = 0,
	OrientedBox                              = 1,
	ExtrudedConvexHull2D                     = 2,
	ConvexHull3D                             = 3,
	Extrusion                                = 4,
	EAtomPrimitiveApproximationShapeType_MAX = 5,
};

// Enum AtomRuntime.EAtomPrimitiveApproximationShapeType_Old
// NumValues: 0x0006
enum class EAtomPrimitiveApproximationShapeType_Old : uint32
{
	Auto                                     = 0,
	OrientedBox                              = 1,
	ExtrudedConvexHull2D                     = 2,
	ConvexHull3D                             = 3,
	Extrusion                                = 4,
	EAtomPrimitiveApproximationShapeType_MAX = 5,
};

// Enum AtomRuntime.EConnectionFieldType
// NumValues: 0x000B
enum class EConnectionFieldType : uint8
{
	Planar                                   = 0,
	Hinge                                    = 1,
	Axle                                     = 2,
	Ball                                     = 3,
	Cardan                                   = 4,
	Fixed                                    = 5,
	Rail                                     = 6,
	Slider                                   = 7,
	Gear                                     = 8,
	User                                     = 9,
	EConnectionFieldType_MAX                 = 10,
};

// Enum AtomRuntime.EConnectionFieldSuperType
// NumValues: 0x0004
enum class EConnectionFieldSuperType : uint8
{
	Planar                                   = 0,
	Line                                     = 1,
	Point                                    = 2,
	EConnectionFieldSuperType_MAX            = 3,
};

// Enum AtomRuntime.EConnectionFieldGender
// NumValues: 0x0004
enum class EConnectionFieldGender : uint8
{
	Receptor                                 = 0,
	Connector                                = 1,
	Any                                      = 2,
	EConnectionFieldGender_MAX               = 3,
};

// Enum AtomRuntime.EFieldConnectResult
// NumValues: 0x000F
enum class EFieldConnectResult : uint8
{
	NoConnection                             = 0,
	Rejection                                = 1,
	FixedConnection                          = 2,
	FreeConnection                           = 3,
	HingeConnection                          = 4,
	CardanConnection                         = 5,
	BallConnection                           = 6,
	PrismaticConnection                      = 7,
	CylindricalConnection                    = 8,
	PrismaticAPerpendicularHingeConnection   = 9,
	PrismaticBPerpendicularHingeConnection   = 10,
	ConnectResultMax                         = 11,
	FirstConnection                          = 2,
	LastConnection                           = 10,
	EFieldConnectResult_MAX                  = 12,
};

// Enum AtomRuntime.EAxleDiameter
// NumValues: 0x0004
enum class EAxleDiameter : uint8
{
	Tiny                                     = 0,
	Medium                                   = 1,
	Large                                    = 2,
	EAxleDiameter_MAX                        = 3,
};

// Enum AtomRuntime.EConnectionAxleType
// NumValues: 0x0018
enum class EConnectionAxleType : uint8
{
	UnusedReceptor                           = 0,
	UnusedConnector                          = 1,
	RoundAxleReceptor                        = 2,
	RoundAxleConnector                       = 3,
	CrossAxleReceptor                        = 4,
	CrossAxleConnector                       = 5,
	SecondaryPinReceptor                     = 6,
	SecondaryPinConnector                    = 7,
	PlateRoundCrossAxleReceptor              = 8,
	UnusedPlateRoundCrossAxleConnector       = 9,
	MiniFigNeckReceptor                      = 10,
	MiniFigNeckConnector                     = 11,
	RoundCrossAxleReceptor                   = 12,
	RoundCrossAxleConnector                  = 13,
	TinyPinReceptor                          = 14,
	TinyPinConnector                         = 15,
	UnusedCrossAxlePegHoleCapAlignmentReceptor = 16,
	CrossAxlePegHoleCapAlignmentConnector    = 17,
	UnusedRoundAxleReceptorDontRejectSecondaryPinConnector = 18,
	RoundAxleConnectorDontRejectSecondaryPinConnector = 19,
	UnusedSecondaryPinReceptorDontRejectTinyPinConnector = 20,
	SecondaryPinConnectorDontRejectTinyPinConnector = 21,
	SubTypeSize                              = 22,
	EConnectionAxleType_MAX                  = 23,
};

// Enum AtomRuntime.EConnectionPointType
// NumValues: 0x002F
enum class EConnectionPointType : uint8
{
	Knob                                     = 0,
	HollowKnob                               = 1,
	KnobFitInPegHole                         = 2,
	HollowKnobFitInPegHole                   = 3,
	SquareKnob                               = 4,
	Tube                                     = 5,
	TubeWithRib                              = 6,
	BottomTube                               = 7,
	BottomTubeWithRib                        = 8,
	SecondaryPin                             = 9,
	SecondaryPinWithRib                      = 10,
	SecondaryPinWithTinyPinReceptor          = 11,
	SecondaryPinWithRibAndTinyPinReceptor    = 12,
	FixedTube                                = 13,
	FixedTubeWithAntiKnob                    = 14,
	AntiKnob                                 = 15,
	PegHole                                  = 16,
	SquareAntiKnob                           = 17,
	TubeGap                                  = 18,
	TubeGrabber                              = 19,
	TinyPin                                  = 20,
	TinyPinReceptor                          = 21,
	Edge                                     = 22,
	EdgeGap                                  = 23,
	KnobReject                               = 24,
	PowerFuncLeftTop                         = 25,
	PowerFuncRightTop                        = 26,
	PowerFuncLeftBottom                      = 27,
	PowerFuncRightBottom                     = 28,
	VoidFeature                              = 29,
	DuploKnob                                = 30,
	DuploHollowKnob                          = 31,
	DuploAntiKnob                            = 32,
	DuploTube                                = 33,
	DuploFixedTube                           = 34,
	DuploTubeGap                             = 35,
	DuploAnimalKnob                          = 36,
	DuploAnimalTube                          = 37,
	SecondaryPinReceptor                     = 38,
	DuploFixedAnimalTube                     = 39,
	DuploSecondaryPinWithRib                 = 40,
	DuploSecondaryPin                        = 41,
	DuploKnobReject                          = 42,
	_size                                    = 43,
	_duploBegin                              = 30,
	_duploEnd                                = 42,
	EConnectionPointType_MAX                 = 44,
};

// Enum AtomRuntime.EConnectionPointFlags
// NumValues: 0x0015
enum class EConnectionPointFlags : uint32
{
	SquareFeature                            = 1,
	RoundFeature                             = 2,
	KnobWithHole                             = 4,
	KnobWithMiniFigHandHole                  = 8,
	KnobWithSingleCollision                  = 16,
	SingleFeature                            = 32,
	ReceptorDontRemoveKnobCollision          = 64,
	KnobWithoutCollision                     = 128,
	CreationValidFlags                       = 255,
	ThisSideTransparent                      = 256,
	ThisSideHidden                           = 512,
	DynamicValidFlags                        = 768,
	InternalIsDuploSecondaryPin              = 268435456,
	InternalIsQuadConnector                  = 536870912,
	InternalIsSecondaryPin                   = 1073741824,
	InternalIsAnyKnob                        = 2147483648,
	SquareOcclusionShapeIndex                = 1,
	RoundOcclusionShapeIndex                 = 2,
	OtherOcclusionShapeIndex                 = 0,
	OcclusionShapeMask                       = 3,
	EConnectionPointFlags_MAX                = 2147483649,
};

// ScriptStruct AtomRuntime.AtomColorInfo
// 0x0020 (0x0028 - 0x0008)
struct FAtomColorInfo final : public FTableRowBase
{
public:
	struct FColor                                 Color;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomMaterialType                             MaterialType;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomMergedMeshLODDistanceSettings
// 0x0020 (0x0020 - 0x0000)
struct FAtomMergedMeshLODDistanceSettings final
{
public:
	bool                                          bOverrideLODScreenSizes;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BaseLODScreenSize;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseLODScreenSizeScaling;                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<float>                                 LODDistances;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.CommonPartInstanceDescription
// 0x0040 (0x0040 - 0x0000)
struct FCommonPartInstanceDescription final
{
public:
	struct FTransform3f                           Transform;                                         // 0x0000(0x0030)(Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         MeshIdx;                                           // 0x0030(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         MaterialIdx;                                       // 0x0032(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         UUIDIdx;                                           // 0x0034(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ColorId;                                           // 0x0036(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomCommonPartInstancesCache
// 0x0050 (0x0050 - 0x0000)
struct FAtomCommonPartInstancesCache final
{
public:
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          UUIDs;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCommonPartInstanceDescription> Instances;                                         // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform3f>                   InstanceTransforms;                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomCommonPartAssetDescription
// 0x000C (0x000C - 0x0000)
struct FAtomCommonPartAssetDescription final
{
public:
	EAtomCommonPartType                           CommonPartType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   CommonPartStyle;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomModelPartGuid
// 0x0014 (0x0014 - 0x0000)
struct FAtomModelPartGuid final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartIndex;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomModelPartColorInfo
// 0x000C (0x000C - 0x0000)
struct FAtomModelPartColorInfo final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColorId;                                           // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomMaterialType                             MaterialType;                                      // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomModelPartDecorationInfo
// 0x0028 (0x0028 - 0x0000)
struct FAtomModelPartDecorationInfo final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PrimitiveSurfaceName;                              // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrimitiveSurfaceIndex;                             // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomCommonPartAndTransform
// 0x0070 (0x0070 - 0x0000)
struct FAtomCommonPartAndTransform final
{
public:
	EAtomCommonPartType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomModelPartInstanceInfo
// 0x0080 (0x0080 - 0x0000)
struct FAtomModelPartInstanceInfo final
{
public:
	struct FAtomModelPartGuid                     PartGuid;                                          // 0x0000(0x0014)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         PartId;                                            // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAtomPrimitive*                         Primitive;                                         // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     Transforms;                                        // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartDecorationInfo>   Decorations;                                       // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartColorInfo>        Colors;                                            // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         SelectionSets;                                     // 0x0058(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomCommonPartAndTransform>    CommonParts;                                       // 0x0068(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsUndersideVisible;                               // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomModelPartsCollection
// 0x0080 (0x0080 - 0x0000)
struct FAtomModelPartsCollection final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Pivot;                                             // 0x0010(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartInstanceInfo>     Parts;                                             // 0x0070(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeBox
// 0x0048 (0x0048 - 0x0000)
struct FAtomPrimitiveCollisionVolumeBox final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                HalfExtent;                                        // 0x0030(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeCapsule
// 0x0038 (0x0038 - 0x0000)
struct FAtomPrimitiveCollisionVolumeCapsule final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfLength;                                        // 0x0034(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeCylinder
// 0x0038 (0x0038 - 0x0000)
struct FAtomPrimitiveCollisionVolumeCylinder final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfLength;                                        // 0x0034(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeTube
// 0x0040 (0x0040 - 0x0000)
struct FAtomPrimitiveCollisionVolumeTube final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterRadius;                                       // 0x0034(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfLength;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeSphere
// 0x0020 (0x0020 - 0x0000)
struct FAtomPrimitiveCollisionVolumeSphere final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeContainer
// 0x0050 (0x0050 - 0x0000)
struct FAtomPrimitiveCollisionVolumeContainer final
{
public:
	TArray<struct FAtomPrimitiveCollisionVolumeBox> Boxes;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeSphere> Spheres;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeCapsule> Capsules;                                    // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeCylinder> Cylinders;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeTube> Tubes;                                          // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionGeometry
// 0x0078 (0x0078 - 0x0000)
struct FAtomPrimitiveCollisionGeometry final
{
public:
	struct FKAggregateGeom                        AggGeom;                                           // 0x0000(0x0078)(NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomPrimitiveGeometryLODs
// 0x0090 (0x0090 - 0x0000)
struct FAtomPrimitiveGeometryLODs final
{
public:
	TArray<class UAtomPrimitiveGeometry*>         GeometryLODs;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 HiResNaniteGeomery;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveCollisionGeometry        Collision;                                         // 0x0018(0x0078)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomPrimitiveGeometryAndTransform
// 0x0040 (0x0040 - 0x0000)
struct FAtomPrimitiveGeometryAndTransform final
{
public:
	class UAtomPrimitiveGeometry*                 AtomPrimitiveGeometry;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform3f                           Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.ConnectionField
// 0x0040 (0x0040 - 0x0000)
struct FConnectionField
{
public:
	struct FQuat                                  Rotation;                                          // 0x0000(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Subtype;                                           // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionFieldType                          Type;                                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldLine
// 0x0010 (0x0050 - 0x0040)
struct FConnectionFieldLine : public FConnectionField
{
public:
	double                                        Length;                                            // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartCapped;                                       // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EndCapped;                                         // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldAxle
// 0x0010 (0x0060 - 0x0050)
struct FConnectionFieldAxle final : public FConnectionFieldLine
{
public:
	bool                                          Grabbing;                                          // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequireGrabbing;                                   // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DiscreteSnapInterval;                              // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldPoint
// 0x0000 (0x0040 - 0x0040)
struct FConnectionFieldPoint : public FConnectionField
{
};

// ScriptStruct AtomRuntime.ConnectionFieldBall
// 0x0000 (0x0040 - 0x0040)
struct FConnectionFieldBall final : public FConnectionFieldPoint
{
};

// ScriptStruct AtomRuntime.ConnectionPoint
// 0x0008 (0x0008 - 0x0000)
struct FConnectionPoint final
{
public:
	EConnectionPointFlags                         Flags;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionPointType                          Type;                                              // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Size;                                              // 0x0005(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldPlanar
// 0x0020 (0x0060 - 0x0040)
struct FConnectionFieldPlanar final : public FConnectionField
{
public:
	uint8                                         Width;                                             // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Height;                                            // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FConnectionPoint>               Points;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldContainer
// 0x0030 (0x0030 - 0x0000)
struct FConnectionFieldContainer final
{
public:
	TArray<struct FConnectionFieldPlanar>         PlanarFields;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               LineFields;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               PointFields;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.ConnectionFieldFixed
// 0x0010 (0x0050 - 0x0040)
struct FConnectionFieldFixed final : public FConnectionFieldPoint
{
public:
	uint32                                        Axes;                                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldGear
// 0x0010 (0x0060 - 0x0050)
struct FConnectionFieldGear final : public FConnectionFieldLine
{
public:
	double                                        Radius;                                            // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ToothCount;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldHinge
// 0x0030 (0x0070 - 0x0040)
struct FConnectionFieldHinge final : public FConnectionFieldPoint
{
public:
	bool                                          Oriented;                                          // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Flip;                                              // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasLimits;                                         // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequireGrabbing;                                   // 0x0043(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        OrientedMin;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OrientedMax;                                       // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FlippedMin;                                        // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FlippedMax;                                        // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectionFieldSlider
// 0x0020 (0x0070 - 0x0050)
struct FConnectionFieldSlider final : public FConnectionFieldLine
{
public:
	bool                                          Cylindrical;                                       // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasSpring;                                         // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        SpringRest;                                        // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SpringStrength;                                    // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SpringDamping;                                     // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.PlanarFieldPointConnectionInfo
// 0x0004 (0x0004 - 0x0000)
struct FPlanarFieldPointConnectionInfo final
{
public:
	uint16                                        IndexA;                                            // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        IndexB;                                            // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.PlanarFieldConnectionInfo
// 0x0020 (0x0020 - 0x0000)
struct FPlanarFieldConnectionInfo final
{
public:
	TArray<struct FPlanarFieldPointConnectionInfo> PointConnections;                                 // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EFieldConnectResult                           ConnectResult;                                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        OverlapA;                                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        OverlapB;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.ConnectivityFieldReference
// 0x0008 (0x0008 - 0x0000)
struct FConnectivityFieldReference final
{
public:
	int32                                         ObjectId;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        FieldIndex;                                        // 0x0004(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.SerializedPlanarConnection
// 0x0030 (0x0030 - 0x0000)
struct FSerializedPlanarConnection final
{
public:
	struct FPlanarFieldConnectionInfo             Connection;                                        // 0x0000(0x0020)(NativeAccessSpecifierPublic)
	struct FConnectivityFieldReference            FieldA;                                            // 0x0020(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	struct FConnectivityFieldReference            FieldB;                                            // 0x0028(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.SerializedConnectivityObjects
// 0x0020 (0x0020 - 0x0000)
struct FSerializedConnectivityObjects final
{
public:
	TArray<struct FConnectionFieldContainer>      Fields;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSerializedPlanarConnection>    PlanarConnections;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.PlanarFieldPointInfo
// 0x0020 (0x0020 - 0x0000)
struct FPlanarFieldPointInfo final
{
public:
	struct FVector                                PointLocation;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionPointType                          PointType;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAvailable;                                       // 0x0019(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.PlanarFieldInfo
// 0x0090 (0x0090 - 0x0000)
struct FPlanarFieldInfo final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionFieldGender                        PlanarFieldType;                                   // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPlanarFieldPointInfo>          PointInfo;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.WorldConnectivityHandle
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FWorldConnectivityHandle final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct AtomRuntime.AtomColor
// 0x0018 (0x0018 - 0x0000)
struct FAtomColor final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EColorEffects                                 Effects;                                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomColorSurface
// 0x0008 (0x0008 - 0x0000)
struct FAtomColorSurface final
{
public:
	int32                                         ColorId;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomShaderType                               ShaderType;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomDecorationAssignment
// 0x0030 (0x0030 - 0x0000)
struct FAtomDecorationAssignment final
{
public:
	class FString                                 SurfaceName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TextureName;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomRuntime.AtomModelPrimitiveInstance
// 0x0090 (0x0090 - 0x0000)
struct FAtomModelPrimitiveInstance final
{
public:
	class UAtomPrimitive*                         Primitive;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             PrimitiveTransform;                                // 0x0010(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PivotOrigin;                                       // 0x0070(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
