#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AtomRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AtomRuntime_structs.hpp"


namespace SDK::Params
{

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.AddPartInstance
// 0x0100 (0x0100 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_AddPartInstance final
{
public:
	struct FAtomModelPartsCollection              PartCollection;                                    // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartInstanceInfo             PartInstance;                                      // 0x0080(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.CreateColorInfoFromColorId
// 0x0010 (0x0010 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_CreateColorInfoFromColorId final
{
public:
	int32                                         ColorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartColorInfo                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterGroup
// 0x0130 (0x0130 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterGroup final
{
public:
	class UAtomModel*                             Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 GroupName;                                         // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x00A0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x00B0(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterNonTransparent
// 0x0110 (0x0110 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterNonTransparent final
{
public:
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x0090(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterSelectionSet
// 0x0120 (0x0120 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterSelectionSet final
{
public:
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 SelectionSetName;                                  // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x00A0(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterTransparent
// 0x0110 (0x0110 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterTransparent final
{
public:
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x0090(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.GetName
// 0x0090 (0x0090 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_GetName final
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.GetParts
// 0x0090 (0x0090 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_GetParts final
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartInstanceInfo>     ReturnValue;                                       // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.InitializeCommonParts
// 0x0110 (0x0110 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_InitializeCommonParts final
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UAtomModel*                       Model;                                             // 0x0080(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveConnectedParts;                             // 0x008C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAllKnobs;                                   // 0x008D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAllTubes;                                   // 0x008E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAllPins;                                    // 0x008F(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x0090(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.RemovePartInstance
// 0x00A0 (0x00A0 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_RemovePartInstance final
{
public:
	struct FAtomModelPartsCollection              PartCollection;                                    // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartGuid                     PartInstanceId;                                    // 0x0080(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.ReplacePartInstance
// 0x0120 (0x0120 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_ReplacePartInstance final
{
public:
	struct FAtomModelPartsCollection              PartCollection;                                    // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartInstanceInfo             SourcePartInstance;                                // 0x0080(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartGuid                     TargetPartInstanceId;                              // 0x0100(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0xC];                                      // 0x0114(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.SetName
// 0x0090 (0x0090 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_SetName final
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveBlueprintLibrary.GetDefaultPrimitiveScale
// 0x0004 (0x0004 - 0x0000)
struct AtomPrimitiveBlueprintLibrary_GetDefaultPrimitiveScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.CreateAtomGeometryFromCommonPart
// 0x0020 (0x0020 - 0x0000)
struct AtomPrimitiveGeometry_CreateAtomGeometryFromCommonPart final
{
public:
	class FString                                 ExportStyleName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomCommonPartType                           CommonPartType;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         LODIndex;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.CreateEmptyAtomGeometry
// 0x0008 (0x0008 - 0x0000)
struct AtomPrimitiveGeometry_CreateEmptyAtomGeometry final
{
public:
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.GetNumberOfCommonPartLODs
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometry_GetNumberOfCommonPartLODs final
{
public:
	class FString                                 ExportStyleName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomCommonPartType                           CommonPartType;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.Append
// 0x0050 (0x0050 - 0x0000)
struct AtomPrimitiveGeometry_Append final
{
public:
	const class UAtomPrimitiveGeometry*           GeometryToAppend;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform3f                           Transform;                                         // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.AppendAndWeld
// 0x0050 (0x0050 - 0x0000)
struct AtomPrimitiveGeometry_AppendAndWeld final
{
public:
	const class UAtomPrimitiveGeometry*           GeometryToAppend;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform3f                           Transform;                                         // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.BakeScale
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_BakeScale final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.BakeTransform
// 0x0040 (0x0040 - 0x0000)
struct AtomPrimitiveGeometry_BakeTransform final
{
public:
	struct FTransform3f                           Transform;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.BakeTransforms
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometry_BakeTransforms final
{
public:
	TArray<struct FTransform3f>                   Transforms;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SetMaterialName
// 0x0020 (0x0020 - 0x0000)
struct AtomPrimitiveGeometry_SetMaterialName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PolygonGroupIndex;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SetTiledUVs
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_SetTiledUVs final
{
public:
	float                                         TileSize;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SetVertexColor
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_SetVertexColor final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.DuplicateGeometry
// 0x0008 (0x0008 - 0x0000)
struct AtomPrimitiveGeometry_DuplicateGeometry final
{
public:
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.GetMaterialNames
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_GetMaterialNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SplitByPolygonGroup
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_SplitByPolygonGroup final
{
public:
	TArray<class UAtomPrimitiveGeometry*>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.ToSimplifiedStaticMesh
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveGeometry_ToSimplifiedStaticMesh final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                Outer_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFastBuild;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UStaticMesh*                            ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetCapsGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetCapsGeometry final
{
public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetDetailsGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetDetailsGeometry final
{
public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetGeometry final
{
public:
	EPrimitiveGeometryComplexity                  PrimitiveGeometryComplexity;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetGeometryWithMaterialNames
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetGeometryWithMaterialNames final
{
public:
	EPrimitiveGeometryComplexity                  PrimitiveGeometryComplexity;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ShellMaterial;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UndersideMaterial;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetPartsGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetPartsGeometry final
{
public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledCapsGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledCapsGeometry final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledDetailsGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledDetailsGeometry final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledGeometry final
{
public:
	EPrimitiveGeometryComplexity                  PrimitiveGeometryComplexity;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Scale;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledShellGeometry
// 0x0050 (0x0050 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledShellGeometry final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAtomPrimitiveGeometryAndTransform     ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetShellGeometry
// 0x0040 (0x0040 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetShellGeometry final
{
public:
	struct FAtomPrimitiveGeometryAndTransform     ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetExportStyleName
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetExportStyleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetAllColorInfo
// 0x0050 (0x0050 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetAllColorInfo final
{
public:
	TMap<int32, struct FAtomColorInfo>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetBitPackForColor
// 0x0008 (0x0008 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetBitPackForColor final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetBitPackForColorId
// 0x0008 (0x0008 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetBitPackForColorId final
{
public:
	int32                                         AtomColorId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetCommonPartAssetDescriptionFromStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetCommonPartAssetDescriptionFromStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomCommonPartAssetDescription        OutDescription;                                    // 0x0008(0x000C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	EGetCommonPartDescriptionResult               OutIsValid;                                        // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetCommonPartCategoryFromType
// 0x0002 (0x0002 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetCommonPartCategoryFromType final
{
public:
	EAtomCommonPartType                           CommonPartType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomCommonPartCategory                       ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetCommonPartDescriptionFromType
// 0x0014 (0x0014 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetCommonPartDescriptionFromType final
{
public:
	EAtomCommonPartType                           CommonPartType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAtomCommonPartDescription             OutDescription;                                    // 0x0004(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetInfoForColorId
// 0x0030 (0x0030 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetInfoForColorId final
{
public:
	int32                                         ColorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAtomColorInfo                         ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeSettings.GetColorDataTable
// 0x0008 (0x0008 - 0x0000)
struct AtomRuntimeSettings_GetColorDataTable final
{
public:
	const class UDataTable*                       ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.DisconnectAllObjectConnections
// 0x0004 (0x0004 - 0x0000)
struct WorldConnectivitySubsystem_DisconnectAllObjectConnections final
{
public:
	struct FWorldConnectivityHandle               Object;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.DisconnectObjects
// 0x0008 (0x0008 - 0x0000)
struct WorldConnectivitySubsystem_DisconnectObjects final
{
public:
	struct FWorldConnectivityHandle               ObjectA;                                           // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FWorldConnectivityHandle               ObjectB;                                           // 0x0004(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetAtomModelAssetUserData
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_GetAtomModelAssetUserData final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModelAssetUserData*                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetClosestFieldToPoint
// 0x00C0 (0x00C0 - 0x0000)
struct WorldConnectivitySubsystem_GetClosestFieldToPoint final
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                WorldLocation;                                     // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionFieldGender                        Type;                                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0xE];                                       // 0x0022(0x000E)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPlanarFieldInfo                       ReturnValue;                                       // 0x0030(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetConnectedObjects
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivitySubsystem_GetConnectedObjects final
{
public:
	struct FWorldConnectivityHandle               Object;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FWorldConnectivityHandle>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetConnectedObjectsRecursively
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivitySubsystem_GetConnectedObjectsRecursively final
{
public:
	struct FWorldConnectivityHandle               Object;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FWorldConnectivityHandle>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetOverlapPenetrationDepth
// 0x0040 (0x0040 - 0x0000)
struct WorldConnectivitySubsystem_GetOverlapPenetrationDepth final
{
public:
	class AStaticMeshActor*                       Actor1;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AStaticMeshActor*                       Actor2;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetPlanarFields
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivitySubsystem_GetPlanarFields final
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EConnectionFieldGender                        Type;                                              // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPlanarFieldInfo>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.RegisterConnectivityActor
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_RegisterConnectivityActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAtomModel*                       Model;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.RegisterCustomConnectivityActor
// 0x0028 (0x0028 - 0x0000)
struct WorldConnectivitySubsystem_RegisterCustomConnectivityActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSerializedConnectivityObjects         ConnectivityObject;                                // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.RegisterModelActor
// 0x0028 (0x0028 - 0x0000)
struct WorldConnectivitySubsystem_RegisterModelActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSerializedConnectivityObjects         Connections;                                       // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.ReleaseConnectivityActor
// 0x0008 (0x0008 - 0x0000)
struct WorldConnectivitySubsystem_ReleaseConnectivityActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.TryConnectObjectAtLocation
// 0x0090 (0x0090 - 0x0000)
struct WorldConnectivitySubsystem_TryConnectObjectAtLocation final
{
public:
	struct FWorldConnectivityHandle               ObjectToConnect;                                   // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             DesiredObjectTransform;                            // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWorldConnectivityHandle>       ConnectionCandidates;                              // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          PerformConnection;                                 // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0xE];                                       // 0x0082(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetActor
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_GetActor final
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetConnectivityHandle
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_GetConnectivityHandle final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorldConnectivityHandle               ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetTransform
// 0x0070 (0x0070 - 0x0000)
struct WorldConnectivitySubsystem_GetTransform final
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.PlanarGridStepSize
// 0x0008 (0x0008 - 0x0000)
struct WorldConnectivitySubsystem_PlanarGridStepSize final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivityBlueprintLibrary.GetActor
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivityBlueprintLibrary_GetActor final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorldConnectivityHandle               Handle;                                            // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivityBlueprintLibrary.GetFieldCenter
// 0x00B0 (0x00B0 - 0x0000)
struct WorldConnectivityBlueprintLibrary_GetFieldCenter final
{
public:
	struct FPlanarFieldInfo                       Field;                                             // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0090(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.WorldConnectivityBlueprintLibrary.GetTransform
// 0x0070 (0x0070 - 0x0000)
struct WorldConnectivityBlueprintLibrary_GetTransform final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorldConnectivityHandle               Handle;                                            // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivityBlueprintLibrary.IsValid
// 0x0008 (0x0008 - 0x0000)
struct WorldConnectivityBlueprintLibrary_IsValid final
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomModel.GetChildIdentifier
// 0x0018 (0x0018 - 0x0000)
struct AtomModel_GetChildIdentifier final
{
public:
	int32                                         InChildIdx;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModel.GetPrimitivesForChildArray
// 0x0018 (0x0018 - 0x0000)
struct AtomModel_GetPrimitivesForChildArray final
{
public:
	int32                                         InChildIdx;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FAtomModelPrimitiveInstance>    OutPrimitives;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModel.GetGeneratedMergedMeshes
// 0x0010 (0x0010 - 0x0000)
struct AtomModel_GetGeneratedMergedMeshes final
{
public:
	TArray<TSoftObjectPtr<class UStaticMesh>>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModel.GetModelName
// 0x0010 (0x0010 - 0x0000)
struct AtomModel_GetModelName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModel.GetModelPath
// 0x0010 (0x0010 - 0x0000)
struct AtomModel_GetModelPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModel.GetPartsCollection
// 0x0080 (0x0080 - 0x0000)
struct AtomModel_GetPartsCollection final
{
public:
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x0000(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModel.GetTextureForDecorationTextureName
// 0x0018 (0x0018 - 0x0000)
struct AtomModel_GetTextureForDecorationTextureName final
{
public:
	class FString                                 TextureName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModelProcessor.IncrementProgress
// 0x0018 (0x0018 - 0x0000)
struct AtomModelProcessor_IncrementProgress final
{
public:
	int32                                         NumSteps;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModelProcessor.OnGetTargetAssetPath
// 0x00A0 (0x00A0 - 0x0000)
struct AtomModelProcessor_OnGetTargetAssetPath final
{
public:
	class UAtomModel*                             Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitive*                         Primitive;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              AtomModelPartsCollection;                          // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0090(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomModelProcessor.OnProcessModel
// 0x00D0 (0x00D0 - 0x0000)
struct AtomModelProcessor_OnProcessModel final
{
public:
	class UAtomModel*                             Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAtomModelPartsCollection              AtomModelPartsCollection;                          // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UObject>>         ExistingObjects;                                   // 0x0090(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ReturnValue;                                       // 0x00A0(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomModelProcessor.OnProcessPrimitive
// 0x00C0 (0x00C0 - 0x0000)
struct AtomModelProcessor_OnProcessPrimitive final
{
public:
	class UAtomModel*                             DummyModel;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitive*                         Primitive;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              AtomModelPartsCollection;                          // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ReturnValue;                                       // 0x0090(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AtomRuntime.AtomProcessorBlueprintLibrary.AppendAtomProcessorResult
// 0x0078 (0x0078 - 0x0000)
struct AtomProcessorBlueprintLibrary_AppendAtomProcessorResult final
{
public:
	struct FAtomProcessorResult                   Result;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ResultToAppend;                                    // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ReturnValue;                                       // 0x0050(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomProcessorBlueprintLibrary.GetModelProcessor
// 0x0028 (0x0028 - 0x0000)
struct AtomProcessorBlueprintLibrary_GetModelProcessor final
{
public:
	struct FAtomModelProcessorInstance            ProcessorInstance;                                 // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	const class UAtomModelProcessor*              ReturnValue;                                       // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomProcessorBlueprintLibrary.GetProcessorClass
// 0x0028 (0x0028 - 0x0000)
