#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AtomRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AtomRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class AtomRuntime.AtomAssetImportData
// 0x0000 (0x0028 - 0x0028)
class UAtomAssetImportData final : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAssetImportData">();
	}
	static class UAtomAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAssetImportData>();
	}
};

// Class AtomRuntime.AtomModelMergedMeshImportData
// 0x0000 (0x0028 - 0x0028)
class UAtomModelMergedMeshImportData final : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelMergedMeshImportData">();
	}
	static class UAtomModelMergedMeshImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelMergedMeshImportData>();
	}
};

// Class AtomRuntime.AtomModelGeometryCollectionImportData
// 0x0000 (0x0028 - 0x0028)
class UAtomModelGeometryCollectionImportData final : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelGeometryCollectionImportData">();
	}
	static class UAtomModelGeometryCollectionImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelGeometryCollectionImportData>();
	}
};

// Class AtomRuntime.AtomDatabaseSubsystemBase
// 0x0000 (0x0030 - 0x0030)
class UAtomDatabaseSubsystemBase final : public UEngineSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDatabaseSubsystemBase">();
	}
	static class UAtomDatabaseSubsystemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDatabaseSubsystemBase>();
	}
};

// Class AtomRuntime.AtomModelActor
// 0x0018 (0x02A8 - 0x0290)
class AAtomModelActor final : public AActor
{
public:
	class UAtomModel*                             AtomModel;                                         // 0x0290(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PrimitiveStyleName;                                // 0x0298(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelActor">();
	}
	static class AAtomModelActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomModelActor>();
	}
};

// Class AtomRuntime.AtomModelAssetUserData
// 0x00A0 (0x00C8 - 0x0028)
class UAtomModelAssetUserData final : public UAssetUserData
{
public:
	TSoftObjectPtr<class UAtomModel>              AtomModelAsset;                                    // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSerializedConnectivityObjects         AtomModelConnections;                              // 0x0048(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FAtomCommonPartInstancesCache          CommonPartCache;                                   // 0x0068(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelAssetUserData">();
	}
	static class UAtomModelAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelAssetUserData>();
	}
};

// Class AtomRuntime.AtomCommonPartModelAssetUserData
// 0x0010 (0x0038 - 0x0028)
class UAtomCommonPartModelAssetUserData final : public UAssetUserData
{
public:
	struct FAtomCommonPartAssetDescription        AssetDescription;                                  // 0x0028(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCommonPartModelAssetUserData">();
	}
	static class UAtomCommonPartModelAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCommonPartModelAssetUserData>();
	}
};

// Class AtomRuntime.AtomPartsCollectionBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomPartsCollectionBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddPartInstance(struct FAtomModelPartsCollection* PartCollection, const struct FAtomModelPartInstanceInfo& PartInstance);
	static struct FAtomModelPartColorInfo CreateColorInfoFromColorId(int32 ColorId);
	static struct FAtomModelPartsCollection FilterGroup(class UAtomModel* Model, const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& GroupName, const class FString& NewPartsCollectionName);
	static struct FAtomModelPartsCollection FilterNonTransparent(const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& NewPartsCollectionName);
	static struct FAtomModelPartsCollection FilterSelectionSet(const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& SelectionSetName, const class FString& NewPartsCollectionName);
	static struct FAtomModelPartsCollection FilterTransparent(const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& NewPartsCollectionName);
	static class FString GetName(const struct FAtomModelPartsCollection& PartsCollection);
	static const TArray<struct FAtomModelPartInstanceInfo> GetParts(const struct FAtomModelPartsCollection& PartsCollection);
	static struct FAtomModelPartsCollection InitializeCommonParts(struct FAtomModelPartsCollection& PartsCollection, const class UAtomModel* Model, float Scale, bool bRemoveConnectedParts, bool bRemoveAllKnobs, bool bRemoveAllTubes, bool bRemoveAllPins);
	static void RemovePartInstance(struct FAtomModelPartsCollection* PartCollection, const struct FAtomModelPartGuid& PartInstanceId);
	static void ReplacePartInstance(struct FAtomModelPartsCollection* PartCollection, const struct FAtomModelPartInstanceInfo& SourcePartInstance, const struct FAtomModelPartGuid& TargetPartInstanceId);
	static void SetName(struct FAtomModelPartsCollection* PartsCollection, const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPartsCollectionBlueprintLibrary">();
	}
	static class UAtomPartsCollectionBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPartsCollectionBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomPrimitiveBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomPrimitiveBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetDefaultPrimitiveScale();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveBlueprintLibrary">();
	}
	static class UAtomPrimitiveBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomPrimitiveGeometry
// 0x02C0 (0x02E8 - 0x0028)
class UAtomPrimitiveGeometry final : public UObject
{
public:
	uint8                                         Pad_28[0x2C0];                                     // 0x0028(0x02C0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UAtomPrimitiveGeometry* CreateAtomGeometryFromCommonPart(const class FString& ExportStyleName, EAtomCommonPartType CommonPartType, int32 LODIndex);
	static class UAtomPrimitiveGeometry* CreateEmptyAtomGeometry();
	static int32 GetNumberOfCommonPartLODs(const class FString& ExportStyleName, EAtomCommonPartType CommonPartType);

	class UAtomPrimitiveGeometry* Append(const class UAtomPrimitiveGeometry* GeometryToAppend, const struct FTransform3f& Transform);
	class UAtomPrimitiveGeometry* AppendAndWeld(const class UAtomPrimitiveGeometry* GeometryToAppend, const struct FTransform3f& Transform);
	class UAtomPrimitiveGeometry* BakeScale(float Scale);
	class UAtomPrimitiveGeometry* BakeTransform(const struct FTransform3f& Transform);
	class UAtomPrimitiveGeometry* BakeTransforms(const TArray<struct FTransform3f>& Transforms);
	class UAtomPrimitiveGeometry* SetMaterialName(const class FString& Name_0, int32 PolygonGroupIndex);
	class UAtomPrimitiveGeometry* SetTiledUVs(float TileSize);
	class UAtomPrimitiveGeometry* SetVertexColor(const struct FColor& Color);

	class UAtomPrimitiveGeometry* DuplicateGeometry() const;
	TArray<class FString> GetMaterialNames() const;
	TArray<class UAtomPrimitiveGeometry*> SplitByPolygonGroup() const;
	class UStaticMesh* ToSimplifiedStaticMesh(float Scale, class UObject* Outer_0, const class FString& Name_0, bool bFastBuild) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometry">();
	}
	static class UAtomPrimitiveGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometry>();
	}
};

// Class AtomRuntime.AtomPrimitiveGeometryContainer
// 0x00D0 (0x00F8 - 0x0028)
class UAtomPrimitiveGeometryContainer final : public UObject
{
public:
	TSoftObjectPtr<class UStaticMesh>             SourceMesh;                                        // 0x0028(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExportStyleName;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, int32>                    GeometryCount;                                     // 0x0058(0x0050)(Edit, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetCapsGeometry();
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetDetailsGeometry();
	class UAtomPrimitiveGeometry* GetGeometry(EPrimitiveGeometryComplexity PrimitiveGeometryComplexity);
	class UAtomPrimitiveGeometry* GetGeometryWithMaterialNames(EPrimitiveGeometryComplexity PrimitiveGeometryComplexity, const class FString& ShellMaterial, const class FString& UndersideMaterial);
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetPartsGeometry();
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetScaledCapsGeometry(float Scale);
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetScaledDetailsGeometry(float Scale);
	class UAtomPrimitiveGeometry* GetScaledGeometry(EPrimitiveGeometryComplexity PrimitiveGeometryComplexity, float Scale);
	struct FAtomPrimitiveGeometryAndTransform GetScaledShellGeometry(float Scale);
	struct FAtomPrimitiveGeometryAndTransform GetShellGeometry();

	class FString GetExportStyleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometryContainer">();
	}
	static class UAtomPrimitiveGeometryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometryContainer>();
	}
};

// Class AtomRuntime.AtomRuntimeBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomRuntimeBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TMap<int32, struct FAtomColorInfo> GetAllColorInfo();
	static int32 GetBitPackForColor(const struct FColor& Color);
	static int32 GetBitPackForColorId(int32 AtomColorId);
	static void GetCommonPartAssetDescriptionFromStaticMesh(class UStaticMesh* StaticMesh, struct FAtomCommonPartAssetDescription* OutDescription, EGetCommonPartDescriptionResult* OutIsValid);
	static EAtomCommonPartCategory GetCommonPartCategoryFromType(EAtomCommonPartType CommonPartType);
	static void GetCommonPartDescriptionFromType(EAtomCommonPartType CommonPartType, struct FAtomCommonPartDescription* OutDescription);
	static struct FAtomColorInfo GetInfoForColorId(int32 ColorId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomRuntimeBlueprintLibrary">();
	}
	static class UAtomRuntimeBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomRuntimeBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomRuntimeSettings
// 0x0048 (0x0078 - 0x0030)
class UAtomRuntimeSettings final : public UDeveloperSettings
{
public:
	float                                         PrimitiveGlobalScale;                              // 0x0030(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UDataTable>              ColorDataTableOverride;                            // 0x0038(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CommonPartsScale;                                  // 0x0058(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDirectoryPath                         CommonPartMeshesBasePath;                          // 0x0060(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWorldConnectivity;                          // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookContent;                                      // 0x0071(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	const class UDataTable* GetColorDataTable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomRuntimeSettings">();
	}
	static class UAtomRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomRuntimeSettings>();
	}
};

// Class AtomRuntime.WorldConnectivitySubsystem
// 0x0150 (0x0180 - 0x0030)
class UWorldConnectivitySubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x150];                                     // 0x0030(0x0150)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void DisconnectAllObjectConnections(const struct FWorldConnectivityHandle& Object);
	void DisconnectObjects(const struct FWorldConnectivityHandle& ObjectA, const struct FWorldConnectivityHandle& ObjectB);
	class UAtomModelAssetUserData* GetAtomModelAssetUserData(class UObject* Object);
	struct FPlanarFieldInfo GetClosestFieldToPoint(const struct FWorldConnectivityHandle& Handle, const struct FVector& WorldLocation, EConnectionFieldGender Type, bool* bSuccess);
	TArray<struct FWorldConnectivityHandle> GetConnectedObjects(const struct FWorldConnectivityHandle& Object);
	TArray<struct FWorldConnectivityHandle> GetConnectedObjectsRecursively(const struct FWorldConnectivityHandle& Object);
	struct FVector GetOverlapPenetrationDepth(class AStaticMeshActor* Actor1, class AStaticMeshActor* Actor2, const struct FVector& Offset);
	TArray<struct FPlanarFieldInfo> GetPlanarFields(const struct FWorldConnectivityHandle& Handle, EConnectionFieldGender Type);
	void RegisterConnectivityActor(class AActor* Actor, const class UAtomModel* Model);
	void RegisterCustomConnectivityActor(class AActor* Actor, const struct FSerializedConnectivityObjects& ConnectivityObject);
	void RegisterModelActor(class AActor* Actor, const struct FSerializedConnectivityObjects& Connections);
	void ReleaseConnectivityActor(class AActor* Actor);
	bool TryConnectObjectAtLocation(const struct FWorldConnectivityHandle& ObjectToConnect, const struct FTransform& DesiredObjectTransform, const TArray<struct FWorldConnectivityHandle>& ConnectionCandidates, bool PerformConnection);

	class AActor* GetActor(const struct FWorldConnectivityHandle& Handle) const;
	struct FWorldConnectivityHandle GetConnectivityHandle(class AActor* Actor) const;
	const struct FTransform GetTransform(const struct FWorldConnectivityHandle& Handle) const;
	double PlanarGridStepSize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldConnectivitySubsystem">();
	}
	static class UWorldConnectivitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldConnectivitySubsystem>();
	}
};

// Class AtomRuntime.WorldConnectivityBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UWorldConnectivityBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class AActor* GetActor(class UObject* WorldContext, const struct FWorldConnectivityHandle& Handle);
	static struct FVector GetFieldCenter(const struct FPlanarFieldInfo& Field);
	static struct FTransform GetTransform(class UObject* WorldContext, const struct FWorldConnectivityHandle& Handle);
	static bool IsValid(const struct FWorldConnectivityHandle& Handle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldConnectivityBlueprintLibrary">();
	}
	static class UWorldConnectivityBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldConnectivityBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomModel
// 0x0218 (0x0240 - 0x0028)
class UAtomModel final : public UObject
{
public:
	struct FAtomModelAssetSettings                Settings;                                          // 0x0028(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPrimitive>            Primitives;                                        // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomHingedElement>             Elements;                                          // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelSelectionSet>         SelectionSets;                                     // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelConfigurationGroup>   Groups;                                            // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<EAtomCommonPartType, TSoftObjectPtr<class UStaticMesh>> CommonPartOverrides;                // 0x00A0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         CommonPartOptimization;                            // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSerializedConnectivityObjects         SerializedConnectivityObjects;                     // 0x00F8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, NativeAccessSpecifierPublic)
	TMap<class FString, TSoftObjectPtr<class UTexture>> TextureNameToAsset;                          // 0x0118(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x50];                                     // 0x0168(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAtomSourceModel                       SourceModel;                                       // 0x01B8(0x0088)(NativeAccessSpecifierPrivate)

public:
	class FString GetChildIdentifier(int32 InChildIdx);
	void GetPrimitivesForChildArray(int32 InChildIdx, TArray<struct FAtomModelPrimitiveInstance>* OutPrimitives);

	TArray<TSoftObjectPtr<class UStaticMesh>> GetGeneratedMergedMeshes() const;
	class FString GetModelName() const;
	class FString GetModelPath() const;
	struct FAtomModelPartsCollection GetPartsCollection() const;
	class UTexture* GetTextureForDecorationTextureName(const class FString& TextureName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModel">();
	}
	static class UAtomModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModel>();
	}
};

// Class AtomRuntime.AtomModelComponent
// 0x00A0 (0x0340 - 0x02A0)
class UAtomModelComponent final : public USceneComponent
{
public:
	class UAtomModel*                             AtomModel;                                         // 0x02A0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomModelInstanceType                        InstanceType;                                      // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 RenderStyle;                                       // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FallbackRenderStyle;                               // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCombinedMeshes;                                // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseColorPayload;                                  // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateRigidElements;                              // 0x02D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableConnectivity;                               // 0x02D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SelectionSetFilter;                                // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CommonPartOptimization;                            // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class USceneComponent*>                RigidElementComponents;                            // 0x02E0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, struct FModelPrimitiveEntry> ComponentToPrimitive;                             // 0x02F0(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelComponent">();
	}
	static class UAtomModelComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelComponent>();
	}
};

// Class AtomRuntime.AtomPrimitiveComponent
// 0x0030 (0x0670 - 0x0640)
class UAtomPrimitiveComponent final : public UStaticMeshComponent
{
public:
	class UAtomPrimitive*                         AtomPrimitive;                                     // 0x0638(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RenderStyle;                                       // 0x0640(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FallbackRenderStyle;                               // 0x0650(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCombinedMeshes;                                // 0x0660(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_661[0xF];                                      // 0x0661(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveComponent">();
	}
	static class UAtomPrimitiveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveComponent>();
	}
};

// Class AtomRuntime.AtomModelProcessor
// 0x0030 (0x0058 - 0x0028)
class UAtomModelProcessor final : public UObject
{
public:
	bool                                          bEnableRebuildProgress;                            // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DialogDelay;                                       // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumProgressSteps;                                  // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ProgressMessage;                                   // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void IncrementProgress(int32 NumSteps, const class FString& Message);
	class FString OnGetTargetAssetPath(class UAtomModel* Model, class UAtomPrimitive* Primitive, const struct FAtomModelPartsCollection& AtomModelPartsCollection);
	struct FAtomProcessorResult OnProcessModel(class UAtomModel* Model, const struct FAtomModelPartsCollection& AtomModelPartsCollection, const TArray<TSoftObjectPtr<class UObject>>& ExistingObjects);
	struct FAtomProcessorResult OnProcessPrimitive(class UAtomModel* DummyModel, class UAtomPrimitive* Primitive, const struct FAtomModelPartsCollection& AtomModelPartsCollection);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelProcessor">();
	}
	static class UAtomModelProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelProcessor>();
	}
};

// Class AtomRuntime.AtomProcessorBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomProcessorBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FAtomProcessorResult AppendAtomProcessorResult(const struct FAtomProcessorResult& Result, const struct FAtomProcessorResult& ResultToAppend);
	static const class UAtomModelProcessor* GetModelProcessor(const struct FAtomModelProcessorInstance& ProcessorInstance);
	static const class UClass* GetProcessorClass(const struct FAtomModelProcessorInstance& ProcessorInstance);
	static bool IsValid(const struct FAtomModelProcessorInstance& ProcessorInstance);
	static void SetModelProcessor(struct FAtomModelProcessorInstance& ProcessorInstance, class UAtomModelProcessor* ModelProcessor, bool bUseCustomSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomProcessorBlueprintLibrary">();
	}
	static class UAtomProcessorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomProcessorBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomPrimitive
// 0x01C8 (0x01F0 - 0x0028)
class UAtomPrimitive final : public UObject
{
public:
	uint32                                        PartId;                                            // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 PartRevision;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DesignName;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFlex;                                           // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVariant;                                        // 0x0045(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         DecorationSurfaceNames;                            // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         NumberOfColorSurfaces;                             // 0x0058(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomPlatform                                 AtomPlatform;                                      // 0x005C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         AtomMainGroupId;                                   // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AtomSubMainGroupId;                                // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EAtomCommonPartType, struct FAtomPrimitiveCommonPart> PrimitiveCommonParts;                 // 0x0068(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAtomPrimitiveCommonPart> CommonParts;                                  // 0x00B8(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bOverrideConnectionFields;                         // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FBoxSphereBounds                       Bounds;                                            // 0x0110(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       UnscaledBounds;                                    // 0x0148(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UAtomPrimitiveGeometryContainer*> GeometryContainers;                               // 0x0180(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FConnectionFieldContainer              ConnectionFields;                                  // 0x0190(0x0030)(Edit, EditConst, NativeAccessSpecifierPrivate)
	struct FConnectionFieldContainer              ConnectionFieldsOverride;                          // 0x01C0(0x0030)(Edit, NativeAccessSpecifierPrivate)

public:
	static class FName GetMainGroupName(int32 MainGroupId);
	static class FName GetSubMainGroupName(int32 SubMainGroupId);

	class UAtomPrimitiveGeometryContainer* GetGeometryContainerForExportStyle(const class FString& ExportStyleName, const class FString& FallbackExportStyleName) const;
	bool IsFlexElement() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitive">();
	}
	static class UAtomPrimitive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitive>();
	}
};

}

