#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AudioGameplayVolume

#include "Basic.hpp"

#include "AudioGameplay_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AudioGameplayVolume.AudioGameplayVolumeMutator
// 0x0008 (0x00B0 - 0x00A8)
class UAudioGameplayVolumeMutator : public UAudioGameplayComponent
{
public:
	int32                                         Priority;                                          // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetPriority(int32 InPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioGameplayVolumeMutator">();
	}
	static class UAudioGameplayVolumeMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeMutator>();
	}
};

// Class AudioGameplayVolume.AttenuationVolumeComponent
// 0x0010 (0x00C0 - 0x00B0)
class UAttenuationVolumeComponent final : public UAudioGameplayVolumeMutator
{
public:
	float                                         ExteriorVolume;                                    // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExteriorTime;                                      // 0x00B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorVolume;                                    // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorTime;                                      // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetExteriorVolume(float Volume, float InterpolateTime);
	void SetInteriorVolume(float Volume, float InterpolateTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttenuationVolumeComponent">();
	}
	static class UAttenuationVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttenuationVolumeComponent>();
	}
};

// Class AudioGameplayVolume.AudioGameplayVolume
// 0x0030 (0x02F8 - 0x02C8)
class AAudioGameplayVolume : public AVolume
{
public:
	class UAudioGameplayVolumeComponent*          AGVComponent;                                      // 0x02C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnListenerEnterEvent;                              // 0x02D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnListenerExitEvent;                               // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void OnListenerEnter();
	void OnListenerExit();
	void OnRep_bEnabled();
	void SetEnabled(bool bEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioGameplayVolume">();
	}
	static class AAudioGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAudioGameplayVolume>();
	}
};

// Class AudioGameplayVolume.AudioGameplayVolumeComponent
// 0x0028 (0x00D0 - 0x00A8)
class UAudioGameplayVolumeComponent final : public UAudioGameplayComponent
{
public:
	TMulticastInlineDelegate<void()>              OnProxyEnter;                                      // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProxyExit;                                       // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAudioGameplayVolumeProxy*              proxy;                                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioGameplayVolumeComponent">();
	}
	static class UAudioGameplayVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeComponent>();
	}
};

// Class AudioGameplayVolume.AudioGameplayVolumeComponentBase
// 0x0008 (0x00B0 - 0x00A8)
class UAudioGameplayVolumeComponentBase final : public UAudioGameplayComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioGameplayVolumeComponentBase">();
	}
	static class UAudioGameplayVolumeComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeComponentBase>();
	}
};

// Class AudioGameplayVolume.AudioGameplayVolumeProxy
// 0x0020 (0x0048 - 0x0028)
class UAudioGameplayVolumeProxy : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioGameplayVolumeProxy">();
	}
	static class UAudioGameplayVolumeProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeProxy>();
	}
};

// Class AudioGameplayVolume.AGVPrimitiveComponentProxy
// 0x0008 (0x0050 - 0x0048)
class UAGVPrimitiveComponentProxy final : public UAudioGameplayVolumeProxy
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AGVPrimitiveComponentProxy">();
	}
	static class UAGVPrimitiveComponentProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAGVPrimitiveComponentProxy>();
	}
};

// Class AudioGameplayVolume.AGVConditionProxy
// 0x0008 (0x0050 - 0x0048)
class UAGVConditionProxy final : public UAudioGameplayVolumeProxy
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AGVConditionProxy">();
	}
	static class UAGVConditionProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAGVConditionProxy>();
	}
};

// Class AudioGameplayVolume.AudioGameplayVolumeSubsystem
// 0x0128 (0x0158 - 0x0030)
class UAudioGameplayVolumeSubsystem final : public UAudioEngineSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<uint32, class UAudioGameplayVolumeComponent*> AGVComponents;                                // 0x0038(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0xD0];                                      // 0x0088(0x00D0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioGameplayVolumeSubsystem">();
	}
	static class UAudioGameplayVolumeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeSubsystem>();
	}
};

// Class AudioGameplayVolume.FilterVolumeComponent
// 0x0010 (0x00C0 - 0x00B0)
class UFilterVolumeComponent final : public UAudioGameplayVolumeMutator
{
public:
	float                                         ExteriorLPF;                                       // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExteriorLPFTime;                                   // 0x00B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorLPF;                                       // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorLPFTime;                                   // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetExteriorLPF(float Volume, float InterpolateTime);
	void SetInteriorLPF(float Volume, float InterpolateTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FilterVolumeComponent">();
	}
	static class UFilterVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilterVolumeComponent>();
	}
};

// Class AudioGameplayVolume.ReverbVolumeComponent
// 0x0020 (0x00D0 - 0x00B0)
class UReverbVolumeComponent final : public UAudioGameplayVolumeMutator
{
public:
	struct FReverbSettings                        ReverbSettings;                                    // 0x00B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void SetReverbSettings(const struct FReverbSettings& NewReverbSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReverbVolumeComponent">();
	}
	static class UReverbVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReverbVolumeComponent>();
	}
};

// Class AudioGameplayVolume.SubmixOverrideVolumeComponent
// 0x0010 (0x00C0 - 0x00B0)
class USubmixOverrideVolumeComponent final : public UAudioGameplayVolumeMutator
{
public:
	TArray<struct FAudioVolumeSubmixOverrideSettings> SubmixOverrideSettings;                        // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void SetSubmixOverrideSettings(const TArray<struct FAudioVolumeSubmixOverrideSettings>& NewSubmixOverrideSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SubmixOverrideVolumeComponent">();
	}
	static class USubmixOverrideVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubmixOverrideVolumeComponent>();
	}
};

// Class AudioGameplayVolume.SubmixSendVolumeComponent
// 0x0010 (0x00C0 - 0x00B0)
class USubmixSendVolumeComponent final : public UAudioGameplayVolumeMutator
{
public:
	TArray<struct FAudioVolumeSubmixSendSettings> SubmixSendSettings;                                // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void SetSubmixSendSettings(const TArray<struct FAudioVolumeSubmixSendSettings>& NewSubmixSendSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SubmixSendVolumeComponent">();
	}
	static class USubmixSendVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubmixSendVolumeComponent>();
	}
};

}

