#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AudioShapes

#include "Basic.hpp"

#include "AudioGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AudioShapes.AudioShapeSubsystem
// 0x0058 (0x0088 - 0x0030)
class UAudioShapeSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UAudioShapeComponent*>           AudioShapes;                                       // 0x0058(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class APlayerController*>              LocalControllers;                                  // 0x0068(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeSubsystem">();
	}
	static class UAudioShapeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeSubsystem>();
	}
};

// Class AudioShapes.AudioShapeComponent
// 0x0098 (0x0140 - 0x00A8)
class UAudioShapeComponent : public UAudioGameplayComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MaxDistanceOffset;                                 // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothingDistance;                                 // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInTime;                                        // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsAudible)> OnAudibleStateChanged;                           // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class FName, class UAudioComponent*>     AudioComponents;                                   // 0x00D0(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class APlayerController*>              LocalControllers;                                  // 0x0120(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void Disable();
	void Enable();
	void UpdateAudioShape(const TArray<class APlayerController*>& InLocalControllers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeComponent">();
	}
	static class UAudioShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeComponent>();
	}
};

// Class AudioShapes.AudioShapePrimitiveComponent
// 0x00C0 (0x0200 - 0x0140)
#pragma pack(push, 0x1)
class alignas(0x10) UAudioShapePrimitiveComponent : public UAudioShapeComponent
{
public:
	class USoundBase*                             SoundOnEdge;                                       // 0x0140(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             SoundOnInside;                                     // 0x0148(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsInside)> OnInsideStateChanged;                             // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bUseOwningActorTransform;                          // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoRefreshShape;                                 // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ActorTransformScale;                               // 0x0168(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x78];                                     // 0x0180(0x0078)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UAudioComponent* GetEdgeAudioComponent();
	class UAudioComponent* GetInsideAudioComponent();

	bool GetIsPlayerInside() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapePrimitiveComponent">();
	}
	static class UAudioShapePrimitiveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapePrimitiveComponent>();
	}
};
#pragma pack(pop)

// Class AudioShapes.AudioShapeBoxComponent
// 0x0060 (0x0260 - 0x0200)
class UAudioShapeBoxComponent final : public UAudioShapePrimitiveComponent
{
public:
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             BoxTransform;                                      // 0x0200(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetBoxTransform(const struct FTransform& InTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeBoxComponent">();
	}
	static class UAudioShapeBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeBoxComponent>();
	}
};

// Class AudioShapes.AudioShapeCylinderComponent
// 0x0000 (0x0200 - 0x0200)
class UAudioShapeCylinderComponent final : public UAudioShapePrimitiveComponent
{
public:
	float                                         HalfHeight;                                        // 0x01F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x01FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetHalfHeight(float InHalfHeight);
	void SetRadius(float InRadius);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeCylinderComponent">();
	}
	static class UAudioShapeCylinderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeCylinderComponent>();
	}
};

// Class AudioShapes.AudioShapeLineComponent
// 0x0030 (0x0230 - 0x0200)
class UAudioShapeLineComponent final : public UAudioShapePrimitiveComponent
{
public:
	struct FVector                                StartPoint;                                        // 0x01F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndPoint;                                          // 0x0210(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetEndPoint(const struct FVector& InEndPoint);
	void SetStartPoint(const struct FVector& InStartPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeLineComponent">();
	}
	static class UAudioShapeLineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeLineComponent>();
	}
};

// Class AudioShapes.AudioShapeLineListComponent
// 0x0010 (0x0210 - 0x0200)
class UAudioShapeLineListComponent final : public UAudioShapePrimitiveComponent
{
public:
	TArray<struct FVector>                        PointList;                                         // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bClosedLoop;                                       // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	int32 AddPoint(const struct FVector& InPoint);
	bool RemovePoint(int32 InIndex);
	bool UpdatePoint(int32 InIndex, const struct FVector& InPoint);

	void GetPoints(TArray<struct FVector>* OutPoints) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeLineListComponent">();
	}
	static class UAudioShapeLineListComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeLineListComponent>();
	}
};

// Class AudioShapes.AudioShapeSphereComponent
// 0x0000 (0x0200 - 0x0200)
class UAudioShapeSphereComponent final : public UAudioShapePrimitiveComponent
{
public:
	float                                         Radius;                                            // 0x01F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetRadius(float InRadius);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeSphereComponent">();
	}
	static class UAudioShapeSphereComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeSphereComponent>();
	}
};

}

