#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_EmotePreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_EmotePreviewDisplay.B_EmotePreviewDisplay_C
// 0x0070 (0x0318 - 0x02A8)
class AB_EmotePreviewDisplay_C final : public AFortEmotePreviewActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAthenaEmojiItemDefinition*             EmojiItemDefinition;                               // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x02C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         DanceOrEmojiItemDefinition;                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartSectionName;                                  // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnEmoteSetupFinished;                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAthenaShoutItemDefinition*             ShoutItemDefinition;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                DynamicallySpawnedSounds;                          // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void SpecialCaseShoutHandler();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PreviewEmote(const class UFortMontageItemDefinitionBase* Emote);
	void PerformSpecialAction(class FName ActionName);
	void OnLoaded_638F148342254A777E929B88915A8958(class UObject* Loaded);
	void ExecuteUbergraph_B_EmotePreviewDisplay(int32 EntryPoint);
	void CleanupDynamicSounds();
	void ApplyEmoteToPet(bool IsRemoval);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_EmotePreviewDisplay_C">();
	}
	static class AB_EmotePreviewDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_EmotePreviewDisplay_C>();
	}
};

}

