#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_WeaponSoundLibraryComponent

#include "Basic.hpp"

#include "MetasoundEngine_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_WeaponSoundLibraryComponent.B_WeaponSoundLibraryComponent_C
// 0x0040 (0x0260 - 0x0220)
class UB_WeaponSoundLibraryComponent_C final : public UFortWeaponSoundLibraryComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           FireEvent;                                         // 0x0228(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMetaSoundSource*                       BaseGunfireMS;                                     // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMetaSoundPatch*>                ModMS;                                             // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundLibrary*                          ModSoundLibrary;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ModDistanceCurveBank;                              // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuppressorAtt;                                    // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddConnectedGraphInput(class FName InputName, class FName DataType, class UMetaSoundSourceBuilder* BuilderRef, const struct FMetaSoundNodeHandle& BaseWeaponNodeHandleRef);
	void CheckIfSuppressor(class UMetaSoundBuilderBase* BuilderRef, const struct FMetaSoundNodeHandle& BaseNodeHandle, const struct FMetaSoundNodeHandle& ModNodeHandle, const class UObject* ModRef);
	void ConnectInterfaceInputs(class UMetaSoundBuilderBase* BuilderRef, const struct FMetaSoundNodeHandle& BaseWeaponNodeHandle, class FName InputName);
	void ConnectNodesIO(class UMetaSoundBuilderBase* BuilderRef, class FName InputName, class FName OutputName, const struct FMetaSoundNodeHandle& BaseNodeHandle, const struct FMetaSoundNodeHandle& ModNodeHandle);
	void CreateModMetaSound();
	void CreateModSoundLibrary();
	void ExecuteUbergraph_B_WeaponSoundLibraryComponent(int32 EntryPoint);
	void GetSoundsFromEvent(const struct FGameplayTag& InEventName, TArray<class USoundBase*>* Out_Sounds);
	void OnModApplied(const class UFortWeaponModAudioData* InModAudioData);
	void OnModRemoved(const class UFortWeaponModAudioData* InModAudioData);
	void OnSoundPlayed(const struct FGameplayTag& InEventName, class UAudioComponent* InComponent);
	void OnSoundStopped(const struct FGameplayTag& InEventName, class UAudioComponent* InComponent, bool* bStopped);
	void ReceiveBeginPlay();
	void SetBaseMS();
	void SetModMS();
	void TryHandleFireEvent(const struct FGameplayTag& Event, class UAudioComponent* Component);
	void ValidateModMetasounds(class UObject* OnepMetaSoundPatch, class UObject* ThreepMetaSoundPatch, bool* bShouldBuild);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_WeaponSoundLibraryComponent_C">();
	}
	static class UB_WeaponSoundLibraryComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UB_WeaponSoundLibraryComponent_C>();
	}
};

}

