#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePassVaultWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VaultWorld_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattlePassVaultWorld.BattlePassVaultWorld_C
// 0x00E0 (0x0430 - 0x0350)
class ABattlePassVaultWorld_C final : public AVaultWorld_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BattlePassVaultWorld_C;             // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   floor;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_FX_Transition_Fade_46DACBD74D0A8B2278950785C007984A; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Fade_46DACBD74D0A8B2278950785C007984A; // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Forward_46DACBD74D0A8B2278950785C007984A; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionForward__Direction_46DACBD74D0A8B2278950785C007984A; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     TransitionForward;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         BackgroundIntenstiy_Intensity_8C51F99C4026F0204F2184AD9661CD23; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BackgroundIntenstiy__Direction_8C51F99C4026F0204F2184AD9661CD23; // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     BackgroundIntenstiy;                               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ItemDetailsIntensity_TextureIntensity_1EC6205345E5A708DA53B5A9449F1700; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ItemDetailsIntensity__Direction_1EC6205345E5A708DA53B5A9449F1700; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     ItemDetailsIntensity;                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Effects_SetStreaks_50767E4640E86998EC96B7B2D57E5E27; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Background_Effects__Direction_50767E4640E86998EC96B7B2D57E5E27; // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Background_Effects;                                // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         IconDissolve_NewTrack_0_983A4DA644BE5CFAED0C378063FC66FC; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            IconDissolve__Direction_983A4DA644BE5CFAED0C378063FC66FC; // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     IconDissolve;                                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ItemDetails_Icon_X_Offset_F4D1C4E246C708FA1F53EDA5A3FEE781; // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemDetails_X_Offset_F4D1C4E246C708FA1F53EDA5A3FEE781; // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ItemDetails__Direction_F4D1C4E246C708FA1F53EDA5A3FEE781; // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     ItemDetails;                                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Floor_Visibility_FloorMask_CE7E338346E82397065B65AA77823F50; // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Floor_Visibility__Direction_CE7E338346E82397065B65AA77823F50; // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Floor_Visibility;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_fx_Transition_fade_7073CD0840227233D3A64795A5A1B1B8; // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Fade_7073CD0840227233D3A64795A5A1B1B8; // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Backward_7073CD0840227233D3A64795A5A1B1B8; // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionBackward__Direction_7073CD0840227233D3A64795A5A1B1B8; // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     TransitionBackward;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      FloorMI;                                           // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FloorMID;                                          // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BG_Intensity_Max;                                  // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BG_Intensity_Mid;                                  // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BG_Intensity_Min;                                  // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTransitioning;                                  // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBackgroundIntensityLevel                     Intensity_Transition;                              // 0x0421(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPageA_Max;                                      // 0x0422(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPageB_Max;                                      // 0x0423(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PageA_X_Offset;                                    // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PageB_X_Offset;                                    // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         X_Offset_Anim_Distance;                            // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TransitionForward__UpdateFunc();
	void TransitionForward__FinishedFunc();
	void TransitionBackward__UpdateFunc();
	void TransitionBackward__FinishedFunc();
	void TransitionBackgroundForward(double Forward, double Fade, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void TransitionBackgroundBackward(double Backward, double Fade, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void SetupBackgroundMaterial(class UTexture2D*& TextureBackground, struct FVaultWorldBackgroundData& BackgroundInfo, class UMaterialInstanceDynamic* Mid);
	void Set_Backgrounds_Scalar_Value(class FName Param, double FloatValue);
	void ReceiveBeginPlay();
	void PageTransitionIntensityUpdate(class UMaterialInstanceDynamic* MID_Background, class UMaterialInstanceDynamic* MID_Floor);
	void OnUpdateDisplay(bool bShowFloor, bool bShowEffects);
	void OnTransitionItemDetails(const bool bShowItemDetails);
	void OnTransitionBackground(bool bPlayForward, EBackgroundIntensityLevel IntensityTransition);
	void OnSetupTextureBackground(const class UTexture2D* LoadedBackgroundTexture, const struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnSetupMaterialBackground(const class UMaterialInterface* LoadedBackgroundMaterial, const struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnIntensityChange(bool bToLowIntensity);
	void OnInitialBackgroundTransition();
	void ItemDetailsIntensity__UpdateFunc();
	void ItemDetailsIntensity__FinishedFunc();
	void ItemDetails__UpdateFunc();
	void ItemDetails__FinishedFunc();
	void IconDissolve__UpdateFunc();
	void IconDissolve__FinishedFunc();
	void Floor_Visibility__UpdateFunc();
	void Floor_Visibility__FinishedFunc();
	void ExecuteUbergraph_BattlePassVaultWorld(int32 EntryPoint);
	void BackgroundIntenstiy__UpdateFunc();
	void BackgroundIntenstiy__FinishedFunc();
	void Background_Effects__UpdateFunc();
	void Background_Effects__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassVaultWorld_C">();
	}
	static class ABattlePassVaultWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattlePassVaultWorld_C>();
	}
};

}

