#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePassBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum BattlePassBase.EBattlePassLandingPageSpecialEntryType
// NumValues: 0x0007
enum class EBattlePassLandingPageSpecialEntryType : uint8
{
	None                                     = 0,
	Subscription                             = 1,
	CharacterCustomizer                      = 2,
	SpecialCharacter                         = 3,
	Weekly                                   = 4,
	COUNT                                    = 5,
	EBattlePassLandingPageSpecialEntryType_MAX = 6,
};

// Enum BattlePassBase.FBattlePassLandingPageButtonDisplayBehavior
// NumValues: 0x0008
enum class EFBattlePassLandingPageButtonDisplayBehavior : uint8
{
	None                                     = 0,
	MainRewards                              = 1,
	BonusRewards                             = 2,
	WeeklyRewards                            = 3,
	QuestRewards                             = 4,
	Subscription                             = 5,
	Customization                            = 6,
	FBattlePassLandingPageButtonDisplayBehavior_MAX = 7,
};

// Enum BattlePassBase.BattlePassTileAvailabilityStates
// NumValues: 0x0005
enum class EBattlePassTileAvailabilityStates : uint8
{
	Invalid                                  = 0,
	Available                                = 1,
	Owned                                    = 2,
	Locked                                   = 3,
	BattlePassTileAvailabilityStates_MAX     = 4,
};

// ScriptStruct BattlePassBase.BattlePassEntrySelectedParams
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FBattlePassEntrySelectedParams final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BattlePassBase.BattlePassCoverPageParams
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FBattlePassCoverPageParams final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BattlePassBase.BattlePassCharaterRewardTabInfo
// 0x0028 (0x0028 - 0x0000)
struct FBattlePassCharaterRewardTabInfo final
{
public:
	TSoftObjectPtr<class UObject>                 TabIcon;                                           // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TabCategoryCounter;                                // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BattlePassBase.BattlePassLandingPageButtonTexts
// 0x0048 (0x0048 - 0x0000)
struct FBattlePassLandingPageButtonTexts final
{
public:
	class FText                                   TileText;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   LandingPageTitleText;                              // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   LandingPageDescriptionText;                        // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct BattlePassBase.BattlePassLandingPageButtonDisplayBehaviorData
// 0x0018 (0x0018 - 0x0000)
struct FBattlePassLandingPageButtonDisplayBehaviorData final
{
public:
	EFBattlePassLandingPageButtonDisplayBehavior  DisplayBehavior;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimespan                              BehaviorTimespan;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDisplayActive;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BattlePassBase.BattlePassLandingPageButtonDisplayDetails
// 0x0070 (0x0070 - 0x0000)
struct FBattlePassLandingPageButtonDisplayDetails final
{
public:
	struct FBattlePassLandingPageButtonTexts      ButtonTexts;                                       // 0x0000(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bIsBPLocked;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   MissingCosmeticNameText;                           // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FTimespan                              DelayTimespan;                                     // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BattlePassBase.BattlePassLandingPageEntryPreviewInfo
// 0x0090 (0x0090 - 0x0000)
struct FBattlePassLandingPageEntryPreviewInfo final
{
public:
	EBattlePassLandingPageSpecialEntryType        SpecialEntryType;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<EFortItemType>                         SubscriptionItemTypesToDisplay;                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpecialCharacterVariantChannelToModify;            // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpecialCharacterActiveVariantTag;                  // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, TSoftObjectPtr<class UMaterialInstance>> TemplateIdTileRenderMap;            // 0x0020(0x0050)(Edit, DisableEditOnTemplate, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> PreviewItems;                                  // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bEnableDynamicWeeklyPreview;                       // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         TransitionTime;                                    // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct BattlePassBase.SeasonalResourceList
// 0x0010 (0x0010 - 0x0000)
struct FSeasonalResourceList final
{
public:
	TArray<class UFortPersistentResourceItemDefinition*> SeasonalResources;                          // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

}

