#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BeatSyncedAnimRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class BeatSyncedAnimRuntime.AnimBeatSyncMetaData
// 0x0000 (0x0028 - 0x0028)
class UAnimBeatSyncMetaData : public UAnimMetaData
{
public:
	static float GetBeatDurationInSeconds(class UAnimSequenceBase* Anim);
	static float GetBeatForFrame(class UAnimSequenceBase* Anim, float Frame);
	static int32 GetDurationInBeats(class UAnimSequenceBase* Anim);
	static float GetEndingFrame(class UAnimSequenceBase* Anim);
	static float GetFrameForBeat(class UAnimSequenceBase* Anim, float Beat, bool bIsLooping);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimBeatSyncMetaData">();
	}
	static class UAnimBeatSyncMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBeatSyncMetaData>();
	}
};

// Class BeatSyncedAnimRuntime.PreciseAnimBeatSyncMetaData
// 0x0018 (0x0040 - 0x0028)
class UPreciseAnimBeatSyncMetaData final : public UAnimBeatSyncMetaData
{
public:
	float                                         FirstBeatAtFrame;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BeatB;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowBeatsyncing;                                 // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldHalfOrDoublePlayRate;                       // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MaxPlayRateBeforeHalf;                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPlayRateBeforeDouble;                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PreciseAnimBeatSyncMetaData">();
	}
	static class UPreciseAnimBeatSyncMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreciseAnimBeatSyncMetaData>();
	}
};

// Class BeatSyncedAnimRuntime.BeatSyncedAnimLibrary
// 0x0000 (0x0028 - 0x0028)
class UBeatSyncedAnimLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FFMontageBeatSyncInfo CalculateMontageBeatSyncInfo(const class UMusicClockComponent* MusicClock, const class UAnimMontage* Montage, float LengthInBeats, float MsOffset);
	static float CalculateMontagePlayRate(const class UMusicClockComponent* MusicClock, const class UAnimMontage* Montage, float MontageBeatLength);
	static class UFortItemDefinition* GetLastEmoteExecuted(const class AController* Controller);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeatSyncedAnimLibrary">();
	}
	static class UBeatSyncedAnimLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeatSyncedAnimLibrary>();
	}
};

// Class BeatSyncedAnimRuntime.FMBeatTimingUtils
// 0x0000 (0x0028 - 0x0028)
class UFMBeatTimingUtils final : public UBlueprintFunctionLibrary
{
public:
	static float GetBeatsPerMeasure();
	static float GetCurrentBeat(const class UMusicClockComponent* InMusicClock, bool bRounded);
	static float GetCurrentBeatForBPM(float InBPM, const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMBeatTimingUtils">();
	}
	static class UFMBeatTimingUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMBeatTimingUtils>();
	}
};

// Class BeatSyncedAnimRuntime.MontageBeatSyncComponent
// 0x0058 (0x00F8 - 0x00A0)
class UMontageBeatSyncComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x4];                                       // 0x00A0(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MaxPlayRateBeforeHalf;                             // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinPlayRateBeforeDouble;                           // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DefaultToAnimationBPM;                             // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceBeatSyncAllMontages;                         // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MontageLengthInBeats;                              // 0x00B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MontageOffsetMs;                                   // 0x00B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UMusicClockComponent>    WeakMusicClockPtr;                                 // 0x00BC(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMusicPlaying;                                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHaveTimingInfo;                                   // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         LastKnownMontageInstanceId;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerPawn*                        OwnerPlayerPawn;                                   // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 OwnerMeshComponent;                                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class UMontageBeatSyncComponent>> YoungerSiblings;                         // 0x00E0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UPreciseAnimBeatSyncMetaData*           ActiveTimingInfo;                                  // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BeganPlayingMusic();
	void EndedPlayingMusic();
	class AFortPlayerPawn* GetOwnerFortPlayerPawn();
	class USkeletalMeshComponent* GetOwnerSkeletalMeshComponent();
	bool IsMusicPlaying();
	const class UPreciseAnimBeatSyncMetaData* LookupMontageTimingInfo_BP(class UAnimMontage* Montage, const class AFortPlayerPawn* PlayerPawn);
	void SetMusicClockReference(class UMusicClockComponent* MusicClock);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MontageBeatSyncComponent">();
	}
	static class UMontageBeatSyncComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMontageBeatSyncComponent>();
	}
};

// Class BeatSyncedAnimRuntime.SparksAnimLoggingComponent
// 0x0018 (0x00B8 - 0x00A0)
class USparksAnimLoggingComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class FString GetCurrentFullBodyAnimName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksAnimLoggingComponent">();
	}
	static class USparksAnimLoggingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksAnimLoggingComponent>();
	}
};

// Class BeatSyncedAnimRuntime.AnimNotify_BeatMarker
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_BeatMarker final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_BeatMarker">();
	}
	static class UAnimNotify_BeatMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_BeatMarker>();
	}
};

}

