#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BGA_LinkedActorWithGravity_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_LinkedActorWithGravity_Parent.BGA_LinkedActorWithGravity_Parent_C
// 0x0030 (0x09A8 - 0x0978)
class ABGA_LinkedActorWithGravity_Parent_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWaterInteractionComponent*         FortWaterInteraction;                              // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      FallingCollisionCapsule;                           // 0x0988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortLinkToActorComponent*              FortLinkToActor;                                   // 0x0990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SimulateOnBeginPlay;                               // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideOnDeath;                                       // 0x09A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttached;                                         // 0x09A2(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_9A3[0x1];                                      // 0x09A3(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           GC_Death;                                          // 0x09A4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BeginSimulation();
	void BndEvt__BGA_LinkedActorWithGravity_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature(class AActor* DamageCauser);
	void BndEvt__BGA_LinkedActorWithGravity_Parent_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedPhysicsObjectWake__DelegateSignature(class AActor* PhysicsObject);
	void BndEvt__BGA_LinkedActorWithGravity_Parent_FortProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void BndEvt__BGA_LinkedActorWithGravity_Parent_FortWaterInteraction_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody);
	void ExecuteUbergraph_BGA_LinkedActorWithGravity_Parent(int32 EntryPoint);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnSimulationResumed();
	void OnSimulationStopped(const struct FHitResult& StoppedHit);
	void PlayDeathGC();
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ShouldStopSimulationOnEnterWater(class AWaterBody* WaterBody, bool* ShouldStop);
	void ShouldStopSimulationOnHit(const struct FHitResult& HitResult, bool* ShouldStop);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_LinkedActorWithGravity_Parent_C">();
	}
	static class ABGA_LinkedActorWithGravity_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_LinkedActorWithGravity_Parent_C>();
	}
};

}

