#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_GrindingComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GrindRailRuntime_structs.hpp"
#include "GrindRailRuntime_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrindingComponent.BP_GrindingComponent_C
// 0x0360 (0x0F80 - 0x0C20)
class UBP_GrindingComponent_C final : public UFortPawnComponent_GrindRail
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   Player;                                            // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            MovementComponent;                                 // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Grinding;                                          // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x3];                                      // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Delta_Seconds;                                     // 0x0C3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTacticalSprintEnergyComponent_C*       SprintComponent;                                   // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Sprint;                                         // 0x0C48(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4C[0x4];                                      // 0x0C4C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class USkeletalMeshComponent*                 PlayerMesh;                                        // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CurrentlyADS;                                      // 0x0C58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C59[0x7];                                      // 0x0C59(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        _new__CurrentSidewaysLeanBoostAmount;              // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _new__GoalSidewaysLeanBoostAmount;                 // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentMaxSpeed;                                   // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitObstacle;                                       // 0x0C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimLayerActive;                                   // 0x0C79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7A[0x6];                                      // 0x0C7A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        LastRailSwitchTime;                                // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              JumpedOff;                                         // 0x0C88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABGA_GrindRail_C*                       CurrentRail;                                       // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MaximumAngleForSideJump;                           // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SideJump_NumberOfNewLocationsToTry;                // 0x0CA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        SideJump_MinSpeedPercentToMaintain;                // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SideJump_MaxSpeedWithoutAnchor;                    // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawAnchorDebug;                                   // 0x0CC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC1[0x7];                                      // 0x0CC1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SF_Sprinting_EnergyToUsePerSecond;                 // 0x0CC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_Sprinting_EnergyToUsePerSecond_Creative;        // 0x0CF0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_LandingSpeedBoost;                              // 0x0D18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_SameRailAnchoring_MaxForwardDistanceMultiplier; // 0x0D40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_SameRailAnchoring_MaxAngle;                     // 0x0D68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_InfluenceOfMomentumOnAnchorJump;                // 0x0D90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_NoAnchorJumpDistanceMultiplier;                 // 0x0DB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_MinJumpOffSpeed;                                // 0x0DE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_JumpHeight;                                     // 0x0E08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_JumpDistanceMultiplier;                         // 0x0E30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_SpeedMultiplierWhenImpactedPlayer;              // 0x0E58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         SF_SideJump_HorizontalAngleMultiplier;             // 0x0E80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E84[0x4];                                      // 0x0E84(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAudioComponent*                        JumpOnAudio;                                       // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        LastJumpedTime;                                    // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGrindRailBoosterMode                         _new__PreviousBoosterMode;                         // 0x0E98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _new__GenerallyAccelerating;                       // 0x0E99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9A[0x2];                                      // 0x0E9A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           GC_GenerallyAccelerating;                          // 0x0E9C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BeginGrindBlockTags;                               // 0x0EA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                CameraLocationOnStartedGrinding;                   // 0x0EC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGrindRail*                         WaitingForCamera_SavedGrindRail;                   // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitingForCamera;                                  // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE1[0x7];                                      // 0x0EE1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UCameraModifier_Grinding_C*             CameraModifier;                                    // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          StartedGrindFromLand;                              // 0x0EF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF1[0x7];                                      // 0x0EF1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnFeetLanded;                                      // 0x0EF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FScalableFloat                         SF_MinBounceOffPlayerSpeed;                        // 0x0F08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IgnoreStaticPlacedBuilding;                        // 0x0F30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseNativizedGrindingIgnoreActors;                  // 0x0F31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseNativizedSprintInput;                           // 0x0F32(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F33[0x1];                                      // 0x0F33(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Start_Grinding_Event_Tag;                          // 0x0F34(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Stop_Grinding_Event_Tag;                           // 0x0F38(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Start_Sprinting_Event_Tag;                         // 0x0F3C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        SF_SpeedMultiplierOnHitRailCap;                    // 0x0F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SF_MinSpeedAfterBouncedOffRailCap;                 // 0x0F48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SF_RemoveGASmashAfterDelay;                        // 0x0F50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           RemoveIsGrindingTimer;                             // 0x0F78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddCameraModifier();
	void AddMoveIgnoreActors();
	void ADSPressed();
	void ADSReleased();
	void AllowAnotherImpactEffect();
	void Anchor_Forward_Jump(const struct FVector& Planned_Velocity_Without_Jump, const struct FVector& AnchoredJumpDir, struct FVector* NewVelocity, bool* Anchored);
	void AnchorJump(struct FVector* New_Velocity, bool* Anchored);
	void ApplyDamageToDevice(class ABuildingActor* BuildingActor);
	void CacheGrindRailActor();
	void CalculateVelocity(const float DeltaTime, const bool bReplayingMovement, struct FVector* OutVelocity);
	bool Can_Begin_Grinding_From_Land();
	bool CanBeginGrinding();
	void Change_Sprint_State(bool New);
	void CheckForTryingToJumpStraight(const struct FVector& PotentialAnchorPoint, const struct FVector& JumpTravelVector, bool* CancelAnchor);
	void ClearMoveIgnoreActors();
	void Dismount();
	void EndGrindingBP();
	void ExecuteUbergraph_BP_GrindingComponent(int32 EntryPoint);
	void Get_Rail_Jump_To_Location_Horizontal(class ABGA_GrindRail_C* InputPin, double VelMagnitude, const struct FVector& TriggerLocation, const struct FVector& DirectionToCheckAgainst, bool* Valid_Angle, struct FVector* Location, double* DistanceOnNewRail, double* TheDirectionSign);
	struct FVector GetLeanVectorInWorldSpace();
	void Handle_Player_Landed(const struct FHitResult& Hit);
	void HandleBoosterModeChanged(EGrindRailBoosterMode PreviousBoosterMode);
	void HandleGrindFinishedAfterJumping();
	void HandleGrindingBegun();
	void HandleGrindingEnded();
	void HandleGrindingEndedFromReplication();
	void HandleHitWhenGrinding(const struct FHitResult& Hit);
	void HandleJumpOffEnd();
	void HandleRailJump();
	void HandleSprintingStateChanged(bool bNewIsSprinting);
	void HandleSprintInput(bool bPressed);
	bool IsOnSlowDownBooster();
	void Jumpoff(const struct FVector& JumpVelocity);
	void JumpOffEnd();
	void LinkAnimLayer();
	void OnBaseMeshReady(class AFortPlayerPawn* Pawn, class USkeletalMeshComponent* MeshComponent);
	void OnEnergyCompletelyDrained(class UFortComponent_Energy* EnergyComponent);
	void OnFeetLand();
	void PlayJumpOnSound(bool PlayAudio);
	void Rail_Jump();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RemoveCameraModifier();
	void RemoveIsGrindingAfterDelay();
	void Send_Gameplay_Event_Tag_To_Actor_Func(const struct FGameplayTag& EventTag);
	void StartedFastBoosting();
	void StartedSlowBoosting();
	void StoppedFastBoosting();
	void StoppedSlowBoosting();
	void StopSprinting();
	void WentDBNO();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrindingComponent_C">();
	}
	static class UBP_GrindingComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GrindingComponent_C>();
	}
};

}

