#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_PlayerPawn_Athena_Phoebe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayerPawn_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C
// 0x0010 (0x6790 - 0x6780)
class ABP_PlayerPawn_Athena_Phoebe_C : public APlayerPawn_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerPawn_Athena_Phoebe_C;      // 0x6778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   AIEvaluator_CharacterLaunchedKeyName;              // 0x6780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCosmeticVariants;                              // 0x6784(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6785[0x3];                                     // 0x6785(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         CosmeticVariantID;                                 // 0x6788(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignCosmeticVariant();
	void ComputeCosmeticVariantID();
	void ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe(int32 EntryPoint);
	void OnCharacterCustomizationCompleted(class AFortPlayerPawn* Pawn);
	void OnLaunched(const struct FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerPawn_Athena_Phoebe_C">();
	}
	static class ABP_PlayerPawn_Athena_Phoebe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerPawn_Athena_Phoebe_C>();
	}
};

}

