#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_QuartzMusicController

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_QuartzMusicController.BP_QuartzMusicController_C.StopCurrentTrack
// 0x0001 (0x0001 - 0x0000)
struct BP_QuartzMusicController_C_StopCurrentTrack final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_QuartzMusicController.BP_QuartzMusicController_C.RequestTrackPlayback
// 0x0030 (0x0030 - 0x0000)
struct BP_QuartzMusicController_C_RequestTrackPlayback final
{
public:
	class UQuartzMusicTrackComponent_C*           Requesting_Track;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_GetTrackPriority_Priority;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_GetTrackPriority_Priority_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_QuartzMusicController.BP_QuartzMusicController_C.PlayTrack
// 0x0010 (0x0010 - 0x0000)
struct BP_QuartzMusicController_C_PlayTrack final
{
public:
	class UQuartzMusicTrackComponent_C*           Track_Component;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_QuartzMusicController.BP_QuartzMusicController_C.GetCurrentTrack
// 0x0008 (0x0008 - 0x0000)
struct BP_QuartzMusicController_C_GetCurrentTrack final
{
public:
	class UQuartzMusicTrackComponent_C*           CurrentTrack_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}

