#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_UI_StepWizard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_UI_StepWizard_Entry_structs.hpp"
#include "E_UI_StepWizard_Type_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UI_StepWizard.BP_UI_StepWizard_C
// 0x0048 (0x0070 - 0x0028)
class UBP_UI_StepWizard_C final : public UObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FS_UI_StepWizard_Entry                 StepContentData;                                   // 0x0030(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CurrentStep;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalSteps;                                        // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StepWizard_Type                          StepType;                                          // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_BP_UI_StepWizard(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_StepWizard_C">();
	}
	static class UBP_UI_StepWizard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_StepWizard_C>();
	}
};

}

