#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_ZipLine_Athena_Harness_Yellow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ZipLine_Athena_Harness_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZipLine_Athena_Harness_Yellow.BP_ZipLine_Athena_Harness_Yellow_C
// 0x0048 (0x03E0 - 0x0398)
class ABP_ZipLine_Athena_Harness_Yellow_C final : public ABP_ZipLine_Athena_Harness_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ZipLine_Athena_Harness_Yellow_C; // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Zipline_Pulley_SpeedLines_Converted;            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Zipline_Speedline;                              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha_NewTrack_0_AF34CA1D47D28FE19CCA3C98688125DE; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Alpha__Direction_AF34CA1D47D28FE19CCA3C98688125DE; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Alpha;                                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_NewTrack_0_A812B2F04CB78DDF352B84A578861501; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Spark__Direction_A812B2F04CB78DDF352B84A578861501; // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     spark;                                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        BeginLocation_z;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Location;                                          // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Alpha__FinishedFunc();
	void Alpha__UpdateFunc();
	void ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ResetBlue();
	void Spark__FinishedFunc();
	void Spark__UpdateFunc();
	void Update_Begin_Z();
	void UpdateZiplineFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZipLine_Athena_Harness_Yellow_C">();
	}
	static class ABP_ZipLine_Athena_Harness_Yellow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZipLine_Athena_Harness_Yellow_C>();
	}
};

}

