#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Buoyancy

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Buoyancy.BuoyancyEventInterface
// 0x0000 (0x0000 - 0x0000)
class IBuoyancyEventInterface final
{
public:
	void OnSurfaceTouchBegin(class AWaterBody* WaterBodyActor, class UPrimitiveComponent* WaterComponent, class UPrimitiveComponent* SubmergedComponent, float SubmergedVolume, const struct FVector& SubmergedCenterOfMass, const struct FVector& SubmergedVelocity);
	void OnSurfaceTouchEnd(class AWaterBody* WaterBodyActor, class UPrimitiveComponent* WaterComponent, class UPrimitiveComponent* SubmergedComponent, float SubmergedVolume, const struct FVector& SubmergedCenterOfMass, const struct FVector& SubmergedVelocity);
	void OnSurfaceTouching(class AWaterBody* WaterBodyActor, class UPrimitiveComponent* WaterComponent, class UPrimitiveComponent* SubmergedComponent, float SubmergedVolume, const struct FVector& SubmergedCenterOfMass, const struct FVector& SubmergedVelocity);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuoyancyEventInterface">();
	}
	static class IBuoyancyEventInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBuoyancyEventInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class Buoyancy.BuoyancyRuntimeSettings
// 0x0020 (0x0050 - 0x0030)
class UBuoyancyRuntimeSettings final : public UDeveloperSettings
{
public:
	bool                                          bBuoyancyEnabled;                                  // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepFloatingObjectsAwake;                         // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         WaterDensity;                                      // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterDrag;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannelForWaterObjects;                   // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         MaxNumBoundsSubdivisions;                          // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinBoundsSubdivisionVol;                           // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SurfaceTouchCallbackFlags;                         // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MinVelocityForSurfaceTouchCallback;                // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuoyancyRuntimeSettings">();
	}
	static class UBuoyancyRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuoyancyRuntimeSettings>();
	}
};

// Class Buoyancy.BuoyancySubsystem
// 0x0048 (0x0088 - 0x0040)
class UBuoyancySubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x48];                                      // 0x0040(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuoyancySubsystem">();
	}
	static class UBuoyancySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuoyancySubsystem>();
	}
};

}

