#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Burt_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Burt_AnimBP.Burt_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Burt_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Burt_AnimBP.Burt_AnimBP_C.ExecuteUbergraph_Burt_AnimBP
// 0x0020 (0x0020 - 0x0000)
struct Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_3_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Burt_AnimBP.Burt_AnimBP_C.Fauna Idle
// 0x0020 (0x0020 - 0x0000)
struct Burt_AnimBP_C_Fauna_Idle final
{
public:
	struct FPoseLink                              InPose_Idle;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Fauna_Idle_0;                                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Burt_AnimBP.Burt_AnimBP_C.Fauna IdleTurn
// 0x0020 (0x0020 - 0x0000)
struct Burt_AnimBP_C_Fauna_IdleTurn final
{
public:
	struct FPoseLink                              InPose_IdleTurn;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Fauna_IdleTurn_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

