#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ChaosCaching

#include "Basic.hpp"

#include "MovieScene_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ChaosCaching_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieSceneTracks_classes.hpp"


namespace SDK
{

// Class ChaosCaching.ChaosCacheCollection
// 0x0010 (0x0038 - 0x0028)
class UChaosCacheCollection final : public UObject
{
public:
	TArray<class UChaosCache*>                    Caches;                                            // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCacheCollection">();
	}
	static class UChaosCacheCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCacheCollection>();
	}
};

// Class ChaosCaching.ChaosCacheManager
// 0x00B0 (0x0340 - 0x0290)
class AChaosCacheManager : public AActor
{
public:
	class UChaosCacheCollection*                  CacheCollection;                                   // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECacheMode                                    CacheMode;                                         // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStartMode                                    StartMode;                                         // 0x0299(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StartTime;                                         // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FObservedComponent>             ObservedComponents;                                // 0x02A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x88];                                     // 0x02B8(0x0088)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void EnablePlayback(int32 Index_0, bool bEnable);
	void EnablePlaybackByCache(class FName InCacheName, bool bEnable);
	void ResetAllComponentTransforms();
	void ResetSingleTransform(int32 InIndex);
	void SetCacheCollection(class UChaosCacheCollection* InCacheCollection);
	void SetCurrentTime(float CurrentTime);
	void SetStartTime(float InStartTime);
	void TriggerAll();
	void TriggerComponent(class UPrimitiveComponent* InComponent);
	void TriggerComponentByCache(class FName InCacheName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCacheManager">();
	}
	static class AChaosCacheManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosCacheManager>();
	}
};

// Class ChaosCaching.ChaosCachePlayer
// 0x0000 (0x0340 - 0x0340)
class AChaosCachePlayer final : public AChaosCacheManager
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCachePlayer">();
	}
	static class AChaosCachePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosCachePlayer>();
	}
};

// Class ChaosCaching.ChaosCache
// 0x0338 (0x0360 - 0x0028)
class UChaosCache final : public UObject
{
public:
	float                                         RecordedDuration;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumRecordedFrames;                                 // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 TrackToParticle;                                   // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerParticleCacheData>          ParticleTracks;                                    // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ChannelCurveToParticle;                            // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FRichCurves>         ChannelsTracks;                                    // 0x0060(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FCompressedRichCurves> CompressedChannelsTracks;                        // 0x00B0(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FRichCurve>          CurveData;                                         // 0x0100(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FParticleTransformTrack> NamedTransformTracks;                          // 0x0150(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bCompressChannels;                                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ChannelsCompressionErrorThreshold;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChannelsCompressionSampleRate;                     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class FName, struct FCacheEventTrack>    EventTracks;                                       // 0x01B0(0x0050)(NativeAccessSpecifierPrivate)
	struct FCacheSpawnableTemplate                Spawnable;                                         // 0x0200(0x00D0)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  AdapterGuid;                                       // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Version;                                           // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E4[0x7C];                                     // 0x02E4(0x007C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosCache">();
	}
	static class UChaosCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCache>();
	}
};

// Class ChaosCaching.MovieSceneChaosCacheSection
// 0x0028 (0x0120 - 0x00F8)
class UMovieSceneChaosCacheSection final : public UMovieSceneBaseCacheSection
{
public:
	struct FMovieSceneChaosCacheParams            Params_0;                                          // 0x00F8(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChaosCacheSection">();
	}
	static class UMovieSceneChaosCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneChaosCacheSection>();
	}
};

// Class ChaosCaching.MovieSceneChaosCacheTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneChaosCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChaosCacheTrack">();
	}
	static class UMovieSceneChaosCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneChaosCacheTrack>();
	}
};

}

