#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Chooser

#include "Basic.hpp"

#include "StructUtils_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BlendStack_structs.hpp"


namespace SDK
{

// Enum Chooser.EBoolColumnCellValue
// NumValues: 0x0004
enum class EBoolColumnCellValue : uint8
{
	MatchFalse                               = 0,
	MatchTrue                                = 1,
	MatchAny                                 = 2,
	EBoolColumnCellValue_MAX                 = 3,
};

// Enum Chooser.EContextObjectDirection
// NumValues: 0x0004
enum class EContextObjectDirection : uint32
{
	Read                                     = 0,
	Write                                    = 1,
	ReadWrite                                = 2,
	EContextObjectDirection_MAX              = 3,
};

// Enum Chooser.EEnumColumnCellValueComparison
// NumValues: 0x0005
enum class EEnumColumnCellValueComparison : uint32
{
	MatchEqual                               = 0,
	MatchNotEqual                            = 1,
	MatchAny                                 = 2,
	Modulus                                  = 3,
	EEnumColumnCellValueComparison_MAX       = 4,
};

// Enum Chooser.EObjectChooserResultType
// NumValues: 0x0003
enum class EObjectChooserResultType : uint32
{
	ObjectResult                             = 0,
	ClassResult                              = 1,
	EObjectChooserResultType_MAX             = 2,
};

// Enum Chooser.EObjectColumnCellValueComparison
// NumValues: 0x0005
enum class EObjectColumnCellValueComparison : uint32
{
	MatchEqual                               = 0,
	MatchNotEqual                            = 1,
	MatchAny                                 = 2,
	Modulus                                  = 3,
	EObjectColumnCellValueComparison_MAX     = 4,
};

// Enum Chooser.EChooserEvaluationFrequency
// NumValues: 0x0005
enum class EChooserEvaluationFrequency : uint32
{
	OnInitialUpdate                          = 0,
	OnBecomeRelevant                         = 1,
	OnLoop                                   = 2,
	OnUpdate                                 = 3,
	EChooserEvaluationFrequency_MAX          = 4,
};

// ScriptStruct Chooser.ChooserParameterBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FChooserParameterBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.ChooserParameterBoolBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterBoolBase : public FChooserParameterBase
{
};

// ScriptStruct Chooser.ChooserPropertyBinding
// 0x0028 (0x0028 - 0x0000)
struct FChooserPropertyBinding
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ContextIndex;                                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBoundToRoot;                                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x13];                                      // 0x0015(0x0013)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.BoolContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FBoolContextProperty final : public FChooserParameterBoolBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserPropertyBinding                Binding;                                           // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserColumnBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FChooserColumnBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.BoolColumn
// 0x0020 (0x0028 - 0x0008)
struct FBoolColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<EBoolColumnCellValue>                  RowValuesWithAny;                                  // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserEnumPropertyBinding
// 0x0000 (0x0028 - 0x0028)
struct FChooserEnumPropertyBinding final : public FChooserPropertyBinding
{
};

// ScriptStruct Chooser.ChooserObjectPropertyBinding
// 0x0000 (0x0028 - 0x0028)
struct FChooserObjectPropertyBinding final : public FChooserPropertyBinding
{
};

// ScriptStruct Chooser.ChooserStructPropertyBinding
// 0x0000 (0x0028 - 0x0028)
struct FChooserStructPropertyBinding final : public FChooserPropertyBinding
{
};

// ScriptStruct Chooser.ContextObjectTypeBase
// 0x0004 (0x0004 - 0x0000)
struct FContextObjectTypeBase
{
public:
	EContextObjectDirection                       Direction;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ContextObjectTypeClass
// 0x000C (0x0010 - 0x0004)
struct FContextObjectTypeClass final : public FContextObjectTypeBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UObject>                    Class;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ContextObjectTypeStruct
// 0x000C (0x0010 - 0x0004)
struct FContextObjectTypeStruct final : public FContextObjectTypeBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UScriptStruct*                          Struct;                                            // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserParameterEnumBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterEnumBase : public FChooserParameterBase
{
};

// ScriptStruct Chooser.EnumContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FEnumContextProperty final : public FChooserParameterEnumBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserEnumPropertyBinding            Binding;                                           // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserEnumRowData
// 0x0008 (0x0008 - 0x0000)
struct FChooserEnumRowData final
{
public:
	EEnumColumnCellValueComparison                Comparison;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.EnumColumn
// 0x0020 (0x0028 - 0x0008)
struct FEnumColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserEnumRowData>            RowValues;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserParameterFloatBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterFloatBase : public FChooserParameterBase
{
};

// ScriptStruct Chooser.FloatContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FFloatContextProperty final : public FChooserParameterFloatBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserPropertyBinding                Binding;                                           // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserFloatRangeRowData
// 0x0008 (0x0008 - 0x0000)
struct FChooserFloatRangeRowData final
{
public:
	float                                         Min;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.FloatRangeColumn
// 0x0020 (0x0028 - 0x0008)
struct FFloatRangeColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserFloatRangeRowData>      RowValues;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserParameterGameplayTagBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterGameplayTagBase : public FChooserParameterBase
{
};

// ScriptStruct Chooser.GameplayTagContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FGameplayTagContextProperty final : public FChooserParameterGameplayTagBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserPropertyBinding                Binding;                                           // 0x0018(0x0028)(Edit, NoClear, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.GameplayTagColumn
// 0x0028 (0x0030 - 0x0008)
struct FGameplayTagColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   TagMatchType;                                      // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FGameplayTagContainer>          RowValues;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserParameterObjectBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterObjectBase : public FChooserParameterBase
{
};

// ScriptStruct Chooser.ChooserRandomizationContext
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FChooserRandomizationContext final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.ChooserParameterRandomizeBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterRandomizeBase : public FChooserParameterBase
{
};

// ScriptStruct Chooser.ChooserParameterStructBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterStructBase : public FChooserParameterBase
{
};

// ScriptStruct Chooser.ChooserEvaluationInputObject
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FChooserEvaluationInputObject final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.ChooserEvaluationContext
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FChooserEvaluationContext final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.ObjectChooserBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FObjectChooserBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.AssetChooser
// 0x0008 (0x0010 - 0x0008)
struct FAssetChooser final : public FObjectChooserBase
{
public:
	class UObject*                                Asset;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ClassChooser
// 0x0008 (0x0010 - 0x0008)
struct FClassChooser final : public FObjectChooserBase
{
public:
	TSubclassOf<class UObject>                    Class;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ObjectContextProperty
// 0x0028 (0x0030 - 0x0008)
struct FObjectContextProperty final : public FChooserParameterObjectBase
{
public:
	struct FChooserObjectPropertyBinding          Binding;                                           // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserObjectRowData
// 0x0028 (0x0028 - 0x0000)
struct FChooserObjectRowData final
{
public:
	EObjectColumnCellValueComparison              Comparison;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UObject>                 Value;                                             // 0x0008(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ObjectColumn
// 0x0020 (0x0028 - 0x0008)
struct FObjectColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserObjectRowData>          RowValues;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.OutputBoolColumn
// 0x0028 (0x0030 - 0x0008)
struct FOutputBoolColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	bool                                          bFallbackValue;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<bool>                                  RowValues;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.ChooserOutputEnumRowData
// 0x0001 (0x0001 - 0x0000)
struct FChooserOutputEnumRowData final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.OutputEnumColumn
// 0x0028 (0x0030 - 0x0008)
struct FOutputEnumColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	struct FChooserOutputEnumRowData              FallbackValue;                                     // 0x0018(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FChooserOutputEnumRowData>      RowValues;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.OutputFloatColumn
// 0x0028 (0x0030 - 0x0008)
struct FOutputFloatColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	double                                        FallbackValue;                                     // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<double>                                RowValues;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.StructContextProperty
// 0x0028 (0x0030 - 0x0008)
struct FStructContextProperty final : public FChooserParameterStructBase
{
public:
	struct FChooserStructPropertyBinding          Binding;                                           // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.OutputStructColumn
// 0x0030 (0x0038 - 0x0008)
struct FOutputStructColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       FallbackValue;                                     // 0x0018(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               RowValues;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.RandomizeContextProperty
// 0x0028 (0x0030 - 0x0008)
struct FRandomizeContextProperty final : public FChooserParameterRandomizeBase
{
public:
	struct FChooserPropertyBinding                Binding;                                           // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.RandomizeColumn
// 0x0028 (0x0030 - 0x0008)
struct FRandomizeColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	float                                         RepeatProbabilityMultiplier;                       // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<float>                                 RowValues;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.AnimCurveOverride
// 0x0008 (0x0008 - 0x0000)
struct FAnimCurveOverride final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurveValue;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Chooser.AnimCurveOverrideList
// 0x0018 (0x0018 - 0x0000)
struct FAnimCurveOverrideList final
{
public:
	TArray<struct FAnimCurveOverride>             Values;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        Hash;                                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.ChooserPlayerSettings
// 0x0040 (0x0040 - 0x0000)
struct FChooserPlayerSettings final
{
public:
	bool                                          bMirror;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceLooping;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         PlaybackRate;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimCurveOverrideList                 CurveOverrides;                                    // 0x0010(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UBlendProfile*                          BlendProfile;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlphaBlendOption                             BlendOption;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseInertialBlend;                                 // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.AnimNode_ChooserPlayer
// 0x00F8 (0x0168 - 0x0070)
struct FAnimNode_ChooserPlayer final : public FAnimNode_BlendStack_Standalone
{
public:
	EChooserEvaluationFrequency                   EvaluationFrequency;                               // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedStruct                       Chooser;                                           // 0x0078(0x0010)(Edit, NativeAccessSpecifierPublic)
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendSpaceX;                                       // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendSpaceY;                                       // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FChooserPlayerSettings                 DefaultSettings;                                   // 0x00A0(0x0040)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ChooserContextDefinition;                          // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x78];                                      // 0x00F0(0x0078)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct Chooser.EvaluateChooser
// 0x0008 (0x0010 - 0x0008)
struct FEvaluateChooser final : public FObjectChooserBase
{
public:
	class UChooserTable*                          Chooser;                                           // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

