#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CollectionMapShared

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class CollectionMapShared.AthenaCollectionScreenMapBase
// 0x0088 (0x06E8 - 0x0660)
class UAthenaCollectionScreenMapBase : public UAthenaCollectionScreenBase
{
public:
	class UAthenaFullScreenMapBase*               MapWidget;                                         // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UAthenaMapCollectionIcon>   CollectionIconType;                                // 0x0670(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UAthenaMapCollectionIcon*> MapCollectionIcons;                   // 0x0678(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C8[0x20];                                     // 0x06C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCollectionScreenMapBase">();
	}
	static class UAthenaCollectionScreenMapBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCollectionScreenMapBase>();
	}
};

// Class CollectionMapShared.AthenaMapCollectionIcon
// 0x0000 (0x0388 - 0x0388)
class UAthenaMapCollectionIcon final : public UAthenaMapNavigableIconCustom
{
public:
	void SetIsKnown(const bool bIsKnown);
	void SetSecondaryIcon(const TSoftObjectPtr<class UObject>& SecondaryIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaMapCollectionIcon">();
	}
	static class UAthenaMapCollectionIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapCollectionIcon>();
	}
};

}

