#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CommonUILegacy

#include "Basic.hpp"

#include "CommonUI_structs.hpp"


namespace SDK
{

// Enum CommonUILegacy.EOperation
// NumValues: 0x0006
enum class EOperation : uint8
{
	Intro                                    = 0,
	Outro                                    = 1,
	Push                                     = 2,
	Pop                                      = 3,
	Invalid                                  = 4,
	EOperation_MAX                           = 5,
};

// Enum CommonUILegacy.ECommonPlatformType
// NumValues: 0x000B
enum class ECommonPlatformType : uint8
{
	PC                                       = 0,
	Mac                                      = 1,
	PS4                                      = 2,
	XBox                                     = 3,
	IOS                                      = 4,
	Android                                  = 5,
	Switch                                   = 6,
	XSX                                      = 7,
	PS5                                      = 8,
	Count                                    = 9,
	ECommonPlatformType_MAX                  = 10,
};

// Enum CommonUILegacy.ECommonGamepadType
// NumValues: 0x0008
enum class ECommonGamepadType : uint8
{
	XboxOneController                        = 0,
	PS4Controller                            = 1,
	SwitchController                         = 2,
	GenericController                        = 3,
	XboxSeriesXController                    = 4,
	PS5Controller                            = 5,
	Count                                    = 6,
	ECommonGamepadType_MAX                   = 7,
};

// ScriptStruct CommonUILegacy.Operation
// 0x0028 (0x0028 - 0x0000)
struct FOperation final
{
public:
	EOperation                                    Operation;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonActivatablePanelLegacy*          Panel;                                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntroPanel;                                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivatePanel;                                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutroPanelBelow;                                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x15];                                      // 0x0013(0x0015)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CommonUILegacy.CommonInputActionData
// 0x05F0 (0x0950 - 0x0360)
struct FCommonInputActionData final : public FCommonInputActionDataBase
{
public:
	TMap<ECommonGamepadType, struct FCommonInputTypeInfo> GamepadInputTypeInfoOverrides;             // 0x0360(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FCommonInputTypeInfo                   GamepadInputTypeInfos[0x6];                        // 0x03B0(0x00F0)(Deprecated, Protected, NativeAccessSpecifierProtected)
};

}

