#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CommonUILegacy

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUILegacy_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// Class CommonUILegacy.CommonActivatablePanelLegacy
// 0x0138 (0x0538 - 0x0400)
class UCommonActivatablePanelLegacy : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class UCommonActivatablePanelLegacy* Panel)> OnWidgetActivated;    // 0x0408(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UCommonActivatablePanelLegacy* Panel)> OnWidgetDeactivated;  // 0x0418(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bConsumeAllActions;                                // 0x0428(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExposeActionsExternally;                          // 0x0429(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldBypassStack;                                // 0x042A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42B[0x10D];                                    // 0x042B(0x010D)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddInputActionHandler(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent);
	void AddInputActionHandlerWithPopup(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent, class UCommonPopupMenuLegacy* PopupMenu);
	void AddInputActionHandlerWithProgress(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent);
	void AddInputActionHandlerWithProgressPopup(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent, class UCommonPopupMenuLegacy* PopupMenu);
	void AddInputActionNoHandler(class UDataTable* DataTable, class FName RowName);
	void BeginIntro();
	void BeginOutro();
	void EndIntro();
	void EndOutro();
	void OnAddedToActivationStack();
	void OnBeginIntro();
	void OnBeginOutro();
	void OnInputModeChanged(bool bUsingGamepad);
	void OnRemovedFromActivationStack();
	void OnTransitionedBySwitcher();
	void PopPanel();
	void RemoveAllInputActionHandlers();
	void RemoveInputActionHandler(const struct FDataTableRowHandle& InputActionRow);
	void SetActionHandlerState(const class UDataTable* DataTable, class FName RowName, EInputActionState State);
	void SetActionHandlerStateFromHandle(const struct FDataTableRowHandle& InputActionRow, EInputActionState State);
	void SetActionHandlerStateFromHandleWithDisabledCommitEvent(const struct FDataTableRowHandle& InputActionRow, EInputActionState State, TDelegate<void(bool* bPassThrough)> DisabledCommitEvent);
	void SetActionHandlerStateWithDisabledCommitEvent(class UDataTable* DataTable, class FName RowName, EInputActionState State, TDelegate<void(bool* bPassThrough)> DisabledCommitEvent);
	void SetInputActionHandler(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent);
	void SetInputActionHandlerWithPopupMenu(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent, class UCommonPopupMenuLegacy* PopupMenu);
	void SetInputActionHandlerWithProgress(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent);
	void SetInputActionHandlerWithProgressPopupMenu(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent, class UCommonPopupMenuLegacy* PopupMenu);

	bool GetInputActions(TArray<struct FCommonInputActionHandlerData>* InputActionDataRows) const;
	bool HasInputActionHandler(const struct FDataTableRowHandle& InputActionRow) const;
	bool IsInActivationStack() const;
	bool IsIntroed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActivatablePanelLegacy">();
	}
	static class UCommonActivatablePanelLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActivatablePanelLegacy>();
	}
};

// Class CommonUILegacy.CommonButtonInternalLegacy
// 0x0000 (0x0640 - 0x0640)
class UCommonButtonInternalLegacy final : public UCommonButtonInternalBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonButtonInternalLegacy">();
	}
	static class UCommonButtonInternalLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButtonInternalLegacy>();
	}
};

// Class CommonUILegacy.CommonButtonLegacy
// 0x0050 (0x14E0 - 0x1490)
class UCommonButtonLegacy : public UCommonButtonBase
{
public:
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button, bool Selected)> OnSelectedChanged; // 0x1490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonClicked;               // 0x14A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonDoubleClicked;         // 0x14B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonHovered;               // 0x14C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonUnhovered;             // 0x14D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	void HandleOnButtonClicked(class UCommonButtonBase* Button);
	void HandleOnButtonDoubleClicked(class UCommonButtonBase* Button);
	void HandleOnButtonHovered(class UCommonButtonBase* Button);
	void HandleOnButtonUnhovered(class UCommonButtonBase* Button);
	void HandleOnSelectedChanged(class UCommonButtonBase* Button, bool InSelected);
	void SetTriggeredInputActionLegacy(const struct FDataTableRowHandle& InputActionRow, class UCommonActivatablePanelLegacy* OldPanel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonButtonLegacy">();
	}
	static class UCommonButtonLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButtonLegacy>();
	}
};

// Class CommonUILegacy.CommonGlobalInputHandlerLegacy
// 0x0048 (0x0070 - 0x0028)
class UCommonGlobalInputHandlerLegacy final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonGlobalInputHandlerLegacy">();
	}
	static class UCommonGlobalInputHandlerLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonGlobalInputHandlerLegacy>();
	}
};

// Class CommonUILegacy.CommonInputManagerLegacy
// 0x00E0 (0x0108 - 0x0028)
class UCommonInputManagerLegacy final : public UObject
{
public:
	uint8                                         Pad_28[0x80];                                      // 0x0028(0x0080)(Fixing Size After Last Property [ Dumper-8 ])
	TScriptInterface<class ICommonActionHandlerInterface> CurrentlyHeldActionInputHandler;           // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCommonActivatablePanelLegacy*>  ActivatablePanelStack;                             // 0x00B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UCommonGlobalInputHandlerLegacy*        GlobalInputHandler;                                // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FOperation>                     Operations;                                        // 0x00E8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool GetAvailableInputActions(TArray<struct FCommonInputActionHandlerData>* AvailableInputActions);
	void PopActivatablePanel(class UCommonActivatablePanelLegacy* ActivatablePanel);
	void PushActivatablePanel(class UCommonActivatablePanelLegacy* ActivatablePanel, bool bIntroPanel, bool bOutroPanelBelow);
	void ResumeStartingOperationProcessing();
	void SetGlobalInputHandlerPriorityFilter(int32 InFilterPriority);
	bool StartListeningForExistingHeldAction(const struct FDataTableRowHandle& InputActionDataRow, const TDelegate<void()>& CompleteEvent, const TDelegate<void(float HeldPercent)>& ProgressEvent);
	bool StopListeningForExistingHeldAction(const struct FDataTableRowHandle& InputActionDataRow, const TDelegate<void()>& CompleteEvent, const TDelegate<void(float HeldPercent)>& ProgressEvent);
	void SuspendStartingOperationProcessing();

	int32 GetGlobalInputHandlerPriorityFilter() const;
	class UCommonActivatablePanelLegacy* GetTopPanel() const;
	bool IsInputSuspended() const;
	bool IsPanelOnStack(const class UCommonActivatablePanelLegacy* InPanel) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonInputManagerLegacy">();
	}
	static class UCommonInputManagerLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonInputManagerLegacy>();
	}
};

// Class CommonUILegacy.CommonInputReflectorLegacy
// 0x0030 (0x0318 - 0x02E8)
class UCommonInputReflectorLegacy final : public UCommonUserWidget
{
public:
	TSubclassOf<class UCommonButtonLegacy>        ButtonType;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCommonButtonLegacy*>            ActiveButtons;                                     // 0x02F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UCommonButtonLegacy*>            InactiveButtons;                                   // 0x0300(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnButtonAdded(class UCommonButtonLegacy* AddedButton, const struct FCommonInputActionHandlerData& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonInputReflectorLegacy">();
	}
	static class UCommonInputReflectorLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonInputReflectorLegacy>();
	}
};

// Class CommonUILegacy.CommonPopupButtonLegacy
// 0x0010 (0x14F0 - 0x14E0)
class UCommonPopupButtonLegacy : public UCommonButtonLegacy
{
public:
	class UMenuAnchor*                            PopupMenuAnchor;                                   // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonPopupMenuLegacy*                 PopupMenu;                                         // 0x14E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UUserWidget* GetMenuAnchorWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonPopupButtonLegacy">();
	}
	static class UCommonPopupButtonLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonPopupButtonLegacy>();
	}
};

// Class CommonUILegacy.CommonPopupMenuLegacy
// 0x0018 (0x0550 - 0x0538)
class UCommonPopupMenuLegacy : public UCommonActivatablePanelLegacy
{
public:
	bool                                          bUseInputStack;                                    // 0x0538(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class UMenuAnchor>             OwningMenuAnchor;                                  // 0x053C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UObject>                 ContextProvidingObject;                            // 0x0544(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandlePostDifferentContextProviderSet();
	void HandlePreDifferentContextProviderSet();
	void OnIsOpenChanged(bool IsOpen);
	void RequestClose();
	void SetContextProvider(const class UObject* ContextProvidingObject_0);
	void SetOwningMenuAnchor(const class UMenuAnchor* MenuAnchor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonPopupMenuLegacy">();
	}
	static class UCommonPopupMenuLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonPopupMenuLegacy>();
	}
};

// Class CommonUILegacy.CommonTabListWidgetLegacy
// 0x0020 (0x03F8 - 0x03D8)
class UCommonTabListWidgetLegacy : public UCommonTabListWidgetBase
{
public:
	TMulticastInlineDelegate<void(class FName TabID, class UCommonButtonLegacy* TabButton)> OnTabButtonCreated; // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName TabID, class UCommonButtonLegacy* TabButton)> OnTabButtonRemoved; // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	class UCommonButtonLegacy* GetTabButtonByID(class FName TabNameID);
	void HandleOnTabButtonCreated(class FName TabID, class UCommonButtonBase* TabButton);
	void HandleOnTabButtonRemoved(class FName TabID, class UCommonButtonBase* TabButton);
	void HandleTabCreated(class FName TabNameID, class UCommonButtonLegacy* TabButton);
	void HandleTabRemoved(class FName TabNameID, class UCommonButtonLegacy* TabButton);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonTabListWidgetLegacy">();
	}
	static class UCommonTabListWidgetLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonTabListWidgetLegacy>();
	}
};

// Class CommonUILegacy.CommonUISubsystemLegacy
// 0x0030 (0x0070 - 0x0040)
class UCommonUISubsystemLegacy final : public UCommonUISubsystemBase
{
public:
	TMulticastInlineDelegate<void(bool bInputSuspended)> OnInputSuspensionChanged;                   // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonInputManagerLegacy*              CommonInputManager;                                // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UCommonInputManagerLegacy* GetInputManager() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUISubsystemLegacy">();
	}
	static class UCommonUISubsystemLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUISubsystemLegacy>();
	}
};

// Class CommonUILegacy.CommonVisibilityWidgetLegacy
// 0x0010 (0x0330 - 0x0320)
class UCommonVisibilityWidgetLegacy final : public UCommonBorder
{
public:
	bool                                          bShowForGamepad;                                   // 0x0320(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForMouseAndKeyboard;                          // 0x0321(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForTouch;                                     // 0x0322(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForPC;                                        // 0x0323(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForMac;                                       // 0x0324(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForPS4;                                       // 0x0325(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForPS5;                                       // 0x0326(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForXBox;                                      // 0x0327(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForXSX;                                       // 0x0328(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForIOS;                                       // 0x0329(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForAndroid;                                   // 0x032A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForErebus;                                    // 0x032B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              VisibleType;                                       // 0x032C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              HiddenType;                                        // 0x032D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonVisibilityWidgetLegacy">();
	}
	static class UCommonVisibilityWidgetLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonVisibilityWidgetLegacy>();
	}
};

// Class CommonUILegacy.CommonWidgetStackLegacy
// 0x0010 (0x01D8 - 0x01C8)
class UCommonWidgetStackLegacy final : public UCommonVisibilitySwitcher
{
public:
	TMulticastInlineDelegate<void(class UWidget* InActiveWidget, int32 InActiveWidgetIndex)> OnActiveWidgetChangedLegacyEvent; // 0x01C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	void ActivateWidget();
	void DeactivateWidget();
	class UWidget* PopWidget();
	void PushWidget(class UWidget* InWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonWidgetStackLegacy">();
	}
	static class UCommonWidgetStackLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonWidgetStackLegacy>();
	}
};

// Class CommonUILegacy.CommonWidgetSwitcherLegacy
// 0x0028 (0x0250 - 0x0228)
class UCommonWidgetSwitcherLegacy : public UCommonAnimatedSwitcher
{
public:
	TMulticastInlineDelegate<void(class UCommonActivatablePanelLegacy* DeactivatedWidget)> OnActiveWidgetDeactivated; // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UWidget* ActiveWidget, int32 ActiveWidgetIndex)> OnActiveWidgetChanged; // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bWidgetActivationEnabled;                          // 0x0248(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOutroPanelBelow;                                  // 0x0249(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ActivateWidget();
	void DeactivateWidget();
	void HandleActiveWidgetDeactivated(class UCommonActivatablePanelLegacy* DeactivatedPanel);
	void SetActiveWidget_Advanced(class UWidget* Widget, const bool AttemptActivationChange);
	void SetActiveWidgetIndex_Advanced(const int32 Index_0, const bool AttemptActivationChange);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonWidgetSwitcherLegacy">();
	}
	static class UCommonWidgetSwitcherLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonWidgetSwitcherLegacy>();
	}
};

// Class CommonUILegacy.CommonButtonGroupLegacy
// 0x00A0 (0x01B0 - 0x0110)
class UCommonButtonGroupLegacy : public UCommonButtonGroupBase
{
public:
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnSelectedButtonChanged; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_120[0x18];                                     // 0x0120(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnHoveredButtonChanged; // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x18];                                     // 0x0148(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnButtonClicked; // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x18];                                     // 0x0170(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnButtonDoubleClicked; // 0x0188(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_198[0x18];                                     // 0x0198(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UCommonButtonGroupLegacy* CreateButtonGroup(class UObject* ContextObject, bool bInSelectionRequired);

	void HandleNativeOnButtonClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleNativeOnButtonDoubleClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleNativeOnHoveredButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleNativeOnSelectedButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnButtonClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnButtonDoubleClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnHoveredButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnSelectedButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void OnButtonHovered(class UCommonButtonLegacy* BaseButton);
	void OnButtonUnhovered(class UCommonButtonLegacy* BaseButton);
	void OnHandleButtonClicked(class UCommonButtonLegacy* BaseButton);
	void OnHandleButtonDoubleClicked(class UCommonButtonLegacy* BaseButton);
	void OnSelectionStateChanged(class UCommonButtonLegacy* BaseButton, bool bIsSelected);

	class UCommonButtonLegacy* GetButtonAtIndex(int32 Index_0) const;
	class UCommonButtonLegacy* GetSelectedButton() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonButtonGroupLegacy">();
	}
	static class UCommonButtonGroupLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButtonGroupLegacy>();
	}
};

// Class CommonUILegacy.CommonUIActionRouterLegacy
// 0x0008 (0x0178 - 0x0170)
class UCommonUIActionRouterLegacy final : public UCommonUIActionRouterBase
{
public:
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUIActionRouterLegacy">();
	}
	static class UCommonUIActionRouterLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIActionRouterLegacy>();
	}
};

}

