#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ComputeFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ComputeFramework_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ComputeFramework.ComputeDataInterface
// 0x0000 (0x0028 - 0x0028)
class UComputeDataInterface : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeDataInterface">();
	}
	static class UComputeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeDataInterface>();
	}
};

// Class ComputeFramework.ComputeDataProvider
// 0x0000 (0x0028 - 0x0028)
class UComputeDataProvider : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeDataProvider">();
	}
	static class UComputeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeDataProvider>();
	}
};

// Class ComputeFramework.ComputeKernelSource
// 0x0070 (0x0098 - 0x0028)
class UComputeKernelSource : public UObject
{
public:
	class FString                                 EntryPoint;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             GroupSize;                                         // 0x0038(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FComputeKernelPermutationSet           PermutationSet;                                    // 0x0048(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FComputeKernelDefinitionSet            DefinitionsSet;                                    // 0x0058(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<class UComputeSource*>                 AdditionalSources;                                 // 0x0068(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FShaderFunctionDefinition>      ExternalInputs;                                    // 0x0078(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FShaderFunctionDefinition>      ExternalOutputs;                                   // 0x0088(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeKernelSource">();
	}
	static class UComputeKernelSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeKernelSource>();
	}
};

// Class ComputeFramework.ComputeSource
// 0x0010 (0x0038 - 0x0028)
class UComputeSource : public UObject
{
public:
	TArray<class UComputeSource*>                 AdditionalSources;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeSource">();
	}
	static class UComputeSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeSource>();
	}
};

// Class ComputeFramework.ComputeGraph
// 0x0068 (0x0090 - 0x0028)
class UComputeGraph : public UObject
{
public:
	TArray<class UComputeKernel*>                 KernelInvocations;                                 // 0x0028(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UComputeDataInterface*>          DataInterfaces;                                    // 0x0038(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FComputeGraphEdge>              GraphEdges;                                        // 0x0048(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UObject>>            Bindings;                                          // 0x0058(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<int32>                                 DataInterfaceToBinding;                            // 0x0068(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeGraph">();
	}
	static class UComputeGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeGraph>();
	}
};

// Class ComputeFramework.ComputeGraphComponent
// 0x0020 (0x00C0 - 0x00A0)
class UComputeGraphComponent final : public UActorComponent
{
public:
	class UComputeGraph*                          ComputeGraph;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FComputeGraphInstance                  ComputeGraphInstance;                              // 0x00A8(0x0018)(NativeAccessSpecifierPrivate)

public:
	void CreateDataProviders(int32 InBindingIndex, class UObject* InBindingObject);
	void DestroyDataProviders();
	void QueueExecute();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeGraphComponent">();
	}
	static class UComputeGraphComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeGraphComponent>();
	}
};

// Class ComputeFramework.ComputeKernel
// 0x0010 (0x0038 - 0x0028)
class UComputeKernel final : public UObject
{
public:
	class UComputeKernelSource*                   KernelSource;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KernelFlags;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeKernel">();
	}
	static class UComputeKernel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeKernel>();
	}
};

// Class ComputeFramework.ComputeKernelFromText
// 0x0010 (0x00A8 - 0x0098)
class UComputeKernelFromText final : public UComputeKernelSource
{
public:
	struct FFilePath                              SourceFile;                                        // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeKernelFromText">();
	}
	static class UComputeKernelFromText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeKernelFromText>();
	}
};

// Class ComputeFramework.ComputeSourceFromText
// 0x0010 (0x0048 - 0x0038)
class UComputeSourceFromText final : public UComputeSource
{
public:
	struct FFilePath                              SourceFile;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComputeSourceFromText">();
	}
	static class UComputeSourceFromText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComputeSourceFromText>();
	}
};

}

