#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ConsoleVariablesEditorRuntime

#include "Basic.hpp"

#include "ConsoleVariablesEditorRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.AddOrSetConsoleObjectSavedData
// 0x0028 (0x0028 - 0x0000)
struct ConsoleVariablesAsset_AddOrSetConsoleObjectSavedData final
{
public:
	struct FConsoleVariablesEditorAssetSaveData   InData;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.CopyFrom
// 0x0008 (0x0008 - 0x0000)
struct ConsoleVariablesAsset_CopyFrom final
{
public:
	const class UConsoleVariablesAsset*           InAssetToCopy;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.RemoveConsoleVariable
// 0x0018 (0x0018 - 0x0000)
struct ConsoleVariablesAsset_RemoveConsoleVariable final
{
public:
	class FString                                 InCommandString;                                   // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.ReplaceSavedCommands
// 0x0010 (0x0010 - 0x0000)
struct ConsoleVariablesAsset_ReplaceSavedCommands final
{
public:
	TArray<struct FConsoleVariablesEditorAssetSaveData> Replacement;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.SetVariableCollectionDescription
// 0x0010 (0x0010 - 0x0000)
struct ConsoleVariablesAsset_SetVariableCollectionDescription final
{
public:
	class FString                                 InVariableCollectionDescription;                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.ExecuteSavedCommands
// 0x0010 (0x0010 - 0x0000)
struct ConsoleVariablesAsset_ExecuteSavedCommands final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyIncludeChecked;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.FindSavedDataByCommandString
// 0x0040 (0x0040 - 0x0000)
struct ConsoleVariablesAsset_FindSavedDataByCommandString final
{
public:
	class FString                                 InCommandString;                                   // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConsoleVariablesEditorAssetSaveData   OutValue;                                          // 0x0010(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	ESearchCase                                   SearchCase;                                        // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.GetSavedCommands
// 0x0010 (0x0010 - 0x0000)
struct ConsoleVariablesAsset_GetSavedCommands final
{
public:
	TArray<struct FConsoleVariablesEditorAssetSaveData> ReturnValue;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.GetSavedCommandsAsCommaSeparatedString
// 0x0018 (0x0018 - 0x0000)
struct ConsoleVariablesAsset_GetSavedCommandsAsCommaSeparatedString final
{
public:
	bool                                          bOnlyIncludeChecked;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.GetSavedCommandsAsStringArray
// 0x0018 (0x0018 - 0x0000)
struct ConsoleVariablesAsset_GetSavedCommandsAsStringArray final
{
public:
	bool                                          bOnlyIncludeChecked;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.GetSavedCommandsCount
// 0x0004 (0x0004 - 0x0000)
struct ConsoleVariablesAsset_GetSavedCommandsCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ConsoleVariablesEditorRuntime.ConsoleVariablesAsset.GetVariableCollectionDescription
// 0x0010 (0x0010 - 0x0000)
struct ConsoleVariablesAsset_GetVariableCollectionDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

