#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ContextualAnimation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum ContextualAnimation.EContextualAnimCollisionBehavior
// NumValues: 0x0004
enum class EContextualAnimCollisionBehavior : uint8
{
	None                                     = 0,
	IgnoreActorWhenMoving                    = 1,
	IgnoreChannels                           = 2,
	EContextualAnimCollisionBehavior_MAX     = 3,
};

// Enum ContextualAnimation.EContextualAnimPointType
// NumValues: 0x0004
enum class EContextualAnimPointType : uint8
{
	FirstFrame                               = 0,
	SyncFrame                                = 1,
	LastFrame                                = 2,
	EContextualAnimPointType_MAX             = 3,
};

// Enum ContextualAnimation.EContextualAnimCriterionToConsider
// NumValues: 0x0004
enum class EContextualAnimCriterionToConsider : uint8
{
	All                                      = 0,
	Spatial                                  = 1,
	Other                                    = 2,
	EContextualAnimCriterionToConsider_MAX   = 3,
};

// Enum ContextualAnimation.EContextualAnimActorPreviewType
// NumValues: 0x0005
enum class EContextualAnimActorPreviewType : uint8
{
	SkeletalMesh                             = 0,
	StaticMesh                               = 1,
	Actor                                    = 2,
	None                                     = 3,
	EContextualAnimActorPreviewType_MAX      = 4,
};

// Enum ContextualAnimation.EContextualAnimCriterionType
// NumValues: 0x0003
enum class EContextualAnimCriterionType : uint8
{
	Spatial                                  = 0,
	Other                                    = 1,
	EContextualAnimCriterionType_MAX         = 2,
};

// Enum ContextualAnimation.EContextualAnimCriterionConeMode
// NumValues: 0x0003
enum class EContextualAnimCriterionConeMode : uint8
{
	ToPrimary                                = 0,
	FromPrimary                              = 1,
	EContextualAnimCriterionConeMode_MAX     = 2,
};

// Enum ContextualAnimation.EContextualAnimCriterionDistanceMode
// NumValues: 0x0003
enum class EContextualAnimCriterionDistanceMode : uint8
{
	Distance_3D                              = 0,
	Distance_2D                              = 1,
	Distance_MAX                             = 2,
};

// Enum ContextualAnimation.EContextualAnimJoinRule
// NumValues: 0x0003
enum class EContextualAnimJoinRule : uint8
{
	Default                                  = 0,
	Late                                     = 1,
	EContextualAnimJoinRule_MAX              = 2,
};

// Enum ContextualAnimation.EContextualAnimIKTargetProvider
// NumValues: 0x0003
enum class EContextualAnimIKTargetProvider : uint8
{
	Autogenerated                            = 0,
	Bone                                     = 1,
	EContextualAnimIKTargetProvider_MAX      = 2,
};

// Enum ContextualAnimation.EContextualAnimWarpPointDefinitionMode
// NumValues: 0x0004
enum class EContextualAnimWarpPointDefinitionMode : uint8
{
	PrimaryActor                             = 0,
	Socket                                   = 1,
	Custom                                   = 2,
	EContextualAnimWarpPointDefinitionMode_MAX = 3,
};

// ScriptStruct ContextualAnimation.ContextualAnimWarpTarget
// 0x0040 (0x0040 - 0x0000)
struct FContextualAnimWarpTarget final
{
public:
	class FName                                   Role;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetName;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  TargetRotation;                                    // 0x0020(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimRepData
// 0x0001 (0x0001 - 0x0000)
struct FContextualAnimRepData
{
public:
	uint8                                         RepCounter;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneBindingContext
// 0x00D0 (0x00D0 - 0x0000)
struct alignas(0x10) FContextualAnimSceneBindingContext final
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UContextualAnimSceneActorComponent> CachedSceneActorComp;                   // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAnimInstance>           CachedAnimInstance;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USkeletalMeshComponent>  CachedSkeletalMesh;                                // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0xB0];                                      // 0x0020(0x00B0)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneBinding
// 0x00E0 (0x00E0 - 0x0000)
struct FContextualAnimSceneBinding final
{
public:
	struct FContextualAnimSceneBindingContext     Context;                                           // 0x0000(0x00D0)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	int32                                         AnimTrackIdx;                                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneBindings
// 0x0028 (0x0028 - 0x0000)
struct FContextualAnimSceneBindings final
{
public:
	uint8                                         ID;                                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UContextualAnimSceneAsset*              SceneAsset;                                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SectionIdx;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AnimSetIdx;                                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FContextualAnimSceneBinding>    Data;                                              // 0x0018(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// ScriptStruct ContextualAnimation.ContextualAnimWarpPoint
// 0x0070 (0x0070 - 0x0000)
struct FContextualAnimWarpPoint final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimRepBindingsData
// 0x004F (0x0050 - 0x0001)
struct FContextualAnimRepBindingsData final : public FContextualAnimRepData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FContextualAnimSceneBindings           Bindings;                                          // 0x0008(0x0028)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FContextualAnimWarpPoint>       WarpPoints;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FContextualAnimWarpTarget>      ExternalWarpTargets;                               // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimRepLateJoinData
// 0x0037 (0x0038 - 0x0001)
struct FContextualAnimRepLateJoinData final : public FContextualAnimRepData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Role;                                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FContextualAnimWarpPoint>       WarpPoints;                                        // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FContextualAnimWarpTarget>      ExternalWarpTargets;                               // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimRepTransitionData
// 0x0027 (0x0028 - 0x0001)
struct FContextualAnimRepTransitionData final : public FContextualAnimRepData
{
public:
	uint8                                         ID;                                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SectionIdx;                                        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AnimSetIdx;                                        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FContextualAnimWarpPoint>       WarpPoints;                                        // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FContextualAnimWarpTarget>      ExternalWarpTargets;                               // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimIgnoreChannelsParam
// 0x0018 (0x0018 - 0x0000)
struct FContextualAnimIgnoreChannelsParam final
{
public:
	class FName                                   Role;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<ECollisionChannel>                     Channels;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimAlignmentTrackContainer
// 0x0028 (0x0028 - 0x0000)
struct FContextualAnimAlignmentTrackContainer final
{
public:
	struct FAnimSequenceTrackContainer            Tracks;                                            // 0x0000(0x0020)(NativeAccessSpecifierPublic)
	float                                         SampleInterval;                                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ContextualAnimation.ContextualAnimTrack
// 0x00E0 (0x00E0 - 0x0000)
struct FContextualAnimTrack final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimMaxStartTime;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireFlyingMode;                                // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptional;                                         // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FContextualAnimAlignmentTrackContainer AlignmentData;                                     // 0x0010(0x0028)(NativeAccessSpecifierPublic)
	struct FContextualAnimAlignmentTrackContainer IKTargetData;                                      // 0x0038(0x0028)(NativeAccessSpecifierPublic)
	TArray<class UContextualAnimSelectionCriterion*> SelectionCriteria;                              // 0x0060(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FTransform                             MeshToScene;                                       // 0x0070(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Role;                                              // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIdx;                                        // 0x00D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimSetIdx;                                        // 0x00D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimTrackIdx;                                      // 0x00DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimSet
// 0x0068 (0x0068 - 0x0000)
struct FContextualAnimSet final
{
public:
	TArray<struct FContextualAnimTrack>           Tracks;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<class FName, struct FTransform>          WarpPoints;                                        // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
	float                                         RandomWeight;                                      // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ContextualAnimation.ContextualAnimIKTargetDefinition
// 0x0014 (0x0014 - 0x0000)
struct FContextualAnimIKTargetDefinition final
{
public:
	class FName                                   GoalName;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContextualAnimIKTargetProvider               Provider;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   TargetRoleName;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetBoneName;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimIKTargetDefContainer
// 0x0010 (0x0010 - 0x0000)
struct FContextualAnimIKTargetDefContainer final
{
public:
	TArray<struct FContextualAnimIKTargetDefinition> IKTargetDefs;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimWarpPointCustomParams
// 0x0010 (0x0010 - 0x0000)
struct FContextualAnimWarpPointCustomParams final
{
public:
	class FName                                   Origin;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlongClosestDistance;                             // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   OtherRole;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimWarpPointDefinition
// 0x001C (0x001C - 0x0000)
struct FContextualAnimWarpPointDefinition final
{
public:
	class FName                                   WarpTargetName;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContextualAnimWarpPointDefinitionMode        Mode;                                              // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   SocketName;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FContextualAnimWarpPointCustomParams   Params;                                            // 0x000C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimSceneSection
// 0x0078 (0x0078 - 0x0000)
struct FContextualAnimSceneSection final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FContextualAnimSet>             AnimSets;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FContextualAnimIKTargetDefContainer> RoleToIKTargetDefsMap;             // 0x0018(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FContextualAnimWarpPointDefinition> WarpPointDefinitions;                          // 0x0068(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct ContextualAnimation.ContextualAnimPoint
// 0x0080 (0x0080 - 0x0000)
struct FContextualAnimPoint final
{
public:
	class FName                                   Role;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIdx;                                        // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimSetIdx;                                        // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimTrackIdx;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimActorPreviewData
// 0x0088 (0x0088 - 0x0000)
struct FContextualAnimActorPreviewData final
{
public:
	class FName                                   Role;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContextualAnimActorPreviewType               Type;                                              // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class USkeletalMesh>           PreviewSkeletalMesh;                               // 0x0008(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PreviewAnimInstance;                               // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             PreviewStaticMesh;                                 // 0x0048(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PreviewActorClass;                                 // 0x0068(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimIKTarget
// 0x0070 (0x0070 - 0x0000)
struct FContextualAnimIKTarget final
{
public:
	class FName                                   GoalName;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimRoleDefinition
// 0x0070 (0x0070 - 0x0000)
struct FContextualAnimRoleDefinition final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCharacter;                                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             MeshToComponent;                                   // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualAnimation.ContextualAnimStartSceneParams
// 0x0068 (0x0068 - 0x0000)
struct FContextualAnimStartSceneParams final
{
public:
	TMap<class FName, struct FContextualAnimSceneBindingContext> RoleToActorMap;                     // 0x0000(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         SectionIdx;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimSetIdx;                                        // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ContextualAnimation.ContextualAnimQueryResult
// 0x00E0 (0x00E0 - 0x0000)
struct FContextualAnimQueryResult final
{
public:
	TWeakObjectPtr<class UAnimMontage>            Animation;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             EntryTransform;                                    // 0x0010(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             SyncTransform;                                     // 0x0070(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimStartTime;                                     // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimSetIdx;                                        // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ContextualAnimation.ContextualAnimQueryParams
// 0x0080 (0x0080 - 0x0000)
struct FContextualAnimQueryParams final
{
public:
	TWeakObjectPtr<class AActor>                  Querier;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             QueryTransform;                                    // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bComplexQuery;                                     // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFindAnimStartTime;                                // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0xE];                                       // 0x0072(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

