#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CorruptionGameplayCodeRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MeshNetwork_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum CorruptionGameplayCodeRuntime.EWarEffortFundingStationType
// NumValues: 0x0004
enum class EWarEffortFundingStationType : uint8
{
	Final                                    = 0,
	Tower                                    = 1,
	Choice                                   = 2,
	EWarEffortFundingStationType_MAX         = 3,
};

// ScriptStruct CorruptionGameplayCodeRuntime.WarEffortFundingOptionData
// 0x0010 (0x0010 - 0x0000)
struct FWarEffortFundingOptionData final
{
public:
	struct FGameplayTag                           OptionTag;                                         // 0x0000(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         CurrentFundingAmount;                              // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.WarEffortFundingChoiceData
// 0x0028 (0x0028 - 0x0000)
struct FWarEffortFundingChoiceData final
{
public:
	struct FWarEffortFundingOptionData            Option1;                                           // 0x0000(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWarEffortFundingOptionData            Option2;                                           // 0x0010(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int64                                         TargetFundingAmount;                               // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.WarEffortIndexedFundingData
// 0x0020 (0x0020 - 0x0000)
struct FWarEffortIndexedFundingData final
{
public:
	TArray<int64>                                 CurrentFundingArray;                               // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int64                                         FinalFundingAmount;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         TowerFundingAmount;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.WarEffortFundingMetadata
// 0x0030 (0x0030 - 0x0000)
struct FWarEffortFundingMetadata final : public FMeshMetaDataStruct
{
public:
	struct FWarEffortIndexedFundingData           IndexedFundingData;                                // 0x0000(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FWarEffortFundingChoiceData>    FundingChoices;                                    // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.CubeMovement_CorruptionGenerationSplinePointData
// 0x0070 (0x0070 - 0x0000)
struct FCubeMovement_CorruptionGenerationSplinePointData final
{
public:
	struct FTransform                             SplinePointTransform;                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplinePercentComplete;                             // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CorruptionGameplayCodeRuntime.CubeMovement_CorruptionGenerationTravelerData
// 0x0018 (0x0018 - 0x0000)
struct FCubeMovement_CorruptionGenerationTravelerData final
{
public:
	TArray<struct FCubeMovement_CorruptionGenerationSplinePointData> SplinePointData;                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class AFortScriptedObjectMovement_MovableObjectBase* PathTraveler;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.CubeMovement_CorruptionGenerationData
// 0x0010 (0x0010 - 0x0000)
struct FCubeMovement_CorruptionGenerationData final
{
public:
	TArray<struct FCubeMovement_CorruptionGenerationTravelerData> TravelerData;                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.CorruptionCalendarEventData
// 0x0018 (0x0018 - 0x0000)
struct FCorruptionCalendarEventData final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartPercent;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CorruptionGameplayCodeRuntime.CorruptionPauseEvent
// 0x0018 (0x0018 - 0x0000)
struct FCorruptionPauseEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentDurationToPause;                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CorruptionGameplayCodeRuntime.TravelerStepCorruptionOverrideData
// 0x0050 (0x0050 - 0x0000)
struct FTravelerStepCorruptionOverrideData final
{
public:
	TMap<class FString, float>                    PointGroupStepPercentOverrides;                    // 0x0000(0x0050)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.WarEffortMutatorChoiceData
// 0x0068 (0x0068 - 0x0000)
struct FWarEffortMutatorChoiceData final
{
public:
	struct FGameplayTag                           FundingTag;                                        // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TSoftObjectPtr<class UFortItemDefinition>> SoftRefsToLoad;                                // 0x0008(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, struct FScalableFloat>      LootTableMods;                                     // 0x0018(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.WarEffortMutatorMetadata
// 0x0020 (0x0020 - 0x0000)
struct FWarEffortMutatorMetadata final : public FMeshMetaDataStruct
{
public:
	TArray<struct FGameplayTag>                   ActiveFundedItems;                                 // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   ActiveTryBeforeYouBuyItems;                        // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CorruptionGameplayCodeRuntime.WarEffortFundingData
// 0x0008 (0x0008 - 0x0000)
struct FWarEffortFundingData final
{
public:
	struct FGameplayTag                           FundingTag;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FundedPercent;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

