#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CRD_AudioPlayerRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CRD_AudioPlayerRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnAudioLoadComplete
// 0x0018 (0x0018 - 0x0000)
struct CreativeAudioComponent_OnAudioLoadComplete final
{
public:
	struct FSoftObjectPath                        Audio;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnEnabledStateChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativeAudioComponent_OnEnabledStateChanged final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnMinigameStateChanged
// 0x0010 (0x0010 - 0x0000)
struct CreativeAudioComponent_OnMinigameStateChanged final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMinigameState                            NewMinigameState;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnPlayerAdded
// 0x0038 (0x0038 - 0x0000)
struct CreativeAudioComponent_OnPlayerAdded final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayer;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnPlayerRegistered
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioComponent_OnPlayerRegistered final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnPlayerRemoved
// 0x0038 (0x0038 - 0x0000)
struct CreativeAudioComponent_OnPlayerRemoved final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayer;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnPlayerUnregistered
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioComponent_OnPlayerUnregistered final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.OnProxyDataChanged
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioComponent_OnProxyDataChanged final
{
public:
	class ACreativePlayerReplicationProxy*        ProxyData;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.PlayAudio
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioComponent_PlayAudio final
{
public:
	class AController*                            Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.RetryClientPlayAudio
// 0x0040 (0x0040 - 0x0000)
struct CreativeAudioComponent_RetryClientPlayAudio final
{
public:
	struct FCreativeAudioPlayerData               InstigatorData;                                    // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.RetryUpdateAutoplayStatusOnMinigameAdd
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioComponent_RetryUpdateAutoplayStatusOnMinigameAdd final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.SetProperties
// 0x0058 (0x0058 - 0x0000)
struct CreativeAudioComponent_SetProperties final
{
public:
	TSoftObjectPtr<class USoundBase>              Audio;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackSpeed;                                     // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewFadeInDuration;                                 // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewFadeOutDuration;                                // 0x002C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableVolumeAttenuation;                          // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSpatialization;                             // 0x0031(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StereoSpread;                                      // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttenuationDistanceModel                     DistanceModel;                                     // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         AttenuationMinDistance;                            // 0x003C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationFalloffDistance;                        // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewSyncPlayerAudio;                               // 0x0044(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewRestartAudioOnPlay;                            // 0x0045(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NewCanBeHeardBy;                                   // 0x0048(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewPlayLocation;                                   // 0x004C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewAutoplayOptions;                                // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CRD_AudioPlayerRuntime.CreativeAudioComponent.StopAudio
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioComponent_StopAudio final
{
public:
	class AController*                            Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

