#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CRDPlayerTracker

#include "Basic.hpp"


namespace SDK::Params
{

// Function CRDPlayerTracker.CRDPlayerTrackerMarker.CreatePlayerTrackerWidget
// 0x0018 (0x0018 - 0x0000)
struct CRDPlayerTrackerMarker_CreatePlayerTrackerWidget final
{
public:
	class AFortPlayerControllerGameplay*          InFortPlayerControllerGameplay;                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 AssociatedPSA;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRDPlayerTracker.CRDPlayerTrackerMarker.DestroyPlayerTrackerWidget
// 0x0010 (0x0010 - 0x0000)
struct CRDPlayerTrackerMarker_DestroyPlayerTrackerWidget final
{
public:
	class AFortPlayerControllerGameplay*          InFortPlayerControllerGameplay;                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

