#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CreativeEmporiumUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CreativeEmporiumUI_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.SetIsFilterActive
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_SetIsFilterActive final
{
public:
	bool                                          bInFilterActive;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.UpdateCheckMarkState
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_UpdateCheckMarkState final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.UpdateItemCount
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFilterEntry_UpdateItemCount final
{
public:
	int32                                         ItemCount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.IsFilterActive
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_IsFilterActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.ExcludeItemDetailTag
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_ExcludeItemDetailTag final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryActivated
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryActivated final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryWidgetDestroyed
// 0x0008 (0x0008 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryWidgetDestroyed final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleFilterEnabled
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleFilterEnabled final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleFilterSelected
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleFilterSelected final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UEmporiumBrowserFilterEntry*            Entry;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleSearchTextChanged
// 0x0018 (0x0018 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleSearchTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleShowAllEnabled
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleShowAllEnabled final
{
public:
	bool                                          bShowAllItems;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.IncludeItemDetailTag
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_IncludeItemDetailTag final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnSetSearchText
// 0x0018 (0x0018 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnSetSearchText final
{
public:
	class FText                                   NewSearchText;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnSetSearchVisible
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnSetSearchVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.SetItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_SetItemDetailTags final
{
public:
	TArray<class FName>                           TagIDs;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetFilterCount
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetFilterCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ActivateCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ActivateCategory final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.AddSubcategoryWidget
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_AddSubcategoryWidget final
{
public:
	class UWidget*                                SubcategoryWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.EnableCategoryExpansion
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_EnableCategoryExpansion final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ExpandCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ExpandCategory final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.SetCategoryText
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumFilterCategoryHeader_SetCategoryText final
{
public:
	class FText                                   NewButtonText;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.SetSubcategoryCount
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumFilterCategoryHeader_SetSubcategoryCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.UpdateCategoryCount
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_UpdateCategoryCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideIfEmpty;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.GetCategoryButton
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_GetCategoryButton final
{
public:
	class UCommonButtonBase*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.GetSubcategoryWidgets
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFilterCategoryHeader_GetSubcategoryWidgets final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.UpdateWarningMessage
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_UpdateWarningMessage final
{
public:
	bool                                          bShowMessage;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.GetCardSizeForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_GetCardSizeForCategory final
{
public:
	EFortItemCardSize                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.GetCollapseBorderPadFlagForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_GetCollapseBorderPadFlagForCategory final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeListView.GetFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumHomeListView_GetFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDefinition.GetEmporiumItemData
// 0x00E8 (0x00E8 - 0x0000)
struct FortEmporiumItemDefinition_GetEmporiumItemData final
{
public:
	struct FFortEmporiumItemData                  ReturnValue;                                       // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.HandleItemTagSelected
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemDetailsPanel_HandleItemTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.IsShowingAdditionalButtons
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_IsShowingAdditionalButtons final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetActiveItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetActiveItemDetailTags final
{
public:
	TArray<class FName>                           ActiveTags;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetItemDetails
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetItemDetails final
{
public:
	const class UFortItem*                        FortItem;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLargeThumbnail;                                // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetItemToDetail
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetItemToDetail final
{
public:
	const class UFortItem*                        InItemToDetail;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLargeThumbnail;                                // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetSpecialItemTagVisibility
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetSpecialItemTagVisibility final
{
public:
	class FName                                   SpecialItemTag;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.UpdateItemDetailsDisplay
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_UpdateItemDetailsDisplay final
{
public:
	bool                                          bShowItemDetails;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.BP_GetSpecialItemTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_BP_GetSpecialItemTags final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.HasLegacyItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_HasLegacyItemDetailsPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.IsShowingExtendedDataPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_IsShowingExtendedDataPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.SetSelectItemTagsIcon
// 0x00C0 (0x00C0 - 0x0000)
struct FortEmporiumItemInfo_SetSelectItemTagsIcon final
{
public:
	struct FSlateBrush                            SelectItemTagsIcon;                                // 0x0000(0x00C0)(Parm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.SetSelectItemTagsPrompt
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemInfo_SetSelectItemTagsPrompt final
{
public:
	class FText                                   Prompt;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.ShowSelectItemTagsPrompt
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemInfo_ShowSelectItemTagsPrompt final
{
public:
	bool                                          bShowPrompt;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.UpdateWithFortItem
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemInfo_UpdateWithFortItem final
{
public:
	const class UFortItem*                        Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.AddSelectionToQuickBar
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_AddSelectionToQuickBar final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.DropItem
// 0x01B0 (0x01B0 - 0x0000)
struct FortEmporiumItemListMenu_DropItem final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.EquipItem
// 0x01B0 (0x01B0 - 0x0000)
struct FortEmporiumItemListMenu_EquipItem final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.EquipSelection
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_EquipSelection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleCategoryActivated
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleCategoryActivated final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleCategoryFocused
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleCategoryFocused final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleChestItemCountChanged
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleChestItemCountChanged final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleEquipItem
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_HandleEquipItem final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleFilterButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleFilterButtonClicked final
{
public:
	class FName                                   FilterNameId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonBase*                      NewButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleFilterPanelIsFocused
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleFilterPanelIsFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemClicked
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemClicked final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemDoubleClicked
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemDoubleClicked final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemTagSelected
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemThumbnailDownloaded
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemThumbnailDownloaded final
{
public:
	class UFortEmporiumItemDefinition*            ItemDefinition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleQuickbarPanelIsFocused
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleQuickbarPanelIsFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleQuickbarStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleQuickbarStateChanged final
{
public:
	EFortContentBrowserQuickbarState              State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSelectionChanged
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleSelectionChanged final
{
public:
	class UFortCreativeContentBrowserTabPanelBase* Tab;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSortButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleSortButtonClicked final
{
public:
	class FName                                   SortNameId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonBase*                      NewButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleTabItemDetailClicked
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleTabItemDetailClicked final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleTabSelected
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleTabSelected final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureFocus;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnCursorModeChanged
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_OnCursorModeChanged final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   ActionName;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            CursorModeContentWidget;                           // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnFabCategoryListLoaded
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_OnFabCategoryListLoaded final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 JsonString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnFabItemQueryComplete
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_OnFabItemQueryComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 JsonString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnItemEquipped
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_OnItemEquipped final
{
public:
	struct FFortItemEntry                         EquippedItemEntry;                                 // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnQuickbarStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnQuickbarStateChanged final
{
public:
	EFortContentBrowserQuickbarState              State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnSearchFiltersVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnSearchFiltersVisibilityChanged final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnSelectionOpened
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_OnSelectionOpened final
{
public:
	const class UFortItemDefinition*              SelectedItemDefinition;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnShowCategoryModal
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnShowCategoryModal final
{
public:
	bool                                          bShowModal;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OpenSelection
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OpenSelection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.PlaceSelectionInMoveTool
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_PlaceSelectionInMoveTool final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SetIsItemCommandsEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_SetIsItemCommandsEnabled final
{
public:
	bool                                          bInIsItemCommandEnabled;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SetSubTabOpened
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_SetSubTabOpened final
{
public:
	class UFortItemDefinition*                    ItemDefinition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SpawnContainer
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_SpawnContainer final
{
public:
	TSubclassOf<class AActor>                     SupplyDropClass;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SwitchItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_SwitchItemDetailsPanel final
{
public:
	bool                                          bUseLegacy;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.CanAddToChest
// 0x01B0 (0x01B0 - 0x0000)
struct FortEmporiumItemListMenu_CanAddToChest final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.CanDropItem
// 0x01B0 (0x01B0 - 0x0000)
struct FortEmporiumItemListMenu_CanDropItem final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.CanEquip
// 0x01B0 (0x01B0 - 0x0000)
struct FortEmporiumItemListMenu_CanEquip final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetCurrentSelection
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_GetCurrentSelection final
{
public:
	struct FFortItemEntry                         ReturnValue;                                       // 0x0000(0x01A8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetCurrentTab
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_GetCurrentTab final
{
public:
	class UFortCreativeContentBrowserTabPanelBase* ReturnValue;                                      // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetLastSelectedTabName
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_GetLastSelectedTabName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetSubTabSelectedItemDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_GetSubTabSelectedItemDefinition final
{
public:
	class UFortItemDefinition*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.IsSubTabOpened
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_IsSubTabOpened final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.AddItem
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListTabPanel_AddItem final
{
public:
	struct FFortItemEntry                         ItemToAdd;                                         // 0x0000(0x01A8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.AddItemToSource
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListTabPanel_AddItemToSource final
{
public:
	struct FFortItemEntry                         ItemToAdd;                                         // 0x0000(0x01A8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.HandleItemDetailTagSelected
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListTabPanel_HandleItemDetailTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_IsEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.ItemEquipped
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListTabPanel_ItemEquipped final
{
public:
	struct FFortItemEntry                         Item;                                              // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.SetActiveItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListTabPanel_SetActiveItemDetailTags final
{
public:
	TArray<class FName>                           TagIDs;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.ShowTopButtonBar
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_ShowTopButtonBar final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.UpdateSortButton
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListTabPanel_UpdateSortButton final
{
public:
	class FText                                   SortType;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.CanPlayerCreateInVolume
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_CanPlayerCreateInVolume final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.GetCardSizeForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_GetCardSizeForCategory final
{
public:
	EFortItemCardSize                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.GetCollapseBorderPadFlagForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_GetCollapseBorderPadFlagForCategory final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.GetSubTabSelectedItemDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListTabPanel_GetSubTabSelectedItemDefinition final
{
public:
	class UFortItemDefinition*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.IsSubTabOpened
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_IsSubTabOpened final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.ShowLegacyItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_ShowLegacyItemDetailsPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumUtilities.GetCategoryDisplayName
// 0x0020 (0x0020 - 0x0000)
struct FortEmporiumUtilities_GetCategoryDisplayName final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumUtilities.GetTextFromEmporiumLicense
// 0x0020 (0x0020 - 0x0000)
struct FortEmporiumUtilities_GetTextFromEmporiumLicense final
{
public:
	EFortEmporiumItemLicense                      License;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumUtilities.RequestJSON
// 0x0058 (0x0058 - 0x0000)
struct FortEmporiumUtilities_RequestJSON final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       UniqueNetId;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JSONURL;                                           // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSuccess, const class FString& JsonString)> Callback;                        // 0x0048(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function CreativeEmporiumUI.FortEmporiumUtilities.RequestLicenseText
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumUtilities_RequestLicenseText final
{
public:
	EFortEmporiumItemLicense                      License;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void(bool bSuccess, const class FString& LicenseText)> Callback;                       // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

