#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CreativeLowMemoryFallbackRuntime

#include "Basic.hpp"

#include "CreativeLowMemoryFallbackRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CreativeLowMemoryFallbackRuntime.CreativeLowMemoryFallbackSettings
// 0x0108 (0x0138 - 0x0030)
class UCreativeLowMemoryFallbackSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UObject>                 WarningToastIcon;                                  // 0x0030(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreativeLowMemoryFallbackUserFacingText DefaultText;                                     // 0x0050(0x0048)(Edit, Config, NativeAccessSpecifierPrivate)
	TMap<TSoftObjectPtr<class UFortPlaylist>, struct FCreativeLowMemoryFallbackFreeMemoryThresholds> PlaylistOverrideThresholds; // 0x0098(0x0050)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<TSoftObjectPtr<class UFortPlaylist>, struct FCreativeLowMemoryFallbackUserFacingText> PlaylistOverrideText; // 0x00E8(0x0050)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeLowMemoryFallbackSettings">();
	}
	static class UCreativeLowMemoryFallbackSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeLowMemoryFallbackSettings>();
	}
};

// Class CreativeLowMemoryFallbackRuntime.CreativeLowMemoryFallbackWorldSubsystem
// 0x0038 (0x0068 - 0x0030)
class UCreativeLowMemoryFallbackWorldSubsystem final : public UWorldSubsystem
{
public:
	struct FCreativeLowMemoryFallbackFreeMemoryThresholds CurrentThresholds;                         // 0x0030(0x000C)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x2C];                                      // 0x003C(0x002C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnPlaylistDataChanged(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeLowMemoryFallbackWorldSubsystem">();
	}
	static class UCreativeLowMemoryFallbackWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeLowMemoryFallbackWorldSubsystem>();
	}
};

}

