#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CrewUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum CrewUI.EBattlePassCrewContentState
// NumValues: 0x0004
enum class EBattlePassCrewContentState : uint8
{
	BattlePass                               = 0,
	Crew                                     = 1,
	CrewSubscribed                           = 2,
	EBattlePassCrewContentState_MAX          = 3,
};

// Enum CrewUI.EFortProgressiveContentInterfaceCloseReason
// NumValues: 0x0003
enum class EFortProgressiveContentInterfaceCloseReason : uint8
{
	Normal                                   = 0,
	SubscriptionPurchased                    = 1,
	EFortProgressiveContentInterfaceCloseReason_MAX = 2,
};

// Enum CrewUI.EFortProgressiveContentType
// NumValues: 0x0003
enum class EFortProgressiveContentType : uint8
{
	ProgressiveTableOfContentsScreen         = 0,
	ProgressiveItemScreen                    = 1,
	EFortProgressiveContentType_MAX          = 2,
};

// Enum CrewUI.EBattlePassPurchaseButtonCurrencyType
// NumValues: 0x0004
enum class EBattlePassPurchaseButtonCurrencyType : uint8
{
	None                                     = 0,
	Mtx                                      = 1,
	RealMoney                                = 2,
	EBattlePassPurchaseButtonCurrencyType_MAX = 3,
};

// Enum CrewUI.EBattlePassPurchaseState
// NumValues: 0x0003
enum class EBattlePassPurchaseState : uint8
{
	Purchase                                 = 0,
	Confirm                                  = 1,
	EBattlePassPurchaseState_MAX             = 2,
};

// Enum CrewUI.ECrewPurchaseButtonState
// NumValues: 0x0004
enum class ECrewPurchaseButtonState : uint8
{
	None                                     = 0,
	Purchase                                 = 1,
	Rejoin                                   = 2,
	ECrewPurchaseButtonState_MAX             = 3,
};

// ScriptStruct CrewUI.CrewSubscriptionContentTabData
// 0x0020 (0x0020 - 0x0000)
struct FCrewSubscriptionContentTabData final
{
public:
	class FText                                   TabName;                                           // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	ESubscriptionContentTab                       TabType;                                           // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CrewUI.FortProgressiveReward
// 0x0058 (0x0058 - 0x0000)
struct FFortProgressiveReward final
{
public:
	TArray<struct FCosmeticVariantInfo>           DefaultVariantPreviewOverrides;                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      TileMaterial;                                      // 0x0010(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHidden;                                           // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPreviewStyles;                               // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UFortItemDefinition>     RewardDef;                                         // 0x0038(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct CrewUI.FortProgressiveStageOverrideDisplayData
// 0x0050 (0x0050 - 0x0000)
struct FFortProgressiveStageOverrideDisplayData final
{
public:
	TArray<struct FCosmeticVariantInfo>           DefaultVariantPreviewOverrides;                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0010(0x0018)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      TileMaterial;                                      // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPreviewStyles;                               // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CrewUI.FortProgressiveUIStage
// 0x0068 (0x0068 - 0x0000)
struct FFortProgressiveUIStage final
{
public:
	TArray<struct FFortProgressiveReward>         Rewards;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseOverrideDisplayData;                           // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortProgressiveStageOverrideDisplayData OverrideDisplayData;                             // 0x0018(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct CrewUI.FortProgressiveSet
// 0x0058 (0x0058 - 0x0000)
struct FFortProgressiveSet final
{
public:
	class FString                                 FulfillmentId;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   SetName;                                           // 0x0010(0x0018)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      TileMaterial;                                      // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortProgressiveUIStage>        Stages;                                            // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CrewUI.FortProgressiveSetRewardData
// 0x0018 (0x0018 - 0x0000)
struct FFortProgressiveSetRewardData final
{
public:
	class UFortItemDefinition*                    RewardToken;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

