#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DanceVolume

#include "Basic.hpp"

#include "DanceVolume_structs.hpp"


namespace SDK::Params
{

// Function DanceVolume.DanceSynchronizerComponent.CalculateDanceMontagePlayRate
// 0x0020 (0x0020 - 0x0000)
struct DanceSynchronizerComponent_CalculateDanceMontagePlayRate final
{
public:
	float                                         CurrentTempo;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	const class UAnimMontage*                     Montage;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDanceBeatInfo                         DanceBeatInfo;                                     // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DanceVolume.DanceSynchronizerComponent.GetOwnerFortPlayerPawn
// 0x0008 (0x0008 - 0x0000)
struct DanceSynchronizerComponent_GetOwnerFortPlayerPawn final
{
public:
	class AFortPlayerPawn*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DanceVolume.DanceSynchronizerComponent.GetOwnerSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct DanceSynchronizerComponent_GetOwnerSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DanceVolume.DanceSynchronizerComponent.IsTempoSyncEnabled
// 0x0001 (0x0001 - 0x0000)
struct DanceSynchronizerComponent_IsTempoSyncEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DanceVolume.DanceSynchronizerComponent.SetBeatSyncMode
// 0x0001 (0x0001 - 0x0000)
struct DanceSynchronizerComponent_SetBeatSyncMode final
{
public:
	EDanceBeatSyncMode                            NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DanceVolume.DanceSynchronizerComponent.SetDanceBeatInfo
// 0x0008 (0x0008 - 0x0000)
struct DanceSynchronizerComponent_SetDanceBeatInfo final
{
public:
	struct FDanceBeatInfo                         NewDanceBeatInfo;                                  // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DanceVolume.DanceSynchronizerComponent.SetTempo
// 0x0004 (0x0004 - 0x0000)
struct DanceSynchronizerComponent_SetTempo final
{
public:
	float                                         NewTempo;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DanceVolume.DanceVolumeLibrary.ForceStopMontage
// 0x0008 (0x0008 - 0x0000)
struct DanceVolumeLibrary_ForceStopMontage final
{
public:
	const class AFortPawn*                        FortPawn;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DanceVolume.DanceVolumeLibrary.GetLastEmoteExecuted
// 0x0010 (0x0010 - 0x0000)
struct DanceVolumeLibrary_GetLastEmoteExecuted final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

