#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DataDrivenGameplayEventRouter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayEventRouter_structs.hpp"


namespace SDK
{

// Enum DataDrivenGameplayEventRouter.EGameplayEventNetPolicy
// NumValues: 0x0003
enum class EGameplayEventNetPolicy : uint8
{
	ServerOnly                               = 0,
	ClientOrServer                           = 1,
	EGameplayEventNetPolicy_MAX              = 2,
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventDefinition
// 0x0010 (0x0010 - 0x0000)
struct FGameplayEventDefinition final
{
public:
	class UScriptStruct*                          EventType;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStateful;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEventNetPolicy                       NetPolicy;                                         // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventDescriptor
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FGameplayEventDescriptor final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventSubscription
// 0x0070 (0x0070 - 0x0000)
struct FGameplayEventSubscription final
{
public:
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0000(0x0020)(Edit, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMemberReference                       EventDescriptor;                                   // 0x0020(0x0030)(Edit, SaveGame, NativeAccessSpecifierPublic)
	struct FGameplayEventListenerHandle           EventHandle;                                       // 0x0050(0x001C)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventHandlerFunction
// 0x0080 (0x0080 - 0x0000)
struct FGameplayEventHandlerFunction final
{
public:
	struct FMemberReference                       EventHandlerFunction;                              // 0x0000(0x0030)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              EventHandlerFunctionDefaultValues;                 // 0x0030(0x0050)(NativeAccessSpecifierPublic)
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventHandlerFunctions
// 0x0180 (0x0180 - 0x0000)
struct FGameplayEventHandlerFunctions final
{
public:
	struct FGameplayEventHandlerFunction          OnEventReceived;                                   // 0x0000(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayEventHandlerFunction          OnStatefulEventApplied;                            // 0x0080(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayEventHandlerFunction          OnStatefulEventCleared;                            // 0x0100(0x0080)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventFunction
// 0x0018 (0x0018 - 0x0000)
struct FGameplayEventFunction final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FGameplayEventSubscription>     EventSubscriptions;                                // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, SaveGame, NativeAccessSpecifierPublic)
};

}

