#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DataflowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct DataflowCore.DataflowConnection
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FDataflowConnection
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowInput
// 0x0008 (0x0040 - 0x0038)
struct FDataflowInput final : public FDataflowConnection
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowOutput
// 0x0028 (0x0060 - 0x0038)
struct FDataflowOutput final : public FDataflowConnection
{
public:
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowNode
// 0x00E8 (0x00E8 - 0x0000)
struct alignas(0x08) FDataflowNode
{
public:
	uint8                                         Pad_0[0xC8];                                       // 0x0000(0x00C8)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bActive;                                           // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x1F];                                      // 0x00C9(0x001F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowOverrideNode
// 0x0020 (0x0108 - 0x00E8)
struct FDataflowOverrideNode final : public FDataflowNode
{
public:
	class FName                                   Key;                                               // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Default;                                           // 0x00F0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverriden;                                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowSelection
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FDataflowSelection
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowTransformSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowTransformSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowVertexSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowVertexSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowFaceSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowFaceSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.NodeColors
// 0x0020 (0x0020 - 0x0000)
struct FNodeColors final
{
public:
	struct FLinearColor                           NodeTitleColor;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeBodyTintColor;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowTerminalNode
// 0x0000 (0x00E8 - 0x00E8)
struct FDataflowTerminalNode final : public FDataflowNode
{
};

}

