#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DaySequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DaySequence.EDayNightCycleMode
// NumValues: 0x0006
enum class EDayNightCycleMode : uint8
{
	Default                                  = 0,
	FixedTime                                = 1,
	StartAtSpecifiedTime                     = 2,
	RandomFixedTime                          = 3,
	RandomStartTime                          = 4,
	EDayNightCycleMode_MAX                   = 5,
};

// Enum DaySequence.EDaySequenceModifierBlendMode
// NumValues: 0x0003
enum class EDaySequenceModifierBlendMode : uint8
{
	None                                     = 0,
	Distance                                 = 1,
	EDaySequenceModifierBlendMode_MAX        = 2,
};

// ScriptStruct DaySequence.DaySequenceModifierNamedSequence
// 0x0010 (0x0010 - 0x0000)
struct FDaySequenceModifierNamedSequence final
{
public:
	class UDaySequence*                           Sequence;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BiasOffset;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DaySequence.DaySequenceAssetData
// 0x0010 (0x0010 - 0x0000)
struct FDaySequenceAssetData final
{
public:
	class UDaySequence*                           Sequence;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bias;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMuted;                                            // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DaySequence.DaySequenceBindingReference
// 0x0030 (0x0030 - 0x0000)
struct FDaySequenceBindingReference final
{
public:
	TSoftObjectPtr<class UObject>                 ExternalObjectPath;                                // 0x0000(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ObjectPath;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct DaySequence.DaySequenceBindingReferenceArray
// 0x0010 (0x0010 - 0x0000)
struct FDaySequenceBindingReferenceArray final
{
public:
	TArray<struct FDaySequenceBindingReference>   References;                                        // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DaySequence.DaySequenceBindingReferences
// 0x00A0 (0x00A0 - 0x0000)
struct FDaySequenceBindingReferences final
{
public:
	TMap<struct FGuid, struct FDaySequenceBindingReferenceArray> BindingIdToReferences;              // 0x0000(0x0050)(NativeAccessSpecifierPrivate)
	TSet<struct FGuid>                            AnimSequenceInstances;                             // 0x0050(0x0050)(NativeAccessSpecifierPrivate)
};

}

