#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "DelMarTrackRuntime_classes.hpp"
#include "DelMarCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_classes.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "AudioGameplay_classes.hpp"
#include "VehicleAudioRuntime_classes.hpp"
#include "LinkId_structs.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class DelMarCore.DelMarAIController
// 0x0050 (0x0408 - 0x03B8)
class ADelMarAIController final : public AAIController
{
public:
	uint8                                         Pad_3B8[0x18];                                     // 0x03B8(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MaxMissedCountdownIntervals;                       // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDelMarInvertSteerMethod                      BotSteerMethod;                                    // 0x03D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UBehaviorTree*                          BTAssetToRunOnPawnAISpawned;                       // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          DelMarVehicle;                                     // 0x03E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DelMarBotControllerUID;                            // 0x03E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 DelMarBotPlayerName;                               // 0x03F0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleGroundedStateChanged(const TScriptInterface<class IDelMarVehicleInterface>& VehicleRef, bool bValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAIController">();
	}
	static class ADelMarAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarAIController>();
	}
};

// Class DelMarCore.DelMarAudioTakeRecorderExtension
// 0x0008 (0x00A8 - 0x00A0)
class UDelMarAudioTakeRecorderExtension final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioTakeRecorderExtension">();
	}
	static class UDelMarAudioTakeRecorderExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioTakeRecorderExtension>();
	}
};

// Class DelMarCore.DelMarCoreOobTubePositionalRenderingComponent
// 0x0000 (0x00B8 - 0x00B8)
class UDelMarCoreOobTubePositionalRenderingComponent final : public UDelMarTrackOobTubePositionalRenderingComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCoreOobTubePositionalRenderingComponent">();
	}
	static class UDelMarCoreOobTubePositionalRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCoreOobTubePositionalRenderingComponent>();
	}
};

// Class DelMarCore.DelMarEliminationConfig
// 0x0010 (0x0038 - 0x0028)
class UDelMarEliminationConfig final : public UObject
{
public:
	TArray<struct FDelMarEliminationInfo>         Eliminations;                                      // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEliminationConfig">();
	}
	static class UDelMarEliminationConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEliminationConfig>();
	}
};

// Class DelMarCore.DelMarEvent_FinalFirstPlaceChanged
// 0x0010 (0x0038 - 0x0028)
class UDelMarEvent_FinalFirstPlaceChanged final : public UObject
{
public:
	TWeakObjectPtr<class AFortPlayerState>        NewFirstPlace;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortPlayerState>        PrevFirstPlace;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_FinalFirstPlaceChanged">();
	}
	static class UDelMarEvent_FinalFirstPlaceChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_FinalFirstPlaceChanged>();
	}
};

// Class DelMarCore.DelMarEvent_GlobalLeaderboardActive
// 0x0020 (0x0048 - 0x0028)
class UDelMarEvent_GlobalLeaderboardActive final : public UObject
{
public:
	class FString                                 LeaderboardEventId;                                // 0x0028(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaderboardWindowId;                               // 0x0038(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_GlobalLeaderboardActive">();
	}
	static class UDelMarEvent_GlobalLeaderboardActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_GlobalLeaderboardActive>();
	}
};

// Class DelMarCore.DelMarEvent_GlobalLeaderboardFocusedLeaderboardEntriesPopulated
// 0x0000 (0x0028 - 0x0028)
class UDelMarEvent_GlobalLeaderboardFocusedLeaderboardEntriesPopulated final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_GlobalLeaderboardFocusedLeaderboardEntriesPopulated">();
	}
	static class UDelMarEvent_GlobalLeaderboardFocusedLeaderboardEntriesPopulated* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_GlobalLeaderboardFocusedLeaderboardEntriesPopulated>();
	}
};

// Class DelMarCore.DelMarEvent_GlobalLeaderboardTopLeaderboardEntriesPopulated
// 0x0000 (0x0028 - 0x0028)
class UDelMarEvent_GlobalLeaderboardTopLeaderboardEntriesPopulated final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_GlobalLeaderboardTopLeaderboardEntriesPopulated">();
	}
	static class UDelMarEvent_GlobalLeaderboardTopLeaderboardEntriesPopulated* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_GlobalLeaderboardTopLeaderboardEntriesPopulated>();
	}
};

// Class DelMarCore.DelMarEvent_GlobalLeaderboardPersonalBestRetrieved
// 0x0040 (0x0068 - 0x0028)
class UDelMarEvent_GlobalLeaderboardPersonalBestRetrieved final : public UObject
{
public:
	struct FDelMarGlobalLeaderboardEntry          PersonalBest;                                      // 0x0028(0x0040)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_GlobalLeaderboardPersonalBestRetrieved">();
	}
	static class UDelMarEvent_GlobalLeaderboardPersonalBestRetrieved* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_GlobalLeaderboardPersonalBestRetrieved>();
	}
};

// Class DelMarCore.DelMarGameplayState
// 0x0008 (0x0080 - 0x0078)
class UDelMarGameplayState : public UGameplayState
{
public:
	TWeakObjectPtr<class UDelMarStateMachine>     CachedOwner;                                       // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarGameplayState">();
	}
	static class UDelMarGameplayState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarGameplayState>();
	}
};

// Class DelMarCore.DelMarInputModifierPitchInversion
// 0x0000 (0x0028 - 0x0028)
class UDelMarInputModifierPitchInversion final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputModifierPitchInversion">();
	}
	static class UDelMarInputModifierPitchInversion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputModifierPitchInversion>();
	}
};

// Class DelMarCore.DelMarLevelDataAsset
// 0x0080 (0x00B0 - 0x0030)
class UDelMarLevelDataAsset final : public UPrimaryDataAsset
{
public:
	class FText                                   DisplayName;                                       // 0x0030(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   LevelDescription;                                  // 0x0048(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              LevelBackgroundImage;                              // 0x0060(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UWorld>>          Levels;                                            // 0x0080(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  LevelDescriptionTags;                              // 0x0090(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarLevelDataAsset">();
	}
	static class UDelMarLevelDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarLevelDataAsset>();
	}
};

// Class DelMarCore.DelMarNetModelSubsystem
// 0x0008 (0x0038 - 0x0030)
class UDelMarNetModelSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarNetModelSubsystem">();
	}
	static class UDelMarNetModelSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarNetModelSubsystem>();
	}
};

// Class DelMarCore.DelMarPhysMatAttribute
// 0x0000 (0x0028 - 0x0028)
class UDelMarPhysMatAttribute : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPhysMatAttribute">();
	}
	static class UDelMarPhysMatAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPhysMatAttribute>();
	}
};

// Class DelMarCore.DelMarPhysMatAttribute_Terrain
// 0x0020 (0x0048 - 0x0028)
class UDelMarPhysMatAttribute_Terrain final : public UDelMarPhysMatAttribute
{
public:
	struct FDelMarTerrainData                     TerrainData;                                       // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDriveableSurface;                                 // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPhysMatAttribute_Terrain">();
	}
	static class UDelMarPhysMatAttribute_Terrain* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPhysMatAttribute_Terrain>();
	}
};

// Class DelMarCore.DelMarPlayerStateComponent
// 0x0000 (0x00A0 - 0x00A0)
class UDelMarPlayerStateComponent : public UPlayerStateComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerStateComponent">();
	}
	static class UDelMarPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerStateComponent>();
	}
};

// Class DelMarCore.DelMarPlayerActiveRaceManagerComponent
// 0x0020 (0x00C0 - 0x00A0)
class UDelMarPlayerActiveRaceManagerComponent final : public UDelMarPlayerStateComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class ADelMarRaceManager*                     ActiveRaceManager;                                 // 0x00B8(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_ActiveRaceManager(class ADelMarRaceManager* PreviousRaceManager);
	void SetActiveRaceManager(class ADelMarRaceManager* RaceManager);

	class ADelMarRaceManager* GetActiveRaceManager() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerActiveRaceManagerComponent">();
	}
	static class UDelMarPlayerActiveRaceManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerActiveRaceManagerComponent>();
	}
};

// Class DelMarCore.DelMarPlayerIdleComponent
// 0x0018 (0x00B8 - 0x00A0)
class UDelMarPlayerIdleComponent final : public UDelMarPlayerStateComponent
{
public:
	TWeakObjectPtr<class ADelMarRaceManager>      CachedRaceManager;                                 // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          CachedDelMarVehicle;                               // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerIdleComponent">();
	}
	static class UDelMarPlayerIdleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerIdleComponent>();
	}
};

// Class DelMarCore.DelMarPlayerStart
// 0x0008 (0x0308 - 0x0300)
class ADelMarPlayerStart final : public AFortPlayerStart
{
public:
	int32                                         StartlinePriority;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IsClaimedZDistanceCheck;                           // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerStart">();
	}
	static class ADelMarPlayerStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarPlayerStart>();
	}
};

// Class DelMarCore.DelMarPlayerWrongwayComponent
// 0x0028 (0x00C8 - 0x00A0)
class UDelMarPlayerWrongwayComponent final : public UDelMarPlayerStateComponent
{
public:
	TWeakObjectPtr<class ADelMarVehicle>          CachedDelMarVehicle;                               // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      CachedRaceManager;                                 // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackPositionComponent> CachedTrackPositionComp;                     // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerWrongwayComponent">();
	}
	static class UDelMarPlayerWrongwayComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerWrongwayComponent>();
	}
};

// Class DelMarCore.DelMarRaceLevelConfig
// 0x0068 (0x0C30 - 0x0BC8)
class ADelMarRaceLevelConfig final : public AFortCreativeDeviceProp
{
public:
	EDelMarRaceMode                               RaceMode;                                          // 0x0BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC9[0x3];                                      // 0x0BC9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         DefaultNumRequiredLaps;                            // 0x0BCC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZKillOffsetDistanceFromLowestSplinePoint;          // 0x0BD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchTimeLimitSeconds;                             // 0x0BD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseParallelCheckpoints;                           // 0x0BD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRunAsADelMarExperience;                     // 0x0BD9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BDA[0x6];                                      // 0x0BDA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<EDelMarRaceMode, TSubclassOf<class ADelMarRaceManager>> RaceManagerClassMap;                // 0x0BE0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	class ADelMarRaceManager* SpawnRaceManager(bool bFireInitializationEvent);

	TSubclassOf<class ADelMarRaceManager> GetRaceManagerClass() const;
	struct FGameplayTag GetRaceModeTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceLevelConfig">();
	}
	static class ADelMarRaceLevelConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarRaceLevelConfig>();
	}
};

// Class DelMarCore.DelMarRaceManagerComponent
// 0x0000 (0x00A0 - 0x00A0)
class UDelMarRaceManagerComponent : public UGameFrameworkComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceManagerComponent">();
	}
	static class UDelMarRaceManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRaceManagerComponent>();
	}
};

// Class DelMarCore.DelMarRaceManagerVerbComponent
// 0x0010 (0x00B0 - 0x00A0)
class UDelMarRaceManagerVerbComponent final : public UDelMarRaceManagerComponent
{
public:
	TWeakObjectPtr<class ADelMarRaceManager>      CachedRaceManager;                                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarPositionalTrackerComponent> PositionalTracker;                       // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleFinalRacePositionsUpdated(const TArray<struct FDelMarFinalRacePositionEntry>& FinalRacePositions);
	void HandlePlayerLapCompleted(const struct FDelMarEvent_LapComplete& LapCompleteEvent);
	void HandlePlayerRunRecorded(const struct FDelMarEvent_RunRecorded& Event);
	void HandleRaceFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceManagerVerbComponent">();
	}
	static class UDelMarRaceManagerVerbComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRaceManagerVerbComponent>();
	}
};

// Class DelMarCore.DelMarRacerState
// 0x0018 (0x0040 - 0x0028)
class UDelMarRacerState : public UObject
{
public:
	class UDelMarRacerStateMachineComponent*      StateMachine;                                      // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerState>        PlayerState;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      RaceManager;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState">();
	}
	static class UDelMarRacerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState>();
	}
};

// Class DelMarCore.DelMarRacerState_WithSpectatorTransitionBase
// 0x0000 (0x0040 - 0x0040)
class UDelMarRacerState_WithSpectatorTransitionBase : public UDelMarRacerState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState_WithSpectatorTransitionBase">();
	}
	static class UDelMarRacerState_WithSpectatorTransitionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState_WithSpectatorTransitionBase>();
	}
};

// Class DelMarCore.DelMarRacerState_Spectator
// 0x0000 (0x0040 - 0x0040)
class UDelMarRacerState_Spectator final : public UDelMarRacerState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState_Spectator">();
	}
	static class UDelMarRacerState_Spectator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState_Spectator>();
	}
};

// Class DelMarCore.DelMarRacerState_Countdown
// 0x0008 (0x0048 - 0x0040)
class UDelMarRacerState_Countdown final : public UDelMarRacerState
{
public:
	TWeakObjectPtr<class ADelMarVehicle>          Vehicle;                                           // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState_Countdown">();
	}
	static class UDelMarRacerState_Countdown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState_Countdown>();
	}
};

// Class DelMarCore.DelMarRacerState_RunFinished
// 0x0008 (0x0048 - 0x0040)
class UDelMarRacerState_RunFinished final : public UDelMarRacerState_WithSpectatorTransitionBase
{
public:
	TWeakObjectPtr<class ADelMarVehicle>          Vehicle;                                           // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState_RunFinished">();
	}
	static class UDelMarRacerState_RunFinished* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState_RunFinished>();
	}
};

// Class DelMarCore.DelMarRacerStateMachineComponent
// 0x0078 (0x0118 - 0x00A0)
class UDelMarRacerStateMachineComponent final : public UDelMarPlayerStateComponent
{
public:
	TMap<struct FGameplayTag, TSubclassOf<class UDelMarRacerState>> StateMap;                        // 0x00A0(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           InitialState;                                      // 0x00F0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerState>        PlayerState;                                       // 0x00F4(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      RaceManager;                                       // 0x00FC(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CurrentState;                                      // 0x0104(0x0004)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PreviousState;                                     // 0x0108(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UDelMarRacerState*                      CurrentStateInstance;                              // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_CurrentState(const struct FGameplayTag& PrevState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerStateMachineComponent">();
	}
	static class UDelMarRacerStateMachineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerStateMachineComponent>();
	}
};

// Class DelMarCore.DelMarStartLineActor
// 0x0008 (0x0298 - 0x0290)
class ADelMarStartLineActor final : public AActor
{
public:
	class ADelMarCheckpoint*                      Checkpoint;                                        // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarStartLineActor">();
	}
	static class ADelMarStartLineActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarStartLineActor>();
	}
};

// Class DelMarCore.DelMarTimeManagerComponent
// 0x0058 (0x00F8 - 0x00A0)
class UDelMarTimeManagerComponent final : public UDelMarRaceManagerComponent
{
public:
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerCountdownStarted;    // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        ServerRaceStartTime;                               // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        ServerRaceFinishTime;                              // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        ServerCountdownIntervalTime;                       // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarRaceConfigComponent> RaceConfig;                                     // 0x00C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceLevelConfig>  RaceLevelConfig;                                   // 0x00D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      CachedRaceManager;                                 // 0x00D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x18];                                      // 0x00E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ConfigureRaceStart(const class AGameStateBase* GameState);
	void OnRep_RaceStartTimeUpdated();
	void StartCountdownForPlayer(class AFortPlayerState* PlayerState, double ServerCountdownStartTime, double ServerRunStartTime);
	void StartCountdownForRace(double ServerCountdownStartTime, double ServerRunStartTime, double InServerCountdownIntervalTime);

	float GetRaceTimeRemaining() const;
	float GetSecondsRemainingTillRaceStart() const;
	float GetSecondsSinceRaceStart() const;
	float GetServerCountdownIntervalTime() const;
	float GetServerRaceFinishTime() const;
	float GetServerRaceStartTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTimeManagerComponent">();
	}
	static class UDelMarTimeManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTimeManagerComponent>();
	}
};

// Class DelMarCore.DelMarTutorialConfigComponent
// 0x0010 (0x00B0 - 0x00A0)
class UDelMarTutorialConfigComponent final : public UActorComponent
{
public:
	TArray<struct FDelMarTutorialSection>         Sections;                                          // 0x00A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTutorialConfigComponent">();
	}
	static class UDelMarTutorialConfigComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTutorialConfigComponent>();
	}
};

// Class DelMarCore.DelMarRaceManager
// 0x0210 (0x04A0 - 0x0290)
class ADelMarRaceManager : public AActor
{
public:
	uint8                                         Pad_290[0x90];                                     // 0x0290(0x0090)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnRaceFinished;                                    // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceStarted;                                     // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceCountdownStarted;                            // 0x0340(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceReset;                                       // 0x0350(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerFinishedRace;        // 0x0360(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerLapComplete;         // 0x0370(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerResetRun;            // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bRaceStarted;                                      // 0x0390(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRaceFinished;                                     // 0x0391(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AFortPlayerState*>               SpectatorPlayerStates;                             // 0x0398(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AFortPlayerState*>               ActiveRacerPlayerStates;                           // 0x03A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UDelMarRaceConfigComponent*             RaceConfig;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceLevelConfig>  ActiveRaceLevelConfig;                             // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTimeManagerComponent*            TimeManager;                                       // 0x03C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarRespawnManagerComponent*         RespawnManager;                                    // 0x03D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarCheckpointManagerComponent*      CheckpointManager;                                 // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarRubberbandingManagerComponent*   RubberbandingManager;                              // 0x03E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarPositionalTrackerComponent*      PositionalTracker;                                 // 0x03E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarEliminationRaceManagerComponent* EliminationManager;                                // 0x03F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarGlobalInputDisabler*             InputDisablerComponent;                            // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class AFortPlayerState*>                 ManagedPlayerStates;                               // 0x0400(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class AFortPlayerState>>  InactivePlayerStates;                              // 0x0450(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void FinalizeRegisteredPlayerInitialization(class AFortPlayerState* PlayerState);
	void FinishRace();
	void HandleRegisteredPlayerPawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void NetMulticast_FinishRace(double RaceFinishedTime);
	void NetMulticast_ResetRace(bool bNextRound);
	void NetMulticast_ResetRun(const class AFortPlayerState* InPlayerState, bool bPlayerTriggered);
	void OnRep_ActiveRaceLevelConfig();
	void RegisterPlayerController(class AController* InController);
	void RegisterPlayerState(class AFortPlayerState* InPlayerState);
	void RequestStartRace(bool bSkipCountdown);
	void ResetRace(bool bIsRoundReset);
	void ResetRun(class AFortPlayerState* PlayerState, bool bPlayerTriggered);
	void SetActiveRaceLevelConfig(class ADelMarRaceLevelConfig* InRaceLevelConfig);
	void SetPlayerAsSpectator(class AFortPlayerState* PlayerState);
	void SetSpectatorAsPlayer(class AFortPlayerState* PlayerState);
	void UnregisterAllPlayers(bool bSetAsInactive);
	void UnregisterPlayerController(class AController* InController, bool bSetAsInactive);
	void UnregisterPlayerState(class AFortPlayerState* InPlayerState, bool bSetAsInactive);

	class ADelMarRaceLevelConfig* GetActiveRaceLevelConfig() const;
	TArray<class AFortPlayerState*> GetActiveRacers() const;
	EDelMarRaceMode GetCurrentRaceMode() const;
	EDelMarRaceSpawnMode GetCurrentSpawnMode() const;
	class UDelMarEliminationRaceManagerComponent* GetEliminationManagerComponent() const;
	TArray<class AFortPlayerState*> GetManagedPlayerStatesArray() const;
	int32 GetNumberOfLapsForRace() const;
	int32 GetNumInactiveRacers() const;
	class UDelMarPositionalTrackerComponent* GetPositionalTracker() const;
	class UDelMarRaceConfigComponent* GetRaceConfig() const;
	class UDelMarRespawnManagerComponent* GetRespawnManagerComponent() const;
	class UDelMarRubberbandingManagerComponent* GetRubberbandingManager() const;
	TArray<class AFortPlayerState*> GetSpectators() const;
	class UDelMarTimeManagerComponent* GetTimeManager() const;
	bool IsActiveRacer(const class AFortPlayerState* PlayerState) const;
	bool IsSpectator(const class AFortPlayerState* PlayerState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceManager">();
	}
	static class ADelMarRaceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarRaceManager>();
	}
};

// Class DelMarCore.DelMarTutorialRaceManager
// 0x0008 (0x04A8 - 0x04A0)
class ADelMarTutorialRaceManager final : public ADelMarRaceManager
{
public:
	class UDelMarTutorialConfigComponent*         TutorialConfigComponent;                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void NetMulticast_TutorialSectionChanged(const class AFortPlayerState* PlayerState, const int32 SectionIndex, const int32 PrevSectionIndex);
	void RequestNextTutorialSection(class AFortPlayerState* PlayerState);
	void RequestPrevTutorialSection(class AFortPlayerState* PlayerState);
	void SetCurrentTutorialSection(const int32 SectionIndex, class AFortPlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTutorialRaceManager">();
	}
	static class ADelMarTutorialRaceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTutorialRaceManager>();
	}
};

// Class DelMarCore.DelMarUIInputControllerComponent
// 0x00A0 (0x0140 - 0x00A0)
class UDelMarUIInputControllerComponent final : public UControllerComponent
{
public:
	uint8                                         Pad_A0[0x68];                                      // 0x00A0(0x0068)(Fixing Size After Last Property [ Dumper-8 ])
	class UInputAction*                           HudWidgetExpandAction;                             // 0x0108(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           ToggleQuestListAction;                             // 0x0110(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UDelMarPlayerInputManagerComponent> InputManagerClass;                         // 0x0118(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UEnhancedInputComponent> InputComponent;                                    // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerState>        PlayerState;                                       // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerController>   PlayerController;                                  // 0x0130(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarPlayerPreferencesComponent> PlayerPreferences;                       // 0x0138(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleHudWidgetExpandCompleted();
	void HandleHudWidgetExpandTriggered();
	void HandleToggleQuestList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarUIInputControllerComponent">();
	}
	static class UDelMarUIInputControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarUIInputControllerComponent>();
	}
};

// Class DelMarCore.DelMarVehicleBodySetup
// 0x0058 (0x0088 - 0x0030)
class UDelMarVehicleBodySetup final : public UDataAsset
{
public:
	struct FDelMarVehicleAxleConfig               FrontAxle;                                         // 0x0030(0x002C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleAxleConfig               BackAxle;                                          // 0x005C(0x002C)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarVehicleBodySetup">();
	}
	static class UDelMarVehicleBodySetup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarVehicleBodySetup>();
	}
};

// Class DelMarCore.DelMarVehicleCameraMode_V2
// 0x28F8 (0x2950 - 0x0058)
class alignas(0x10) UDelMarVehicleCameraMode_V2 final : public UFortCameraMode
{
public:
	float                                         FOV;                                               // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalFOVInterpLambda;                              // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            TotalFOVClamp;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalDistanceInterpLambda;                         // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            TotalDistanceClamp;                                // 0x0078(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalHeightInterpLambda;                           // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightOffsetInterpLambda;                          // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            TotalHeightClamp;                                  // 0x0094(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleToOriginDegrees;                              // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleToOriginInterpLambda;                         // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            TotalAngleToOriginClamp;                           // 0x00AC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwivelInterpLambda;                                // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwivelPitchMax;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwivelYawMax;                                      // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundNormalInterpLambda;                          // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardInterpLambda;                               // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CarPitchInterpLambda;                              // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchRotationAxisInterpLambda;                     // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDelMarScaledCurve                     ForwardAirInterpLambdaCurve;                       // 0x00D8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     ForwardAirBlendCurve;                              // 0x0168(0x0088)(Edit, NativeAccessSpecifierPublic)
	float                                         MinForwardSpeedForAerialBlend;                     // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinTimeInAirBeforeUsingVehicleUp;                  // 0x01F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDelMarScaledCurve                     GroundNormalAirInterpLambdaCurve;                  // 0x01F8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     DriftForwardBlendCurve;                            // 0x0288(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     AerialDriftForwardBlendCurve;                      // 0x0310(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     DriftForwardInterpLambdaCurve;                     // 0x0398(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     DriftOriginOffsetCurve;                            // 0x0420(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarScaledCurve                     DriftOriginOffsetInterpLambdaCurve;                // 0x04A8(0x0090)(Edit, NativeAccessSpecifierPublic)
	float                                         DriftOriginOffsetInactiveLambda;                   // 0x0538(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDelMarCameraFloatBlendedProperty      DriftKickOffsetDistance;                           // 0x0540(0x0138)(Edit, NativeAccessSpecifierPublic)
	float                                         DriftKickOffsetLambda;                             // 0x0678(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriftKickOffsetInactiveLambda;                     // 0x067C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeactivateKickOffsetOnKickEnd;                    // 0x0680(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRuntimeFloatCurve                     DriftRollDegreesCurve;                             // 0x0688(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarScaledCurve                     DriftRollDegreesInterpLambdaCurve;                 // 0x0710(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarScaledCurve                     DriftScalarCurveCurve;                             // 0x07A0(0x0090)(Edit, NativeAccessSpecifierPublic)
	float                                         GroundMaxPitchForNormalBlend;                      // 0x0830(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundExtraPitchForNormalBlend;                    // 0x0834(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             StableSpeedDistance;                               // 0x0838(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             StableSpeedFOV;                                    // 0x08E8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             StableSpeedHeight;                                 // 0x0998(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             StableSpeedAngleToOrigin;                          // 0x0A48(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             AccelerationDistance;                              // 0x0AF8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             AccelerationFOV;                                   // 0x0BA8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             AccelerationHeight;                                // 0x0C58(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             AccelerationAngleToOrigin;                         // 0x0D08(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseSpeedDistance;                                 // 0x0DB8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseSpeedFOV;                                      // 0x0E68(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseSpeedHeight;                                   // 0x0F18(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseSpeedAngleToOrigin;                            // 0x0FC8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseAccelerationDistance;                          // 0x1078(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseAccelerationFOV;                               // 0x1128(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseAccelerationHeight;                            // 0x11D8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             BaseAccelerationAngleToOrigin;                     // 0x1288(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      TurboDistance;                                     // 0x1338(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      TurboFOV;                                          // 0x1470(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      TurboBonusZoneSuccessDistance;                     // 0x15A8(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      TurboBonusZoneSuccessFOV;                          // 0x16E0(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      DriftBonusDistance;                                // 0x1818(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      DriftBonusFOV;                                     // 0x1950(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      StartlineDistance;                                 // 0x1A88(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      StartlineFOV;                                      // 0x1BC0(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             DraftDistance;                                     // 0x1CF8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatProperty             DraftFOV;                                          // 0x1DA8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      WorldBonusSpeedDistance;                           // 0x1E58(0x0138)(Edit, NativeAccessSpecifierPublic)
	struct FDelMarCameraFloatBlendedProperty      WorldBonusSpeedFOV;                                // 0x1F90(0x0138)(Edit, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ADelMarVehicle>          VehicleTarget;                                     // 0x20C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D0[0x880];                                   // 0x20D0(0x0880)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnAppliedTeleportRotation();
	void OnDriftBonusActivated();
	void OnDriftBonusDeactivated();
	void OnDriftKickActivated(float DriftDirection, EDelMarVehicleDriftState DriftState);
	void OnDriftKickDeactivated();
	void OnStartlineBoostActivated(float StartlineBoostPerc);
	void OnStartlineBoostDeactivated();
	void OnTurboActivated();
	void OnTurboBonusZoneStateChanged(EDelMarTurboZoneState ZoneState);
	void OnTurboDeactivated();
	void OnWorldBonusSpeedStackGained(const struct FGameplayTag& Source, int32 Stacks);
	void OnWorldBonusSpeedStackLost(const struct FGameplayTag& Source, int32 Stacks);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarVehicleCameraMode_V2">();
	}
	static class UDelMarVehicleCameraMode_V2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarVehicleCameraMode_V2>();
	}
};

// Class DelMarCore.DelMarVehicleInterface
// 0x0000 (0x0000 - 0x0000)
class IDelMarVehicleInterface final
{
public:
	bool AnyWheelsOnGround() const;
	bool CanStrafeBeActivated() const;
	float GetAcceleration() const;
	float GetBaseForwardSpeed() const;
	float GetBaseTargetSpeed() const;
	float GetBonusSpeed() const;
	class UDelMarVehicleCosmeticComponent* GetCosmeticComponent() const;
	float GetCurrentNumTurboCharges() const;
	EDelMarTurboZoneState GetCurrentTurboBonusZoneState() const;
	float GetDraftingAppliedBonusSpeed() const;
	float GetDraftingMaxBonusSpeedPercentage() const;
	EDelmarDraftingState GetDraftingState() const;
	float GetDriftAngle() const;
	float GetDriftBoostAppliedBonusSpeed() const;
	float GetDriftDuration() const;
	float GetDriftSlipAngleRatio() const;
	float GetForwardSpeed() const;
	int32 GetKickflipActivationCharges() const;
	float GetKickflipDistanceToSuctionSurface() const;
	float GetKickflipDuration() const;
	struct FDelMarVehicleLandingData GetLandingData() const;
	float GetMaxNumTurboCharges() const;
	float GetNormalizedBonusSpeed() const;
	float GetNormalizedForwardSpeed() const;
	float GetOversteerAccumulationPercentage() const;
	float GetPercentageTurboActiveTimeRemaining() const;
	class UPostProcessComponent* GetPostProcessComponent() const;
	float GetPotentialDriftBoostPercentage() const;
	float GetQueuedBonusSpeed() const;
	struct FVector GetReattachmentDirection() const;
	float GetRemainingTurboActiveSeconds() const;
	float GetSideSpeed() const;
	class USkeletalMeshComponent* GetSkeletalMeshComponent() const;
	float GetSpeedometerSpeed() const;
	float GetStableSpeed() const;
	float GetStartlineAppliedBonusSpeed() const;
	float GetStartlineMaxEarnedBonusSpeed() const;
	float GetStartlinePercentageMaxBonusSpeedEarned() const;
	float GetSteering() const;
	float GetSteeringAngle() const;
	float GetStrafeCooldownPercentage() const;
	float GetTargetDriftSide() const;
	float GetTargetSpeed() const;
	float GetThrottle() const;
	float GetTotalTimeSkydiving() const;
	class UDelMarTrackPositionComponent* GetTrackPositionComponent() const;
	float GetTurboAdditionalActiveSeconds() const;
