#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DelMarTrackRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DelMarTrackRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class DelMarTrackRuntime.DelMarTrackBase
// 0x0078 (0x0C40 - 0x0BC8)
class ADelMarTrackBase : public AFortCreativeDeviceProp
{
public:
	uint8                                         Pad_BC8[0x20];                                     // 0x0BC8(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class UDelMarTrackSplineComponent*            Spline;                                            // 0x0BE8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackPalette*                    TrackPalette;                                      // 0x0BF0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackPaletteTheme*               TrackPalette_V2;                                   // 0x0BF8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackPointData*                  TrackSplinePointData;                              // 0x0C00(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDelMarTrackPropSection>        TrackPropData;                                     // 0x0C08(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarSegmentActorCollection>  SegmentCollections;                                // 0x0C18(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NonTransactional, ContainsInstancedReference, Protected, NonPIEDuplicateTransient, NativeAccessSpecifierProtected)
	float                                         DefaultMaxTrackWidth;                              // 0x0C28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableGlobalMaterialCollectionIndex;              // 0x0C2C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C2D[0x3];                                      // 0x0C2D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        GlobalMaterialCollectionIndex;                     // 0x0C30(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TotalSegmentActors;                                // 0x0C34(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrackLength;                                       // 0x0C38(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C3C[0x4];                                      // 0x0C3C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ConvertTrackTagsToV2();
	TArray<class ADelMarTrackSegmentBase*> GetAllTrackSegmentActors();
	void InitializeSpline();
	void OnMetadataChanged(class UDelMarTrackSplineComponent* InSpline, int32 SplineIndex);
	void OnSplineClosedLoopChanged(class UDelMarTrackSplineComponent* InSpline, int32 SplineIndex);
	void OnSplinePointAdded(class UDelMarTrackSplineComponent* InSpline, int32 SplineIndex);
	void OnSplinePointChanged(class UDelMarTrackSplineComponent* InSpline, int32 SplineIndex);
	void OnSplinePointRemoved(class UDelMarTrackSplineComponent* InSpline, int32 SplineIndex);
	void PostSplineSegmentGenerated(class UDelMarTrackSplineComponent* SplineComp, int32 PointIndex);
	void PreSplineSegmentGenerated(class UDelMarTrackSplineComponent* SplineComp, int32 PointIndex);
	void RebuildTrack();
	void SetTrackTypeTagAtIndex(int32 SplineIndex, const struct FGameplayTag& tag);

	struct FDelMarTrackPointDistanceRange GetDistanceRangeFromPointRange(const struct FDelMarTrackPointIndexRange& InRange) const;
	class UClass* GetEndCapClass(int32 SplineIndex) const;
	float GetForwardDistance(float Start, float End) const;
	float GetLoopDistance(float InTotalDistance) const;
	const struct FDelMarSplinePointMetaData GetMetaDataAtSplinePoint(int32 SplineIndex) const;
	int32 GetNextSplinePoint(int32 InSplinePoint) const;
	int32 GetNextSplineSegment(int32 InSplineSegmentIndex) const;
	int32 GetPreviousSplinePoint(int32 InSplinePoint) const;
	int32 GetPreviousSplineSegment(int32 InSplineSegmentIndex) const;
	class UClass* GetSegmentClassAtSplinePoint(int32 SplineIndex) const;
	const struct FGameplayTag GetSegmentTrackTypeTag(int32 SplineIndex) const;
	class UClass* GetStartCapClass(int32 SplineIndex) const;
	class UClass* GetTransitionSegmentClass(int32 FromSplineIndex, int32 ToSplineIndex) const;
	bool IsCosmetic() const;
	bool IsDistanceWithinRange(float InDistance, float StartDistance, float EndDistance) const;
	bool IsPointInOOBTube(const struct FVector& Point) const;
	bool IsPrimary() const;
	bool IsSecondary() const;
	bool IsTrackable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackBase">();
	}
	static class ADelMarTrackBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTrackBase>();
	}
};

// Class DelMarTrackRuntime.DelMarTrack
// 0x0048 (0x0C88 - 0x0C40)
class ADelMarTrack final : public ADelMarTrackBase
{
public:
	EDelMarTrackType                              TrackType;                                         // 0x0C40(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUserSelectedStartTrack;                           // 0x0C41(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C42[0x6];                                      // 0x0C42(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class ADelMarTrack*                           StartTrackConnection;                              // 0x0C48(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUserSelectedEndTrack;                             // 0x0C50(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C51[0x7];                                      // 0x0C51(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class ADelMarTrack*                           EndTrackConnection;                                // 0x0C58(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ParentStartDistance;                               // 0x0C60(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ParentEndDistance;                                 // 0x0C64(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PrimaryStartDistance;                              // 0x0C68(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PrimaryEndDistance;                                // 0x0C6C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PrimarySegmentLength;                              // 0x0C70(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C74[0x4];                                      // 0x0C74(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class ADelMarTrackOobTube>        OobTubeClass;                                      // 0x0C78(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarTrackOobTube>     AttachedOobTube;                                   // 0x0C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool MergeTrack(class ADelMarTrack* OtherTrack, bool MergeToEndPoint, bool CopyFromStartPoint);
	bool SplitTrackAtPoint(int32 SplitAtPoint);

	float GetParentEndDistance() const;
	float GetParentStartDistance() const;
	float GetPrimaryDistance(float DistanceOnThisTrack) const;
	float GetPrimaryEndDistance() const;
	float GetPrimaryStartDistance() const;
	class ADelMarTrack* GetSecondaryEndTrack() const;
	class ADelMarTrack* GetSecondaryStartTrack() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrack">();
	}
	static class ADelMarTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTrack>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UDelMarTrackBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool IsTrackRadiusCheckDisabled();
	static bool TrackPositionDebugDrawEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackBlueprintFunctionLibrary">();
	}
	static class UDelMarTrackBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackBlueprintFunctionLibrary>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackCustomizationInterface
// 0x0000 (0x0000 - 0x0000)
class IDelMarTrackCustomizationInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackCustomizationInterface">();
	}
	static class IDelMarTrackCustomizationInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDelMarTrackCustomizationInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class DelMarTrackRuntime.DelMarTrackSegmentBase
// 0x0028 (0x02B8 - 0x0290)
class ADelMarTrackSegmentBase : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class ADelMarTrackBase>        Track;                                             // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackMatLayerComponent*          MaterialLayerComponent;                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BeginDistanceAlongSpline;                          // 0x02A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndDistanceAlongSpline;                            // 0x02AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TrackSegmentIndex;                                 // 0x02B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool ContainsDistanceAlongSpline(const float DistanceAlongSpline) const;
	struct FDelMarTrackPointDistanceRange GetSplineDistanceRange() const;
	class USplineMeshComponent* GetSplineMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSegmentBase">();
	}
	static class ADelMarTrackSegmentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTrackSegmentBase>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackCustomSegment
// 0x0008 (0x02C0 - 0x02B8)
class ADelMarTrackCustomSegment final : public ADelMarTrackSegmentBase
{
public:
	float                                         SegmentLength;                                     // 0x02B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackCustomSegment">();
	}
	static class ADelMarTrackCustomSegment* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTrackCustomSegment>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackManager
// 0x0050 (0x0080 - 0x0030)
class UDelMarTrackManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class ADelMarTrackBase*>               DelMarTracks;                                      // 0x0060(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class ADelMarTrackBase*                       PrimaryTrack;                                      // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarTrackBase*                       LowestTrack;                                       // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackManager">();
	}
	static class UDelMarTrackManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackManager>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackMaterialCollection
// 0x0030 (0x0060 - 0x0030)
class UDelMarTrackMaterialCollection final : public UDataAsset
{
public:
	uint32                                        SelectedIndex;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDelMarTrackMaterialCollectionEntry> Materials;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackMaterialCollection">();
	}
	static class UDelMarTrackMaterialCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackMaterialCollection>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackMatLayerComponent
// 0x0018 (0x00B8 - 0x00A0)
class UDelMarTrackMatLayerComponent final : public UActorComponent
{
public:
	TWeakObjectPtr<class UStaticMeshComponent>    RoadMesh;                                          // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarTrackBase>        Track;                                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackMaterialCollection*         MaterialCollection;                                // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackMatLayerComponent">();
	}
	static class UDelMarTrackMatLayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackMatLayerComponent>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackMeshCustomization
// 0x0010 (0x0750 - 0x0740)
class UDelMarTrackMeshCustomization final : public USplineMeshComponent
{
public:
	uint8                                         Pad_740[0x9];                                      // 0x0740(0x0009)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsADefaultCustomization;                          // 0x0749(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74A[0x6];                                      // 0x074A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackMeshCustomization">();
	}
	static class UDelMarTrackMeshCustomization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackMeshCustomization>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackOobTube
// 0x00E8 (0x0378 - 0x0290)
class ADelMarTrackOobTube final : public AActor
{
public:
	class ADelMarTrack*                           AttachedTrack;                                     // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackSplineComponent*            Spline;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackOobTubePointData*           SplinePointData;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   TubeMeshComponentClass;                            // 0x02A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoClear, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDelMarTrackOobTubeMeshSection> OobTubeMeshSections;                               // 0x02C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NonTransactional, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             TubeMesh;                                          // 0x02D8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EDelMarTrackOobTubeTransitionType, TSoftObjectPtr<class UStaticMesh>> TransitionMeshes;     // 0x02F8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FCollisionProfileName                  EnabledMeshCollisionProfile;                       // 0x0348(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCollisionProfileName                  DisabledMeshCollisionProfile;                      // 0x034C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         DefaultTransitionMeshLength;                       // 0x0350(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DefaultNumSubsections;                             // 0x0354(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SmallestSubsectionLength;                          // 0x0358(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimumMeshScale;                                  // 0x035C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_360[0x18];                                     // 0x0360(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnAttachedTrackPointAdded(class UDelMarTrackSplineComponent* InSpline, int32 PointIndex);
	void OnAttachedTrackPointChanged(class UDelMarTrackSplineComponent* InSpline, int32 PointIndex);
	void OnAttachedTrackPointRemoved(class UDelMarTrackSplineComponent* InSpline, int32 PointIndex);
	void OnConstructTubeMesh(class USplineMeshComponent* TubeMeshComponent, bool bIsTransitionMesh, bool bIsTransitionIn);
	void OnPostContructedOOBTube();

	EDelMarTrackOobTubeTransitionType DetermineTubeMeshTransitionType(int32 CurrentPointIndex, int32 NextPointIndex) const;
	const struct FGameplayTag GetSplinePointTagAtIndex(int32 PointIndex) const;
	bool IsAttachedToPrimaryTrack() const;
	bool IsAttachedToSecondaryTrack() const;
	bool IsSplinePointOffset(int32 PointIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackOobTube">();
	}
	static class ADelMarTrackOobTube* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTrackOobTube>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackSplineComponent
// 0x0090 (0x0710 - 0x0680)
class UDelMarTrackSplineComponent final : public USplineComponent
{
public:
	int32                                         WorldPlaneLookupSubsteps;                          // 0x0678(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_67C[0x7C];                                     // 0x067C(0x007C)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDelMarRotationalMinimalFrame>  RotationalMinimalFrameNormals;                     // 0x06F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_708[0x8];                                      // 0x0708(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	struct FVector FindClosestLocationForSegmentToWorldPlane(const struct FVector& WorldPlaneOrigin, const struct FVector& WorldPlaneNormal, const int32 SegmentIndex, ESplineCoordinateSpace CoordinateSpace) const;
	struct FVector FindClosestLocationToWorldPlane(const struct FVector& WorldPlaneOrigin, const struct FVector& WorldPlaneNormal, ESplineCoordinateSpace CoordinateSpace) const;
	float FindInputKeyClosestToWorldPlane(const struct FVector& WorldPlaneOrigin, const struct FVector& WorldPlaneNormal) const;
	float FindInputKeyForNeighboringSegmentClosestToWorldPlane(const struct FVector& WorldPlaneOrigin, const struct FVector& WorldPlaneNormal, const int32 SegmentIndex, int32* OutClosestSegmentIndex) const;
	float FindInputKeyForSegmentClosestToWorldPlane(const struct FVector& WorldPlaneOrigin, const struct FVector& WorldPlaneNormal, const int32 SegmentIndex) const;
	float GetForwardDistance(float Start, float End) const;
	float GetLoopDistance(float InTotalDistance) const;
	int32 GetNextSplinePoint(int32 InSplinePoint) const;
	int32 GetNextSplineSegment(int32 InSplineSegmentIndex) const;
	int32 GetPreviousSplinePoint(int32 InSplinePoint) const;
	int32 GetPreviousSplineSegment(int32 InSplineSegmentIndex) const;
	const TArray<struct FDelMarRotationalMinimalFrame> GetRotationalMinimalFrames() const;
	struct FVector GetRotationalMinimalUpVectorAtDistanceAlongSpline(float DistanceAlongSpline, ESplineCoordinateSpace CoordinateSpace) const;
	struct FVector GetRotationalMinimalUpVectorAtSplinePoint(int32 SplinePoint, ESplineCoordinateSpace CoordinateSpace) const;
	int32 GetSplinePointAtDistanceAlongSpline(float DistanceAlongSpline) const;
	int32 GetSplinePointClosestToDistanceAlongSpline(float DistanceAlongSpline) const;
	int32 GetSplinePointClosestToWorldLocation(const struct FVector& WorldLocation) const;
	bool IsDistanceWithinRange(float InDistance, float StartDistance, float EndDistance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSplineComponent">();
	}
	static class UDelMarTrackSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackSplineComponent>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackOobTubePointData
// 0x0010 (0x0038 - 0x0028)
class UDelMarTrackOobTubePointData final : public USplineMetadata
{
public:
	TArray<struct FDelMarTrackOobTubePointMetaData> MetaData;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackOobTubePointData">();
	}
	static class UDelMarTrackOobTubePointData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackOobTubePointData>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackOobTubePositionalRenderingComponent
// 0x0018 (0x00B8 - 0x00A0)
class UDelMarTrackOobTubePositionalRenderingComponent : public UControllerComponent
{
public:
	TWeakObjectPtr<class UDelMarTrackPositionComponent> PlayerPositionComponent;                     // 0x00A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RenderDistanceInFrontOfPlayer;                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RenderDistanceBehindPlayer;                        // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpdateIntervalInSeconds;                           // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackOobTubePositionalRenderingComponent">();
	}
	static class UDelMarTrackOobTubePositionalRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackOobTubePositionalRenderingComponent>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackOobTubeProxy
// 0x0000 (0x0028 - 0x0028)
class UDelMarTrackOobTubeProxy final : public UObject
{
public:
	class ADelMarTrack* GetAttachedTrack() const;
	int32 GetDefaultSubsectionCount() const;
	double GetDefaultTransitionMeshLength() const;
	double GetMinimumMeshScale() const;
	class AActor* GetOobTubeActor() const;
	double GetSmallestSubsectionLength() const;
	class USplineComponent* GetSplineComponent() const;
	struct FDelMarTrackOobTubePointMetaData GetSplineMetadata(int32 PointIndex) const;
	double GetSplineVisualizationOffset() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackOobTubeProxy">();
	}
	static class UDelMarTrackOobTubeProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackOobTubeProxy>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackOobTubeCollectionProxy
// 0x0008 (0x0030 - 0x0028)
class UDelMarTrackOobTubeCollectionProxy final : public UObject
{
public:
	TSubclassOf<class AActor>                     OobTubeClass;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UDelMarTrackOobTubeProxy* GetOobTubeProxy(int32 OobTubeIndex);
	void RegisterOobTube(class AActor* OobTubeActor);

	int32 GetNumOobTubeProxies() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackOobTubeCollectionProxy">();
	}
	static class UDelMarTrackOobTubeCollectionProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackOobTubeCollectionProxy>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackPaletteTrackType
// 0x0020 (0x0050 - 0x0030)
class UDelMarTrackPaletteTrackType final : public UDataAsset
{
public:
	TArray<struct FDelMarTrackPaletteTrackTypeEntry> StyleArray;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldOOBTubeFunnel;                              // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UStaticMesh*                            OOBTubeMeshOverride;                               // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddSegmentClassActorToStyle(const struct FGameplayTag& StyleTag, class UClass* SegmentClass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPaletteTrackType">();
	}
	static class UDelMarTrackPaletteTrackType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPaletteTrackType>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackPaletteTransitions
// 0x0010 (0x0040 - 0x0030)
class UDelMarTrackPaletteTransitions final : public UDataAsset
{
public:
	TArray<struct FDelMarTrackPaletteTransitionEntry_v2> TransitionArray;                            // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPaletteTransitions">();
	}
	static class UDelMarTrackPaletteTransitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPaletteTransitions>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackPaletteTheme
// 0x0040 (0x0070 - 0x0030)
class UDelMarTrackPaletteTheme final : public UDataAsset
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   ThemeName;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ThemeDescription;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UDelMarTrackPaletteTrackType*>   Tracks;                                            // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UDelMarTrackPaletteTransitions*         Transitions;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            OOBTubeMesh;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPaletteTheme">();
	}
	static class UDelMarTrackPaletteTheme* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPaletteTheme>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackSplineMeshSegment
// 0x0010 (0x02C8 - 0x02B8)
class ADelMarTrackSplineMeshSegment : public ADelMarTrackSegmentBase
{
public:
	class USplineMeshComponent*                   SplineMesh;                                        // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SegmentLengthScaler;                               // 0x02C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSplineMeshSegment">();
	}
	static class ADelMarTrackSplineMeshSegment* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTrackSplineMeshSegment>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackSegmentCollectionSpawnDataProvider
// 0x0000 (0x0000 - 0x0000)
class IDelMarTrackSegmentCollectionSpawnDataProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSegmentCollectionSpawnDataProvider">();
	}
	static class IDelMarTrackSegmentCollectionSpawnDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDelMarTrackSegmentCollectionSpawnDataProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class DelMarTrackRuntime.DelMarTrackSettings
// 0x0020 (0x0050 - 0x0030)
class UDelMarTrackSettings final : public UDeveloperSettings
{
public:
	struct FGameplayTag                           RootTrackTag;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDelMarTrackTagConverterData>   TagConverterData;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DefaultConverterTag;                               // 0x0048(0x0004)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           HiddenTrackTag;                                    // 0x004C(0x0004)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSettings">();
	}
	static class UDelMarTrackSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackSettings>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackSnapToComponent
// 0x0030 (0x02D0 - 0x02A0)
class UDelMarTrackSnapToComponent : public USceneComponent
{
public:
	struct FVector                                OffsetToOwnerActor;                                // 0x02A0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x18];                                     // 0x02B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSnapToComponent">();
	}
	static class UDelMarTrackSnapToComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackSnapToComponent>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackSnapToSplinePointComponent
// 0x0020 (0x02F0 - 0x02D0)
class UDelMarTrackSnapToSplinePointComponent final : public UDelMarTrackSnapToComponent
{
public:
	class USplineComponent*                       SplineToSnapTo;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDelMarTrackSplinePointSnapMode               SplinePointSnapMode;                               // 0x02D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SplinePointIndexToSnapTo;                          // 0x02DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSnapToSplinePointComponent">();
	}
	static class UDelMarTrackSnapToSplinePointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackSnapToSplinePointComponent>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackPositionComponent
// 0x0050 (0x02F0 - 0x02A0)
#pragma pack(push, 0x1)
class alignas(0x10) UDelMarTrackPositionComponent : public USceneComponent
{
public:
	struct FTrackPosition                         ActiveTrackPosition;                               // 0x02A0(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         TrackRadius;                                       // 0x02C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0x24];                                     // 0x02C4(0x0024)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetActiveTrack(class ADelMarTrackBase* Track, int32 TrackSegmentIndex);

	int32 GetActiveSegmentIndex() const;
	class ADelMarTrackBase* GetActiveTrack() const;
	float GetActiveTrackDistance() const;
	struct FTrackPosition GetActiveTrackPosition() const;
	float GetActiveTrackRadius() const;
	float GetDistanceAlongSpline() const;
	struct FVector GetLastKnowGoodSplineLocation() const;
	float GetPrimaryDistance() const;
	class ADelMarTrackBase* GetPrimaryTrack() const;
	struct FVector GetPrimaryWorldLocationAlongSpline() const;
	struct FVector GetRawClosestSplineLoction() const;
	struct FVector GetWorldDirectionAlongSpline() const;
	struct FVector GetWorldLocationAlongSpline() const;
	struct FVector GetWorldRightVectorAlongSpline() const;
	struct FTransform GetWorldTransformAlongSpline() const;
	struct FVector GetWorldUpVectorAlongSpline() const;
	bool HasValidPosition() const;
	bool IsOnPrimaryTrack() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPositionComponent">();
	}
	static class UDelMarTrackPositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPositionComponent>();
	}
};
#pragma pack(pop)

// Class DelMarTrackRuntime.DelMarTrackVehiclePositionComponent
// 0x0000 (0x02F0 - 0x02F0)
class UDelMarTrackVehiclePositionComponent final : public UDelMarTrackPositionComponent
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x02E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackVehiclePositionComponent">();
	}
	static class UDelMarTrackVehiclePositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackVehiclePositionComponent>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackPalette
// 0x0030 (0x0060 - 0x0030)
class UDelMarTrackPalette final : public UDataAsset
{
public:
	TArray<struct FDelMarTrackPaletteEntry>       Palette;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FDelMarTrackPaletteTransitionEntry> Transitions;                                   // 0x0040(0x0010)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FDelMarTrackCapEntry>           Caps;                                              // 0x0050(0x0010)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NoClear, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPalette">();
	}
	static class UDelMarTrackPalette* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPalette>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackSegmentInterface
// 0x0000 (0x0000 - 0x0000)
class IDelMarTrackSegmentInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSegmentInterface">();
	}
	static class IDelMarTrackSegmentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDelMarTrackSegmentInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class DelMarTrackRuntime.DelMarTrackPointData
// 0x0018 (0x0040 - 0x0028)
class UDelMarTrackPointData final : public USplineMetadata
{
public:
	TArray<struct FDelMarSplinePointMetaData>     MetaData;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDelMarTrackSplineComponent*            Spline;                                            // 0x0038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPointData">();
	}
	static class UDelMarTrackPointData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPointData>();
	}
};

// Class DelMarTrackRuntime.DelMarTrackVariableSplineMeshSegment
// 0x0050 (0x0318 - 0x02C8)
class ADelMarTrackVariableSplineMeshSegment final : public ADelMarTrackSplineMeshSegment
{
public:
	TMap<int32, class UStaticMesh*>               VariableStaticMeshes;                              // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackVariableSplineMeshSegment">();
	}
	static class ADelMarTrackVariableSplineMeshSegment* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarTrackVariableSplineMeshSegment>();
	}
};

}

