#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "DelMarCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LinkId_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function DelMarCore.DelMarAIController.HandleGroundedStateChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarAIController_HandleGroundedStateChanged final
{
public:
	TScriptInterface<class IDelMarVehicleInterface> VehicleRef;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarPlayerActiveRaceManagerComponent.OnRep_ActiveRaceManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerActiveRaceManagerComponent_OnRep_ActiveRaceManager final
{
public:
	class ADelMarRaceManager*                     PreviousRaceManager;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerActiveRaceManagerComponent.SetActiveRaceManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerActiveRaceManagerComponent_SetActiveRaceManager final
{
public:
	class ADelMarRaceManager*                     RaceManager;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerActiveRaceManagerComponent.GetActiveRaceManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerActiveRaceManagerComponent_GetActiveRaceManager final
{
public:
	class ADelMarRaceManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceLevelConfig.SpawnRaceManager
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceLevelConfig_SpawnRaceManager final
{
public:
	bool                                          bFireInitializationEvent;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class ADelMarRaceManager*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceLevelConfig.GetRaceManagerClass
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceLevelConfig_GetRaceManagerClass final
{
public:
	TSubclassOf<class ADelMarRaceManager>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceLevelConfig.GetRaceModeTag
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceLevelConfig_GetRaceModeTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandleFinalRacePositionsUpdated
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandleFinalRacePositionsUpdated final
{
public:
	TArray<struct FDelMarFinalRacePositionEntry>  FinalRacePositions;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandlePlayerLapCompleted
// 0x0020 (0x0020 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted final
{
public:
	struct FDelMarEvent_LapComplete               LapCompleteEvent;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandlePlayerRunRecorded
// 0x0050 (0x0050 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandlePlayerRunRecorded final
{
public:
	struct FDelMarEvent_RunRecorded               Event;                                             // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRacerStateMachineComponent.OnRep_CurrentState
// 0x0004 (0x0004 - 0x0000)
struct DelMarRacerStateMachineComponent_OnRep_CurrentState final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.ConfigureRaceStart
// 0x0008 (0x0008 - 0x0000)
struct DelMarTimeManagerComponent_ConfigureRaceStart final
{
public:
	const class AGameStateBase*                   GameState;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.StartCountdownForPlayer
// 0x0018 (0x0018 - 0x0000)
struct DelMarTimeManagerComponent_StartCountdownForPlayer final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ServerCountdownStartTime;                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ServerRunStartTime;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.StartCountdownForRace
// 0x0018 (0x0018 - 0x0000)
struct DelMarTimeManagerComponent_StartCountdownForRace final
{
public:
	double                                        ServerCountdownStartTime;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ServerRunStartTime;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InServerCountdownIntervalTime;                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetRaceTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct DelMarTimeManagerComponent_GetRaceTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetSecondsRemainingTillRaceStart
// 0x0004 (0x0004 - 0x0000)
struct DelMarTimeManagerComponent_GetSecondsRemainingTillRaceStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetSecondsSinceRaceStart
// 0x0004 (0x0004 - 0x0000)
struct DelMarTimeManagerComponent_GetSecondsSinceRaceStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetServerCountdownIntervalTime
// 0x0004 (0x0004 - 0x0000)
struct DelMarTimeManagerComponent_GetServerCountdownIntervalTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetServerRaceFinishTime
// 0x0004 (0x0004 - 0x0000)
struct DelMarTimeManagerComponent_GetServerRaceFinishTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetServerRaceStartTime
// 0x0004 (0x0004 - 0x0000)
struct DelMarTimeManagerComponent_GetServerRaceStartTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.FinalizeRegisteredPlayerInitialization
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_FinalizeRegisteredPlayerInitialization final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.HandleRegisteredPlayerPawnSet
// 0x0018 (0x0018 - 0x0000)
struct DelMarRaceManager_HandleRegisteredPlayerPawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.NetMulticast_FinishRace
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_NetMulticast_FinishRace final
{
public:
	double                                        RaceFinishedTime;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.NetMulticast_ResetRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_NetMulticast_ResetRace final
{
public:
	bool                                          bNextRound;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.NetMulticast_ResetRun
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_NetMulticast_ResetRun final
{
public:
	const class AFortPlayerState*                 InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayerTriggered;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarRaceManager.RegisterPlayerController
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RegisterPlayerController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.RegisterPlayerState
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RegisterPlayerState final
{
public:
	class AFortPlayerState*                       InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.RequestStartRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_RequestStartRace final
{
public:
	bool                                          bSkipCountdown;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.ResetRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_ResetRace final
{
public:
	bool                                          bIsRoundReset;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.ResetRun
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_ResetRun final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayerTriggered;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarRaceManager.SetActiveRaceLevelConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetActiveRaceLevelConfig final
{
public:
	class ADelMarRaceLevelConfig*                 InRaceLevelConfig;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.SetPlayerAsSpectator
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetPlayerAsSpectator final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.SetSpectatorAsPlayer
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetSpectatorAsPlayer final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.UnregisterAllPlayers
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_UnregisterAllPlayers final
{
public:
	bool                                          bSetAsInactive;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.UnregisterPlayerController
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_UnregisterPlayerController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarRaceManager.UnregisterPlayerState
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_UnregisterPlayerState final
{
public:
	class AFortPlayerState*                       InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarRaceManager.GetActiveRaceLevelConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetActiveRaceLevelConfig final
{
public:
	class ADelMarRaceLevelConfig*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetActiveRacers
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetActiveRacers final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetCurrentRaceMode
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_GetCurrentRaceMode final
{
public:
	EDelMarRaceMode                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetCurrentSpawnMode
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_GetCurrentSpawnMode final
{
public:
	EDelMarRaceSpawnMode                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetEliminationManagerComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetEliminationManagerComponent final
{
public:
	class UDelMarEliminationRaceManagerComponent* ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetManagedPlayerStatesArray
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetManagedPlayerStatesArray final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetNumberOfLapsForRace
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceManager_GetNumberOfLapsForRace final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetNumInactiveRacers
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceManager_GetNumInactiveRacers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetPositionalTracker
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetPositionalTracker final
{
public:
	class UDelMarPositionalTrackerComponent*      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetRaceConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRaceConfig final
{
public:
	class UDelMarRaceConfigComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetRespawnManagerComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRespawnManagerComponent final
{
public:
	class UDelMarRespawnManagerComponent*         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetRubberbandingManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRubberbandingManager final
{
public:
	class UDelMarRubberbandingManagerComponent*   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetSpectators
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetSpectators final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetTimeManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetTimeManager final
{
public:
	class UDelMarTimeManagerComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.IsActiveRacer
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_IsActiveRacer final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarRaceManager.IsSpectator
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_IsSpectator final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarTutorialRaceManager.NetMulticast_TutorialSectionChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrevSectionIndex;                                  // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTutorialRaceManager.RequestNextTutorialSection
// 0x0008 (0x0008 - 0x0000)
struct DelMarTutorialRaceManager_RequestNextTutorialSection final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTutorialRaceManager.RequestPrevTutorialSection
// 0x0008 (0x0008 - 0x0000)
struct DelMarTutorialRaceManager_RequestPrevTutorialSection final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTutorialRaceManager.SetCurrentTutorialSection
// 0x0010 (0x0010 - 0x0000)
struct DelMarTutorialRaceManager_SetCurrentTutorialSection final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerState*                       PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleCameraMode_V2.OnDriftKickActivated
// 0x0008 (0x0008 - 0x0000)
struct DelMarVehicleCameraMode_V2_OnDriftKickActivated final
{
public:
	float                                         DriftDirection;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarVehicleDriftState                      DriftState;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DelMarCore.DelMarVehicleCameraMode_V2.OnStartlineBoostActivated
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleCameraMode_V2_OnStartlineBoostActivated final
{
public:
	float                                         StartlineBoostPerc;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleCameraMode_V2.OnTurboBonusZoneStateChanged
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleCameraMode_V2_OnTurboBonusZoneStateChanged final
{
public:
	EDelMarTurboZoneState                         ZoneState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleCameraMode_V2.OnWorldBonusSpeedStackGained
// 0x0008 (0x0008 - 0x0000)
struct DelMarVehicleCameraMode_V2_OnWorldBonusSpeedStackGained final
{
public:
	struct FGameplayTag                           Source;                                            // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleCameraMode_V2.OnWorldBonusSpeedStackLost
// 0x0008 (0x0008 - 0x0000)
struct DelMarVehicleCameraMode_V2_OnWorldBonusSpeedStackLost final
{
public:
	struct FGameplayTag                           Source;                                            // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.AnyWheelsOnGround
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_AnyWheelsOnGround final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.CanStrafeBeActivated
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_CanStrafeBeActivated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetAcceleration
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetAcceleration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetBaseForwardSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetBaseForwardSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetBaseTargetSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetBaseTargetSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetCosmeticComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarVehicleInterface_GetCosmeticComponent final
{
public:
	class UDelMarVehicleCosmeticComponent*        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetCurrentNumTurboCharges
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetCurrentNumTurboCharges final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetCurrentTurboBonusZoneState
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_GetCurrentTurboBonusZoneState final
{
public:
	EDelMarTurboZoneState                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetDraftingAppliedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetDraftingAppliedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetDraftingMaxBonusSpeedPercentage
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetDraftingMaxBonusSpeedPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetDraftingState
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_GetDraftingState final
{
public:
	EDelmarDraftingState                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetDriftAngle
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetDriftAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetDriftBoostAppliedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetDriftBoostAppliedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetDriftDuration
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetDriftDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetDriftSlipAngleRatio
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetDriftSlipAngleRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetForwardSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetForwardSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetKickflipActivationCharges
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetKickflipActivationCharges final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetKickflipDistanceToSuctionSurface
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetKickflipDistanceToSuctionSurface final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetKickflipDuration
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetKickflipDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetLandingData
// 0x000C (0x000C - 0x0000)
struct DelMarVehicleInterface_GetLandingData final
{
public:
	struct FDelMarVehicleLandingData              ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetMaxNumTurboCharges
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetMaxNumTurboCharges final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetNormalizedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetNormalizedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetNormalizedForwardSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetNormalizedForwardSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetOversteerAccumulationPercentage
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetOversteerAccumulationPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetPercentageTurboActiveTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetPercentageTurboActiveTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetPostProcessComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarVehicleInterface_GetPostProcessComponent final
{
public:
	class UPostProcessComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetPotentialDriftBoostPercentage
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetPotentialDriftBoostPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetQueuedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetQueuedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetReattachmentDirection
// 0x0018 (0x0018 - 0x0000)
struct DelMarVehicleInterface_GetReattachmentDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetRemainingTurboActiveSeconds
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetRemainingTurboActiveSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetSideSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetSideSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarVehicleInterface_GetSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetSpeedometerSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetSpeedometerSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetStableSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetStableSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetStartlineAppliedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetStartlineAppliedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetStartlineMaxEarnedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetStartlineMaxEarnedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetStartlinePercentageMaxBonusSpeedEarned
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetStartlinePercentageMaxBonusSpeedEarned final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetSteering
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetSteering final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetSteeringAngle
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetSteeringAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetStrafeCooldownPercentage
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetStrafeCooldownPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetTargetDriftSide
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetTargetDriftSide final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetTargetSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetTargetSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetThrottle
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetThrottle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetTotalTimeSkydiving
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetTotalTimeSkydiving final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetTrackPositionComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarVehicleInterface_GetTrackPositionComponent final
{
public:
	class UDelMarTrackPositionComponent*          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetTurboAdditionalActiveSeconds
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetTurboAdditionalActiveSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetTurboAppliedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetTurboAppliedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetTurboBonusZoneBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetTurboBonusZoneBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetUnderthrustActiveDuration
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetUnderthrustActiveDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetUnderthrustPercentageTankRemaining
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetUnderthrustPercentageTankRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetVehicleForwardState
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_GetVehicleForwardState final
{
public:
	EDelMarVehicleForwardState                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetVelocity
// 0x0018 (0x0018 - 0x0000)
struct DelMarVehicleInterface_GetVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.GetWorldAppliedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct DelMarVehicleInterface_GetWorldAppliedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.HasValidDraftingTarget
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_HasValidDraftingTarget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.InDriftBoostRange
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_InDriftBoostRange final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsAccelerating
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsAccelerating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsAllVehicleInputDisabled
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsAllVehicleInputDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsBraking
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsBraking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsDriftBoostActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsDriftBoostActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsDriftControlled
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsDriftControlled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsDrifting
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsDrifting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsInvulnerabilityActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsInvulnerabilityActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsJumpAbilityActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsJumpAbilityActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsKickflipActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsKickflipActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsKickflipSuctionActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsKickflipSuctionActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsKickingWheels
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsKickingWheels final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsLosingAppliedBonusSpeed
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsLosingAppliedBonusSpeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsReattaching
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsReattaching final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsSkyDiving
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsSkyDiving final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsStartlineBoostActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsStartlineBoostActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsStrafeActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsStrafeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarVehicleInterface.IsStrafeDisabled
// 0x0001 (0x0001 - 0x0000)
struct DelMarVehicleInterface_IsStrafeDisabled final
{
public:
