#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DelMarCosmetics

#include "Basic.hpp"

#include "DelMarCore_structs.hpp"
#include "DelMarCore_classes.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "DelMarCosmetics_structs.hpp"
#include "CinematicCamera_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DelMarCosmetics.DelMarCockpitActor
// 0x0010 (0x02A0 - 0x0290)
class ADelMarCockpitActor final : public AActor
{
public:
	class USkeletalMeshComponent*                 CockpitMeshComponent;                              // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADelMarVehicle*                         BoundVehicle;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_OnBoundVehicleChanged(const class ADelMarVehicle* NewVehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCockpitActor">();
	}
	static class ADelMarCockpitActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarCockpitActor>();
	}
};

// Class DelMarCosmetics.DelMarDioramaActor
// 0x0158 (0x03E8 - 0x0290)
class ADelMarDioramaActor final : public AActor
{
public:
	class USkeletalMeshComponent*                 VehicleInteriorMeshComponent;                      // 0x0290(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FDelMarDriverSequenceDataList> CustomSequenceListTable;         // 0x0298(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x18];                                     // 0x02E8(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class ADelMarDriverMannequin>     DriverMannequinClass;                              // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ALevelSequenceActor>        LevelSequenceActorClass;                           // 0x0308(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ADelMarDriverCameraActor>   CineCameraClass;                                   // 0x0310(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ADelMarCockpitActor>        CockpitClass;                                      // 0x0318(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarDioramaConfigData*               ConfigData;                                        // 0x0320(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DefaultCameraOffset;                               // 0x0328(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               DefaultCameraRotation;                             // 0x0340(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0358(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarDriverCameraActor*               CameraActor;                                       // 0x0360(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarDriverMannequin*                 DriverMannequin;                                   // 0x0368(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarCockpitActor*                    CockpitActor;                                      // 0x0370(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           BoundPlayer;                                       // 0x0378(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarDriverSequenceData*              LastPlayedSequenceData;                            // 0x0380(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class UDelMarDriverSequenceDataTable*>   BoundSequencesTables;                              // 0x0388(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x4];                                      // 0x03D8(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         DefaultCameraSocketIndex;                          // 0x03DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E0[0x8];                                      // 0x03E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleSequenceFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDioramaActor">();
	}
	static class ADelMarDioramaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarDioramaActor>();
	}
};

// Class DelMarCosmetics.DelMarDioramaConfigData
// 0x0028 (0x0058 - 0x0030)
class UDelMarDioramaConfigData final : public UDataAsset
{
public:
	class FName                                   CameraActorTag;                                    // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DriverMannequinTag;                                // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CockpitActorTag;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FName>                           CockpitCameraCutSockets;                           // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   CockpitCameraIdleSocket;                           // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDioramaConfigData">();
	}
	static class UDelMarDioramaConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDioramaConfigData>();
	}
};

// Class DelMarCosmetics.DelMarDriverCameraActor
// 0x0010 (0x0A20 - 0x0A10)
class ADelMarDriverCameraActor final : public ACineCameraActor
{
public:
	class USceneCaptureComponent2D*               CaptureComponent;                                  // 0x0A10(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A18[0x8];                                      // 0x0A18(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverCameraActor">();
	}
	static class ADelMarDriverCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarDriverCameraActor>();
	}
};

// Class DelMarCosmetics.DelMarDriverSequenceData
// 0x0010 (0x0040 - 0x0030)
class UDelMarDriverSequenceData final : public UDataAsset
{
public:
	class ULevelSequence*                         Sequence;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PriorityLevel;                                     // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggerReactiveWidget;                            // 0x003D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCameraCut;                                        // 0x003E(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverSequenceData">();
	}
	static class UDelMarDriverSequenceData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverSequenceData>();
	}
};

// Class DelMarCosmetics.DelMarDriverSequenceDataTable
// 0x0050 (0x0080 - 0x0030)
class UDelMarDriverSequenceDataTable final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FDelMarDriverSequenceDataList> SequenceListTable;               // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverSequenceDataTable">();
	}
	static class UDelMarDriverSequenceDataTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverSequenceDataTable>();
	}
};

// Class DelMarCosmetics.DelMarVehicleAnimInstance
// 0x0240 (0x0680 - 0x0440)
class UDelMarVehicleAnimInstance final : public UFortBaseAnimInstance
{
public:
	struct FDelMarBouncyChassisState              BouncyChassis;                                     // 0x0438(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDelMarBouncyChassisSetup              BouncyChassisSetup;                                // 0x0448(0x0058)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         BouncyChassisBlendRate;                            // 0x04A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VisualSteerAngleInterpRate;                        // 0x04A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WheelLerpSpeed;                                    // 0x04A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SuspensionInterpRate;                              // 0x04AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AirSpinAccel;                                      // 0x04B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AirSpinBrake;                                      // 0x04B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AirSpinDecayRate;                                  // 0x04B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDelMarVehicleAnimInfo                 VehicleInfo;                                       // 0x04BC(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bThrottling;                                       // 0x04C4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReversing;                                        // 0x04C5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAccelerating;                                     // 0x04C6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBraking;                                          // 0x04C7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Throttle;                                          // 0x04C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Steering;                                          // 0x04CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SteeringAngle;                                     // 0x04D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWheelsOnGround;                                   // 0x04D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ForwardSpeed;                                      // 0x04D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDriftBoostActive;                                 // 0x04DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUnderthrustActive;                                // 0x04DD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDriftActive;                                      // 0x04DE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bKickflipActive;                                   // 0x04DF(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bJumpActive;                                       // 0x04E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTurboActive;                                      // 0x04E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E2[0x2];                                      // 0x04E2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDelMarVehicleWheelAnimInfo            WheelInfoFR;                                       // 0x04E4(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDelMarVehicleWheelAnimInfo            WheelInfoFL;                                       // 0x0500(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDelMarVehicleWheelAnimInfo            WheelInfoBR;                                       // 0x051C(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDelMarVehicleWheelAnimInfo            WheelInfoBL;                                       // 0x0538(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_554[0x12C];                                    // 0x0554(0x012C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarVehicleAnimInstance">();
	}
	static class UDelMarVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarVehicleAnimInstance>();
	}
};

// Class DelMarCosmetics.DelMarWheelAnimInstance
// 0x0020 (0x0460 - 0x0440)
class UDelMarWheelAnimInstance final : public UFortBaseAnimInstance
{
public:
	uint8                                         Pad_438[0x1C];                                     // 0x0438(0x001C)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SpinDegrees;                                       // 0x0454(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarVehicleAnimInstance*             ParentAnimInstance;                                // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarWheelAnimInstance">();
	}
	static class UDelMarWheelAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarWheelAnimInstance>();
	}
};

// Class DelMarCosmetics.DelMarDriverAnimInstance
// 0x0020 (0x0460 - 0x0440)
class UDelMarDriverAnimInstance final : public UFortBaseAnimInstance
{
public:
	class ADelMarVehicle*                         BoundVehicle;                                      // 0x0438(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrifting;                                         // 0x0440(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTurboing;                                         // 0x0441(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SteeringAngle;                                     // 0x0444(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SlipAngle;                                         // 0x0448(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StableSpeed;                                       // 0x044C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DrivingSpeedThreshold;                             // 0x0450(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_454[0xC];                                      // 0x0454(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool IsDrivingSpeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverAnimInstance">();
	}
	static class UDelMarDriverAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverAnimInstance>();
	}
};

// Class DelMarCosmetics.DelMarDriverChannelBase
// 0x0060 (0x0088 - 0x0028)
class UDelMarDriverChannelBase final : public UObject
{
public:
	class UTextureRenderTarget2D*                 ViewRenderTarget;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              RenderTargetDim;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class UDelMarDriverSequenceDataTable*         SequencesTable;                                    // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           ViewPlayer;                                        // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarDioramaActor*                    ViewDiorama;                                       // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieSceneSequencePlayer*              SequencePlayer;                                    // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleSequenceFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverChannelBase">();
	}
	static class UDelMarDriverChannelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverChannelBase>();
	}
};

// Class DelMarCosmetics.DelMarDriverCosmeticPlayerComponent
// 0x0058 (0x00F8 - 0x00A0)
class UDelMarDriverCosmeticPlayerComponent final : public UPlayerStateComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class ADelMarDioramaActor>        DioramaClass;                                      // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SequenceBindingTags;                               // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class ADelMarDioramaActor*                    DioramaActor;                                      // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDelMarDriverCosmeticData              CosmeticData;                                      // 0x00D8(0x0018)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	class UDelMarDriverSequenceDataTable*         CustomizedSequencesTable;                          // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleControllerLoadoutChanged(class AFortPlayerController* PlayerController, const struct FFortAthenaLoadout& Loadout);
	void On_RepCosmeticData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverCosmeticPlayerComponent">();
	}
	static class UDelMarDriverCosmeticPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverCosmeticPlayerComponent>();
	}
};

// Class DelMarCosmetics.DelMarDriverMannequin
// 0x0000 (0x0630 - 0x0630)
class ADelMarDriverMannequin final : public AFortPlayerMannequin
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverMannequin">();
	}
	static class ADelMarDriverMannequin* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarDriverMannequin>();
	}
};

// Class DelMarCosmetics.DelMarBodyCosmeticActor
// 0x0098 (0x0360 - 0x02C8)
class ADelMarBodyCosmeticActor final : public ADelMarCosmeticActor
{
public:
	TArray<struct FDelMarVehicleWheelSetup>       FrontLeftWheelsBoneNames;                          // 0x02C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleWheelSetup>       FrontRightWheelsBoneNames;                         // 0x02D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleWheelSetup>       BackRightWheelsBoneNames;                          // 0x02E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleWheelSetup>       BackLeftWheelsBoneNames;                           // 0x02F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleBooster>          LeftBoostersInfo;                                  // 0x0308(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleBooster>          RightBoostersInfo;                                 // 0x0318(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0328(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0330(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              AnimInstanceClass;                                 // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarVehicleBodySetup*                BodySetup;                                         // 0x0340(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                WheelContactFxOffset;                              // 0x0348(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	TSubclassOf<class UAnimInstance> GetAnimInstanceClass() const;
	TArray<struct FDelMarVehicleWheelSetup> GetBackLeftWheelsBoneNames() const;
	TArray<struct FDelMarVehicleWheelSetup> GetBackRightWheelsBoneNames() const;
	const class UDelMarVehicleBodySetup* GetBodySetup() const;
	class UNiagaraComponent* GetBoosterBySocketName(const class FName& SocketName) const;
	TArray<struct FDelMarVehicleWheelSetup> GetFrontLeftWheelsBoneNames() const;
	TArray<struct FDelMarVehicleWheelSetup> GetFrontRightWheelsBoneNames() const;
	TArray<struct FDelMarVehicleBooster> GetLeftBoostersInfo() const;
	class UPhysicsAsset* GetPhysicsAsset() const;
	TArray<struct FDelMarVehicleBooster> GetRightBoostersInfo() const;
	class USkeletalMesh* GetSkeletalMesh() const;
	struct FVector GetWheelCosmeticActorOffset() const;
	TArray<struct FDelMarVehicleWheelSetup> GetWheelSetups(EDelMarVehicleWheelIndex WheelIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBodyCosmeticActor">();
	}
	static class ADelMarBodyCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarBodyCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarPreviewVehicle
// 0x05F8 (0x0888 - 0x0290)
class ADelMarPreviewVehicle final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UDelMarVehicleConfigs>      VehicleConfigsClass;                               // 0x0298(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 VehicleMeshComponent;                              // 0x02A0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDelMarVehicleCosmeticComponent*        CosmeticComponent;                                 // 0x02A8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDelMarPreviewConfigs                  PreviewConfigs;                                    // 0x02B0(0x00F8)(Edit, BlueprintVisible, Interp, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A8[0x88];                                     // 0x03A8(0x0088)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<float>                                 SpringTravelOffset;                                // 0x0430(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDelMarBouncyChassisState              BouncyChassisConfig;                               // 0x0440(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44C[0x54];                                     // 0x044C(0x0054)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(float ImpactMagnitude, const struct FVector& WorldLocation)> OnDelMarVehicleHitWall; // 0x04A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Magnitude, const struct FVector& WorldLocation)> OnDelMarVehicleHitVehicle; // 0x04B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Magnitude, const struct FVector& WorldLocation)> OnDelMarVehicleHitByVehicle; // 0x04C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D0[0x348];                                    // 0x04D0(0x0348)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnHazardHit;                                       // 0x0818(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnVehicleTeleportEntered;                          // 0x0828(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnVehicleTeleportExit;                             // 0x0838(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnVehicleAppliedTeleportRotation;                  // 0x0848(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_858[0x30];                                     // 0x0858(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool AnyWheelsOnGround() const;
	struct FDelMarBouncyChassisState GetBouncyChassisConfig() const;
	bool IsWheelOnGround(EDelMarVehicleWheelIndex WheelIndex) const;
	bool WheelsOnGround() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPreviewVehicle">();
	}
	static class ADelMarPreviewVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarPreviewVehicle>();
	}
};

// Class DelMarCosmetics.DelMarCosmeticActorSpawnLogic_Wheel
// 0x0008 (0x0030 - 0x0028)
class UDelMarCosmeticActorSpawnLogic_Wheel final : public UDelMarCosmeticActorSpawnLogic
{
public:
	bool                                          bFrontWheel;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBackWheel;                                        // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarWheelAttachPoint                       AttachPoint;                                       // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarWheelMirrorType                        MirrorType;                                        // 0x002B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyFxEligibleWheels;                             // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCosmeticActorSpawnLogic_Wheel">();
	}
	static class UDelMarCosmeticActorSpawnLogic_Wheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCosmeticActorSpawnLogic_Wheel>();
	}
};

// Class DelMarCosmetics.DelMarWheelsCosmeticActor
// 0x0008 (0x02D0 - 0x02C8)
class ADelMarWheelsCosmeticActor : public ADelMarCosmeticActor
{
public:
	EDelMarVehicleWheelIndex                      WheelIndex;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	EDelMarWheelMirrorType GetMirrorType() const;
	bool IsBackWheel() const;
	bool IsFrontWheel() const;
	bool IsLeftWheel() const;
	bool IsMirrored() const;
	bool IsRightWheel() const;
	bool IsWheelOnGround() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarWheelsCosmeticActor">();
	}
	static class ADelMarWheelsCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarWheelsCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarWheelSKCosmeticActor
// 0x0008 (0x02D8 - 0x02D0)
class ADelMarWheelSKCosmeticActor final : public ADelMarWheelsCosmeticActor
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarWheelSKCosmeticActor">();
	}
	static class ADelMarWheelSKCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarWheelSKCosmeticActor>();
	}
};

}

