#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DiscoverSearchView

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DiscoverSearchView.DiscoverSearchView_C
// 0x00A8 (0x04A8 - 0x0400)
class UDiscoverSearchView_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortDiscoverSearchViewModel*           FortDiscoverSearchViewModel;                       // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortDiscoverBrowseViewModel*           FortDiscoverBrowseViewModel;                       // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserBrowseView_VM_C*        ActivityBrowserBrowseView_VM;                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SoftEdgeGradient_Islands;                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NebulousBackground;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             ResultsGrid;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichResultsText;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            SearchResult_Switcher;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             SearchSpinner;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_CategoriesOrSearch;                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortActivityTileView*                  TileView_IslandsResults;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_NoResultsMessage_C*      WBP_BlockedIslandResult;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BottomBarDecoyButton_C*            WBP_BottomBarHack_Back;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BottomBarDecoyButton_C*            WBP_BottomBarHack_BackToTop;                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingMorePages_C*                WBP_LoadingMorePages;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_NoResultsMessage_C*      WBP_NoResults;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_SearchBar_C*                 WBP_UIKit_SearchBar;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             IntroWhooshSound;                                  // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSearchActive;                                    // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Switch_Between_Browse_And_Search_Views(bool IsSearchActive_0);
	void TopLevelTabChanged(const EFortUIFeature LeavingFeature, const EFortUIFeature EnteringFeature);
	void SetSearchResults(TArray<class UFortActivityViewModel*>& SearchResultsArray);
	void SetSearchInProgress(bool SearchInProgress);
	void SetResultsTerm(const class FString& ResultsTerm);
	void Set_Browse_View_VM();
	void PreConstruct(bool IsDesignTime);
	void OnTileViewScrolled(float ItemOffset, float DistanceRemaining);
	void OnQueryingMorePages(bool IsQueryingNewPages);
	void OnBackToTopClickedCategory();
	void On_Update_Providers(TArray<class UFortDiscoverProviderViewModel*>& ProvidersVM);
	class UWidget* NavigateUpToTextEntry(EUINavigation Navigation_0);
	class UWidget* NavigateDownToBrowseOrSearch(EUINavigation Navigation_0);
	void IsFullsizedOnScreen(class UWidget* Widget, bool* IsFullsized);
	void ExecuteUbergraph_DiscoverSearchView(int32 EntryPoint);
	void Construct();
	void BP_OnDeactivated();
	void BP_OnActivated();
	void BndEvt__DiscoverSearchView_WBP_UIKit_SearchBar_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__DiscoverSearchView_WBP_UIKit_SearchBar_K2Node_ComponentBoundEvent_5_OnTextCommited__DelegateSignature(const class FText& Text, ETextCommit Commit_method);
	void BndEvt__DiscoverSearchView_WBP_UIKit_SearchBar_K2Node_ComponentBoundEvent_4_OnTextChanged__DelegateSignature(const class FText& Text);
	void BndEvt__DiscoverSearchView_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__DiscoverSearchView_WBP_BottomBarHack_Back_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__DiscoverSearchView_TileView_IslandsResults_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DiscoverSearchView_C">();
	}
	static class UDiscoverSearchView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverSearchView_C>();
	}
};

}

