#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DynamicCapsuleCodeRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// ScriptStruct DynamicCapsuleCodeRuntime.DynamicCapsuleState
// 0x0010 (0x0010 - 0x0000)
struct FDynamicCapsuleState final
{
public:
	float                                         CapsuleRadius;                                     // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CapsuleHalfHeight;                                 // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RelativeMeshHeight;                                // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DynamicCapsuleCodeRuntime.DynamicCapsuleEntry
// 0x0018 (0x0018 - 0x0000)
struct FDynamicCapsuleEntry final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDynamicCapsuleState                   State;                                             // 0x0008(0x0010)(Transient, NoDestructor, NativeAccessSpecifierPublic)
};

}

