#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DynamicBacchusHUD

#include "Basic.hpp"

#include "DynamicUI_structs.hpp"
#include "DynamicUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// Class DynamicBacchusHUD.DynamicBacchusHUDDirector
// 0x01C8 (0x0478 - 0x02B0)
class ADynamicBacchusHUDDirector final : public ADynamicUIDirectorBase
{
public:
	struct FDynamicUIWidgetTarget                 TouchControlRegionWidget;                          // 0x02B0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortMobileHUDWidgetRegistry*           BaseHUDWidgetRegistry;                             // 0x0310(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicUIScene*                        WatermarkScene;                                    // 0x0318(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UDynamicUIMobileScene*> ScenesPool;                              // 0x0320(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortMobileHUDWidgetRegistry*           HUDWidgetRegistry;                                 // 0x0370(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0xA0];                                     // 0x0378(0x00A0)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  CurrentContextTags;                                // 0x0418(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FFortMobileHUDLayoutProfile            LayoutProfile;                                     // 0x0438(0x0040)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicBacchusHUDDirector">();
	}
	static class ADynamicBacchusHUDDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicBacchusHUDDirector>();
	}
};

// Class DynamicBacchusHUD.DynamicUIMobileScene
// 0x00C0 (0x0138 - 0x0078)
class UDynamicUIMobileScene final : public UDynamicUIScene
{
public:
	uint8                                         Pad_78[0xC0];                                      // 0x0078(0x00C0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicUIMobileScene">();
	}
	static class UDynamicUIMobileScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicUIMobileScene>();
	}
};

}

