#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EnergyRuntime

#include "Basic.hpp"

#include "ModularGameplay_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "EnergyRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class EnergyRuntime.FortComponent_Energy
// 0x0248 (0x02E8 - 0x00A0)
class UFortComponent_Energy : public UPawnComponent
{
public:
	TMulticastInlineDelegate<void(class UFortComponent_Energy* EnergyComponent)> OnEnergyCompletelyDrained; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortComponent_Energy* EnergyComponent)> OnEnergyRechargeComplete; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxEnergy;                                         // 0x00C0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      RechargeDisabledQuery;                             // 0x00E8(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagQuery                      EnergyUseDisabledQuery;                            // 0x0140(0x0048)(NativeAccessSpecifierPrivate)
	struct FTimerHandle                           BeginRechargeTimerHandle;                          // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  EnergyTypeIdentifierTagContainer;                  // 0x0190(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         CurrentEnergy;                                     // 0x01B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         NetEnergyDeltaPerSecond;                           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         MinEnergyForUsing;                                 // 0x01C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RechargeAmountPerSecond;                           // 0x01E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RechargeDelayInSeconds;                            // 0x0210(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RechargePercentageLimit;                           // 0x0238(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FEnergyChannelingData>          ActiveEnergyChannels;                              // 0x0260(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FEnergyChannelingData>          NewActiveEnergyChannels;                           // 0x0270(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FEnergyRegenOverrideData>       EnergyRegenOverrides;                              // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UFortComponent_Energy* EnergyComponent, float PreviousValue)> OnCurrentEnergyChanged; // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UFortComponent_Energy* EnergyComponent)> OnEnergyRechargeBegun; // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UFortComponent_Energy* EnergyComponent)> OnEnergyRechargeInterrupted; // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UFortComponent_Energy* EnergyComponent)> OnEnergyReachedMax; // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UFortComponent_Energy* EnergyComponent)> OnEnergyReachedMinForUsing; // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         bRechargingEnabled : 1;                            // 0x02E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsRecharging : 1;                                 // 0x02E0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsUsingEnergy : 1;                                // 0x02E0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool AddEnergy(float* OutAmountOfEnergyAdded, float AmountOfEnergyToAdd, class UObject* OptionalEnergySource, bool bBroadcastEnergyPercentChanged);
	void ApplyRegenDataOverride(const struct FGameplayTag& RegenOverrideIdentifier, const float NewRechargeAmountPerSecond, const float NewRechargeDelayInSeconds, const float NewRechargePercentageLimit);
	void HandleAbilitySystemComponentInitialized(class UFortAbilitySystemComponent* AbilitySystemComponent, class AFortPlayerPawn* PlayerPawn);
	void HandleAbilitySystemComponentInvalidated();
	void OnMutatorUpdated();
	void OnPlayerStatePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void RegisterMutatorUpdatedDelegate(class APawn* AffectedPawn);
	bool RemoveRegenDataOverride(const struct FGameplayTag& RegenOverrideIdentifier);
	bool SetAllEnergyUsageFree(bool bShouldEnergyUsageBeFree);
	bool StartAddingEnergy(float EnergyToAddPerSecond, const struct FGameplayTag& EnergySourceIdentifier, class UObject* OptionalEnergySource);
	bool StartUsingEnergy(float EnergyToUseToStart, float EnergyToUsePerSecond, const struct FGameplayTag& EnergyUseIdentifier, class UObject* OptionalEnergyUser);
	bool StopAddingEnergy(const struct FGameplayTag& EnergyUseIdentifier, class UObject* OptionalEnergySource);
	bool StopUsingEnergy(const struct FGameplayTag& EnergyUseIdentifier, class UObject* OptionalEnergyUser);
	bool UseEnergy(float* OutAmountOfEnergyUsed, float AmountOfEnergyToUse, bool bUseEnergyEvenOnFailure, class UObject* OptionalEnergyUser, bool bBroadcastEnergyPercentChanged);

	float GetCurrentEnergyPercentage() const;
	bool HasSufficientEnergy(float EnergyAmountToTest) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortComponent_Energy">();
	}
	static class UFortComponent_Energy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortComponent_Energy>();
	}
};

}

