#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EntityActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EntityActor_structs.hpp"
#include "EntityCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class EntityActor.EntityAbilityInterface
// 0x0000 (0x0000 - 0x0000)
class IEntityAbilityInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityAbilityInterface">();
	}
	static class IEntityAbilityInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEntityAbilityInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class EntityActor.EntityActorCustomReplicationComponent
// 0x0008 (0x0060 - 0x0058)
class UEntityActorCustomReplicationComponent final : public UEntityComponent
{
public:
	EEntityActorReplicationOverrideType           ReplicationOverride;                               // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEntityActorReplicationRelevancyBucketType    ReplicationRelevancyBucketType;                    // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CustomReplicationRelevancyRange;                   // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorCustomReplicationComponent">();
	}
	static class UEntityActorCustomReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorCustomReplicationComponent>();
	}
};

// Class EntityActor.SimObject
// 0x0008 (0x0298 - 0x0290)
class ASimObject final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimObject">();
	}
	static class ASimObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASimObject>();
	}
};

// Class EntityActor.ActorToEntityAdapterComponent
// 0x0020 (0x00C0 - 0x00A0)
class UActorToEntityAdapterComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UEntityComponent*>               SerializedComponents;                              // 0x00A8(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         bForceOwnerReplication : 1;                        // 0x00B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorToEntityAdapterComponent">();
	}
	static class UActorToEntityAdapterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorToEntityAdapterComponent>();
	}
};

// Class EntityActor.EntityActorComponent
// 0x0030 (0x0088 - 0x0058)
class UEntityActorComponent : public UEntityComponent
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UActorComponent*                        ActorComponent;                                    // 0x0060(0x0008)(Edit, ExportObject, Net, ZeroConstructor, EditConst, InstancedReference, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCreatedActorComponent;                            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_69[0x1F];                                      // 0x0069(0x001F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_ActorComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorComponent">();
	}
	static class UEntityActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorComponent>();
	}
};

// Class EntityActor.EntityActorSubsystem
// 0x0038 (0x0068 - 0x0030)
class UEntityActorSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorSubsystem">();
	}
	static class UEntityActorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorSubsystem>();
	}
};

// Class EntityActor.EntityDynamicActivationComponent
// 0x0038 (0x00B0 - 0x0078)
class UEntityDynamicActivationComponent : public UEntityEnableableComponent
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         TransitionTargetTime;                              // 0x0080(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTargetState;                                      // 0x0084(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UEntityComponent*>               LinkedComponents;                                  // 0x0088(0x0010)(Net, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x18];                                      // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnEnabledChanged(bool bIsEnabled);
	void OnRep_TransitionTarget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityDynamicActivationComponent">();
	}
	static class UEntityDynamicActivationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityDynamicActivationComponent>();
	}
};

// Class EntityActor.EntityToActorAdapterComponent
// 0x0008 (0x0060 - 0x0058)
class UEntityToActorAdapterComponent final : public UEntityComponent
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityToActorAdapterComponent">();
	}
	static class UEntityToActorAdapterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityToActorAdapterComponent>();
	}
};

// Class EntityActor.EntityActorLocalInputComponent
// 0x0008 (0x0060 - 0x0058)
class UEntityActorLocalInputComponent final : public UEntityComponent
{
public:
	EAutoReceiveInput                             AutoReceiveControllerInput;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorLocalInputComponent">();
	}
	static class UEntityActorLocalInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorLocalInputComponent>();
	}
};

// Class EntityActor.EntityActorCollisionComponent
// 0x0078 (0x00F0 - 0x0078)
class UEntityActorCollisionComponent : public UEntityEnableableComponent
{
public:
	uint8                                         Pad_78[0x48];                                      // 0x0078(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   ShadowVar_CollisionProfileName;                    // 0x00C0(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UPrimitiveComponent>     PrimitiveComponentCache;                           // 0x00C8(0x0020)(ExportObject, Net, Transient, InstancedReference, RepNotify, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x2];                                       // 0x00E8(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	ECollisionShapeMode                           CollisionShapeMode;                                // 0x00EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnEnabledChanged(bool bIsEnabled);
	void OnNativeComponentBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnNativeComponentEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnNativeComponentHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnRep_CollisionProfileName();
	void OnRep_PrimitiveComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorCollisionComponent">();
	}
	static class UEntityActorCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorCollisionComponent>();
	}
};

// Class EntityActor.EntityActorPlayerComponent
// 0x0070 (0x00D0 - 0x0060)
class UEntityActorPlayerComponent : public UEntityDataBackedComponent
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0060(0x0030)(Net, Transient, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class APlayerController>       PlayerControllerCache;                             // 0x0090(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class APlayerState>            PlayerStateCache;                                  // 0x00B0(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_PlayerId();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorPlayerComponent">();
	}
	static class UEntityActorPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorPlayerComponent>();
	}
};

// Class EntityActor.EntityActorSkeletalMeshRenderComponent
// 0x0020 (0x0078 - 0x0058)
class UEntityActorSkeletalMeshRenderComponent : public UEntityComponent
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bAddedMeshRenderComponent;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USkeletalMesh*                          ShadowVar_SkeletalMesh;                            // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECollisionEnabled                             ShadowVar_EnableCollision;                         // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorSkeletalMeshRenderComponent">();
	}
	static class UEntityActorSkeletalMeshRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorSkeletalMeshRenderComponent>();
	}
};

// Class EntityActor.EntityActorStaticMeshRenderComponent
// 0x0018 (0x00A0 - 0x0088)
class UEntityActorStaticMeshRenderComponent : public UEntityActorComponent
{
public:
	TArray<class UMaterialInterface*>             ShadowVar_MeshMaterials;                           // 0x0088(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	ECollisionEnabled                             ShadowVar_EnableCollision;                         // 0x0098(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ShadowVar_MaxDrawDistance;                         // 0x009C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_EnableCollision();
	void OnRep_MaxDrawDistance();
	void OnRep_MeshMaterials();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorStaticMeshRenderComponent">();
	}
	static class UEntityActorStaticMeshRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorStaticMeshRenderComponent>();
	}
};

// Class EntityActor.EntityActorTextDisplayComponent
// 0x0028 (0x00B0 - 0x0088)
class UEntityActorTextDisplayComponent final : public UEntityActorComponent
{
public:
	class FText                                   DisplayText;                                       // 0x0088(0x0018)(Edit, Net, RepNotify, NativeAccessSpecifierPrivate)
	float                                         ShadowVar_WorldSize;                               // 0x00A0(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 ShadowVar_TextRenderColor;                         // 0x00A4(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAddedTextRenderComponent;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	EHorizTextAligment GetHorizontalAlignment();
	struct FVector GetRelativeLocation();
	EVerticalTextAligment GetVerticalAlignment();
	void OnRep_DisplayText();
	void OnRep_TextRenderColor();
	void OnRep_WorldSize();
	void SetHorizontalAlignment(EHorizTextAligment Value);
	void SetRelativeLocation(const struct FVector& RelativeLocation);
	void SetRelativeRotation(const struct FRotator& RelativeRotation);
	void SetRelativeScale(const struct FVector& RelativeScale);
	void SetText(const class FText& Text);
	void SetTextRenderColor(const struct FColor& Value);
	void SetVerticalAlignment(EVerticalTextAligment Value);
	void SetWorldSize(float Value);

	class FText GetText() const;
	struct FColor GetTextRenderColor() const;
	float GetWorldSize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorTextDisplayComponent">();
	}
	static class UEntityActorTextDisplayComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorTextDisplayComponent>();
	}
};

// Class EntityActor.EntityActorPositionComponent
// 0x0020 (0x0080 - 0x0060)
class UEntityActorPositionComponent : public UEntityPositionComponent
{
public:
	struct FVector                                ShadowVar_Location;                                // 0x0060(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRootComponentChanged(class USceneComponent* InRootComponent, bool bIsRootComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorPositionComponent">();
	}
	static class UEntityActorPositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorPositionComponent>();
	}
};

// Class EntityActor.EntityActorRotationComponent
// 0x0028 (0x0088 - 0x0060)
class UEntityActorRotationComponent : public UEntityRotationComponent
{
public:
	struct FRotator                               ShadowVar_Rotation;                                // 0x0060(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRootComponentChanged(class USceneComponent* InRootComponent, bool bIsRootComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorRotationComponent">();
	}
	static class UEntityActorRotationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorRotationComponent>();
	}
};

// Class EntityActor.EntityActorScaleComponent
// 0x0020 (0x0080 - 0x0060)
class UEntityActorScaleComponent : public UEntityScaleComponent
{
public:
	struct FVector                                ShadowVar_Scale;                                   // 0x0060(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRootComponentChanged(class USceneComponent* InRootComponent, bool bIsRootComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityActorScaleComponent">();
	}
	static class UEntityActorScaleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorScaleComponent>();
	}
};

}

