#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EpicGamesTemporary_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RAngularDistance_L_Nrotation_M_Nrotation_R
// 0x0050 (0x0050 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RAngularDistance_L_Nrotation_M_Nrotation_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument;           // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R
// 0x0048 (0x0048 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R
// 0x0050 (0x0050 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument;           // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Lvector2i_Mvector2i_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R
// 0x0288 (0x0288 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Lvector2i_Mvector2i_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	TOptional<struct FSpatialMath_vector2i>       RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EVerseFalse                                   _ExprResult_0;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2i                  _ExprResult_1;                                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_2;                                // 0x0050(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_5;                                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_6;                                // 0x00C8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_7;                                // 0x00D8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_8;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_9;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_10;                                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_11;                               // 0x0118(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_12;                               // 0x0128(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_13;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_15;                                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2i                  _ExprResult_16;                                    // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_17;                               // 0x0178(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_18;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_20;                                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_21;                               // 0x01F0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_22;                               // 0x0200(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x0218(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_24;                                    // 0x0228(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_25;                                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_26;                               // 0x0240(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_27;                               // 0x0250(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_28;                                    // 0x0268(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_29;                                    // 0x0278(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation
// 0x0030 (0x0030 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation final
{
public:
	struct EpicGamesTemporary_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R
// 0x0078 (0x0078 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0028(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<double>                             _ExprResultStack_1;                                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_2;                                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<double>                             _ExprResultStack_4;                                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_5;                                // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R
// 0x00A8 (0x00A8 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0038(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<double>                             _ExprResultStack_1;                                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_2;                                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_3;                                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<double>                             _ExprResultStack_5;                                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_6;                                // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_7;                                // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R
// 0x01D8 (0x01D8 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0038(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	double                                        _ExprResultStack_3;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x00B0(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_5;                        // 0x00C0(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_6;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x00E0(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_8;                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_9;                                // 0x0108(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x0158(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0168(0x0010)(HasGetValueTypeHash)
	double                                        _ExprResultStack_12;                               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x0180(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_14;                       // 0x0190(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_15;                               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x01B0(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_17;                       // 0x01C0(0x0018)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R
// 0x0270 (0x0270 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0050(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00C0(0x0010)(HasGetValueTypeHash)
	double                                        _ExprResultStack_4;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x00D8(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_6;                        // 0x00E8(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_7;                                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0108(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_9;                        // 0x0118(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_10;                               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0138(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_12;                       // 0x0148(0x0018)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_13;                               // 0x0160(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x01C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	double                                        _ExprResultStack_17;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x01E8(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_19;                       // 0x01F8(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_20;                               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x0218(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_22;                       // 0x0228(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_23;                               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_24;                                        // 0x0248(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_25;                       // 0x0258(0x0018)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mfloat_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;          // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         RetVal;                                            // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R
// 0x0060 (0x0060 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument;           // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0040(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R
// 0x0050 (0x0050 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes
// 0x0120 (0x0120 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes final
{
public:
	struct EpicGamesTemporary_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0020(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x00A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R
// 0x0108 (0x0108 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R final
{
public:
	struct Ftuple_Lfloat_Mvector2_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0028(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x0098(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00F8(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R
// 0x0138 (0x0138 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R final
{
public:
	struct Ftuple_Lfloat_Mvector3_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0038(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x00B8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0108(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0128(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R
// 0x0108 (0x0108 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R final
{
public:
	struct Ftuple_Lint_Mvector2i_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                  RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0028(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x0098(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00F8(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R
// 0x0108 (0x0108 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector2_Mfloat_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0028(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x0098(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00F8(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R
// 0x0108 (0x0108 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R final
{
public:
	struct Ftuple_Lvector2i_Mint_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                  RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0028(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x0098(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00F8(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R
// 0x0138 (0x0138 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mfloat_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0038(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x00B8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0108(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0128(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R
// 0x0148 (0x0148 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0048(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x00C8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0138(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R
// 0x0110 (0x0110 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0030(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x00A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R
// 0x0110 (0x0110 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Lvector2i_Mvector2i_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                  RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0030(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x00A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R
// 0x0148 (0x0148 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0048(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x00C8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0138(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R
// 0x0110 (0x0110 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0030(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x00A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R
// 0x0110 (0x0110 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Lvector2i_Mvector2i_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                  RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0030(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x00A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R
// 0x0148 (0x0148 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;             // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0048(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x00C8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0138(0x0010)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
// 0x02B0 (0x02B0 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mtuple_L_R_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0050(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                    // 0x0060(0x0050)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_2;                                     // 0x00B0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         _ExprResultStack_3;                                // 0x00C0(0x0020)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x00E0(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lvector3_Mfloat_R               _ExprResult_5;                                     // 0x00F0(0x0020)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_6;                                // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0128(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;             // 0x0140(0x0030)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_9;                                     // 0x0170(0x0001)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_10;                                    // 0x0171(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0178(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_12;                                   // 0x0190(0x0050)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_13;                                    // 0x01E0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_1E1[0xF];                                      // 0x01E1(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         _ExprResultStack_14;                               // 0x01F0(0x0020)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x0210(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lvector3_Mfloat_R               _ExprResult_16;                                    // 0x0220(0x0020)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_17;                               // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0258(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_19;            // 0x0270(0x0030)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_20;                                    // 0x02A0(0x0001)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_21;                                    // 0x02A1(0x0001)(HasGetValueTypeHash)
};

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
// 0x02B0 (0x02B0 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R final
{
public:
	struct Ftuple_Lrotation_Mtuple_L_R_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0050(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                    // 0x0060(0x0050)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_2;                                     // 0x00B0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         _ExprResultStack_3;                                // 0x00C0(0x0020)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x00E0(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lvector3_Mfloat_R               _ExprResult_5;                                     // 0x00F0(0x0020)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_6;                                // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0128(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;             // 0x0140(0x0030)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_9;                                     // 0x0170(0x0001)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_10;                                    // 0x0171(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0178(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_12;                                   // 0x0190(0x0050)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_L_R       _ExprResult_13;                                    // 0x01E0(0x0001)(HasGetValueTypeHash)
