#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EpicGamesEngine

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct EpicGamesEngine.VerseActionMapping
// 0x0024 (0x0030 - 0x000C)
struct FVerseActionMapping final : public FFastArraySerializerItem
{
public:
	class FName                                   Name;                                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UIText;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           Keys;                                              // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EpicGamesEngine.VerseActionMappingArray
// 0x0018 (0x0120 - 0x0108)
struct FVerseActionMappingArray final : public FFastArraySerializer
{
public:
	TArray<struct FVerseActionMapping>            ActionMappingArray;                                // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UVerseUEInputComponentBase*             OwningComponent;                                   // 0x0118(0x0008)(ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct EpicGamesEngine.VerseAxisMapping
// 0x002C (0x0038 - 0x000C)
struct FVerseAxisMapping final : public FFastArraySerializerItem
{
public:
	class FName                                   AxisName;                                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 UIText;                                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           Keys;                                              // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EpicGamesEngine.VerseAxisMappingArray
// 0x0018 (0x0120 - 0x0108)
struct FVerseAxisMappingArray final : public FFastArraySerializer
{
public:
	TArray<struct FVerseAxisMapping>              AxisMappingArray;                                  // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UVerseUEInputComponentBase*             OwningComponent;                                   // 0x0118(0x0008)(ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct EpicGamesEngine.VerseInputBinding
// 0x0010 (0x001C - 0x000C)
struct FVerseInputBinding final : public FFastArraySerializerItem
{
public:
	class FName                                   Name;                                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0xB];                                       // 0x0011(0x000B)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct EpicGamesEngine.VerseInputBindingArray
// 0x0018 (0x0120 - 0x0108)
struct FVerseInputBindingArray final : public FFastArraySerializer
{
public:
	TArray<struct FVerseInputBinding>             InputBindingArray;                                 // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UVerseUEInputComponentBase*             OwningComponent;                                   // 0x0118(0x0008)(ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

}

