#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EpicGamesEngine

#include "Basic.hpp"

#include "EntityActor_classes.hpp"
#include "EpicGamesEngine_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class EpicGamesEngine.VerseUEInputComponentBase
// 0x0370 (0x0440 - 0x00D0)
class UVerseUEInputComponentBase : public UEntityActorPlayerComponent
{
public:
	class UInputComponent*                        InputComponent;                                    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVerseActionMappingArray               ReplicatedActionMappingArray;                      // 0x00D8(0x0120)(Net, NativeAccessSpecifierPrivate)
	struct FVerseAxisMappingArray                 ReplicatedAxisMappingArray;                        // 0x01F8(0x0120)(Net, NativeAccessSpecifierPrivate)
	struct FVerseInputBindingArray                ReplicatedInputBindingArray;                       // 0x0318(0x0120)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ServerTriggerAction(const class FName& ActionName, EInputEvent InputEvent);
	void ServerTriggerAxis(const class FName& AxisName, float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseUEInputComponentBase">();
	}
	static class UVerseUEInputComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseUEInputComponentBase>();
	}
};

}

