#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EpicStreamMediaSource

#include "Basic.hpp"

#include "MediaUtils_structs.hpp"
#include "EpicMediaUtilities_structs.hpp"
#include "EpicStreamMediaSource_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EpicStreamMediaSource.EpicStreamMediaSource.CancelVideoUrlRequest
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_CancelVideoUrlRequest final
{
public:
	bool                                          bInCancelled;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.ForceSegmentCaching
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_ForceSegmentCaching final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.IsScreenRecordingInProgress
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_IsScreenRecordingInProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.MetadataResultHandler
// 0x02E0 (0x02E0 - 0x0000)
struct EpicStreamMediaSource_MetadataResultHandler final
{
public:
	struct FEpicMediaMetadataExt                  MetaData;                                          // 0x0000(0x02D8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x02D8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.RequestVideoUrl
// 0x0008 (0x0008 - 0x0000)
struct EpicStreamMediaSource_RequestVideoUrl final
{
public:
	const class APlayerController*                FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.SetLocalizedOverlaysV2
// 0x0008 (0x0008 - 0x0000)
struct EpicStreamMediaSource_SetLocalizedOverlaysV2 final
{
public:
	class UEpicMediaDownloadLocalizedOverlays*    InOverlays;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.SetPlaybackStartTime
// 0x0004 (0x0004 - 0x0000)
struct EpicStreamMediaSource_SetPlaybackStartTime final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.SetSyncTimes
// 0x0020 (0x0020 - 0x0000)
struct EpicStreamMediaSource_SetSyncTimes final
{
public:
	struct FDateTime                              InNowTime;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              InStartTime;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DynamicStart;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         InOffset_s;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDelay_s;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.SetUrl
// 0x0010 (0x0010 - 0x0000)
struct EpicStreamMediaSource_SetUrl final
{
public:
	class FString                                 InURL;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.ShouldProtectPlayerFromContent
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_ShouldProtectPlayerFromContent final
{
public:
	EUCPTypes                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.HasLocalFilePlayback
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_HasLocalFilePlayback final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.ShouldStreamBePlaying
// 0x0018 (0x0018 - 0x0000)
struct EpicStreamMediaSource_ShouldStreamBePlaying final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPrimitiveComponent*              PrimitiveComponent;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullRadius;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.UpdatePlayerOptions
// 0x0060 (0x0060 - 0x0000)
struct EpicStreamMediaSource_UpdatePlayerOptions final
{
public:
	struct FMediaPlayerOptions                    PlayerOptions;                                     // 0x0000(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMediaPlayerOptions                    ReturnValue;                                       // 0x0030(0x0030)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

}

