#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EventTeamMatchHistoryStatNumberedIcon

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventTeamMatchHistoryStatNumberedIcon.EventTeamMatchHistoryStatNumberedIcon_C
// 0x0030 (0x02F0 - 0x02C0)
class UEventTeamMatchHistoryStatNumberedIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_StatType;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            StatColor;                                         // 0x02D8(0x0014)(Edit, BlueprintVisible)
	bool                                          bSetTextColor;                                     // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Set_Unhovered_Event();
	void Set_Stat_Text(const class FText& NewText);
	void Set_Hovered_Event();
	void Finished_18DAC6754588A4D0529A24A1839FCC9E();
	void ExecuteUbergraph_EventTeamMatchHistoryStatNumberedIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTeamMatchHistoryStatNumberedIcon_C">();
	}
	static class UEventTeamMatchHistoryStatNumberedIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventTeamMatchHistoryStatNumberedIcon_C>();
	}
};

}

