#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EventTeamMatchHistoryStatNumberedIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function EventTeamMatchHistoryStatNumberedIcon.EventTeamMatchHistoryStatNumberedIcon_C.Set Stat Text
// 0x0018 (0x0018 - 0x0000)
struct EventTeamMatchHistoryStatNumberedIcon_C_Set_Stat_Text final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function EventTeamMatchHistoryStatNumberedIcon.EventTeamMatchHistoryStatNumberedIcon_C.ExecuteUbergraph_EventTeamMatchHistoryStatNumberedIcon
// 0x0048 (0x0048 - 0x0000)
struct EventTeamMatchHistoryStatNumberedIcon_C_ExecuteUbergraph_EventTeamMatchHistoryStatNumberedIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_CustomEvent_NewText;                        // 0x0030(0x0018)()
};

}

