#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FabricRuntime

#include "Basic.hpp"

#include "MetasoundEngine_structs.hpp"
#include "PlayspaceSystem_structs.hpp"
#include "HarmonixMidi_structs.hpp"
#include "Engine_structs.hpp"
#include "FabricRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayMessages_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "HarmonixMetasound_structs.hpp"


namespace SDK::Params
{

// Function FabricRuntime.FabricModulatable.OnModulatedPropertyChanged
// 0x0018 (0x0018 - 0x0000)
struct FabricModulatable_OnModulatedPropertyChanged final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ModulatorObject;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricModulatable.OnModulatorFloatProviderConnectionChanged
// 0x0010 (0x0010 - 0x0000)
struct FabricModulatable_OnModulatorFloatProviderConnectionChanged final
{
public:
	bool                                          bConnected;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                ModulatorObject;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricModulatable.GetModulatedActor
// 0x0008 (0x0008 - 0x0000)
struct FabricModulatable_GetModulatedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricModulatable.GetModulatedBool
// 0x0058 (0x0058 - 0x0000)
struct FabricModulatable_GetModulatedBool final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiSongPos                           SongPos;                                           // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          OutBool;                                           // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0051(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricModulatable.GetModulatedEnum
// 0x0058 (0x0058 - 0x0000)
struct FabricModulatable_GetModulatedEnum final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiSongPos                           SongPos;                                           // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         OutEnum;                                           // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0051(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricModulatable.GetModulatedFloat
// 0x0058 (0x0058 - 0x0000)
struct FabricModulatable_GetModulatedFloat final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiSongPos                           SongPos;                                           // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         OutFloat;                                          // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0054(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricModulatable.GetModulatedInt
// 0x0058 (0x0058 - 0x0000)
struct FabricModulatable_GetModulatedInt final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiSongPos                           SongPos;                                           // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         OutInt;                                            // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0054(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricModulatable.GetModulatedString
// 0x0068 (0x0068 - 0x0000)
struct FabricModulatable_GetModulatedString final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiSongPos                           SongPos;                                           // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 OutString;                                         // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricModulatable.GetModulator
// 0x0020 (0x0020 - 0x0000)
struct FabricModulatable_GetModulator final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IFabricModulator>      ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricModulatable.IsParamModulated
// 0x0018 (0x0018 - 0x0000)
struct FabricModulatable_IsParamModulated final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricButtonBase.GetCloseTimeline
// 0x0008 (0x0008 - 0x0000)
struct FabricButtonBase_GetCloseTimeline final
{
public:
	class UTimelineComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.GetOpenTimeline
// 0x0008 (0x0008 - 0x0000)
struct FabricButtonBase_GetOpenTimeline final
{
public:
	class UTimelineComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonBase_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.IsHovered
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonBase_IsHovered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.IsPressed
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonBase_IsPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.IsToggledOn
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonBase_IsToggledOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.OnToggleStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonBase_OnToggleStateChanged final
{
public:
	bool                                          bIsToggled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonBase_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.SetToggleState
// 0x0003 (0x0003 - 0x0000)
struct FabricButtonBase_SetToggleState final
{
public:
	bool                                          bNewToggleState;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBroadcast;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonBase.SetWidgetViewModel
// 0x0008 (0x0008 - 0x0000)
struct FabricButtonBase_SetWidgetViewModel final
{
public:
	class UFabricInteractableViewModel*           ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.GetCloseTimeline
// 0x0008 (0x0008 - 0x0000)
struct FabricButtonComponentBase_GetCloseTimeline final
{
public:
	class UTimelineComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.GetOpenTimeline
// 0x0008 (0x0008 - 0x0000)
struct FabricButtonComponentBase_GetOpenTimeline final
{
public:
	class UTimelineComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonComponentBase_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.IsHovered
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonComponentBase_IsHovered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.IsPressed
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonComponentBase_IsPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.IsToggledOn
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonComponentBase_IsToggledOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.OnToggleStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonComponentBase_OnToggleStateChanged final
{
public:
	bool                                          bIsToggled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct FabricButtonComponentBase_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.SetToggleState
// 0x0003 (0x0003 - 0x0000)
struct FabricButtonComponentBase_SetToggleState final
{
public:
	bool                                          bNewToggleState;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBroadcast;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricButtonComponentBase.SetWidgetViewModel
// 0x0008 (0x0008 - 0x0000)
struct FabricButtonComponentBase_SetWidgetViewModel final
{
public:
	class UFabricInteractableViewModel*           ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.ApplyPage
// 0x0018 (0x0018 - 0x0000)
struct FabricStepSequencerComponent_ApplyPage final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FStepSequencePage                      PageData;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.ApplyTemplate
// 0x0010 (0x0010 - 0x0000)
struct FabricStepSequencerComponent_ApplyTemplate final
{
public:
	const class UMidiStepSequence*                Template;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StepSequencePageIndex;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.ClearPage
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_ClearPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetContinuationFocusIndeces
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_GetContinuationFocusIndeces final
{
public:
	int32                                         OutRowIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutStepIndex;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutNumContinuationSteps;                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetMidiStepSequence
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_GetMidiStepSequence final
{
public:
	class UMidiStepSequence*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.RandomizePage
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_RandomizePage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetBeatScale
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_SetBeatScale final
{
public:
	float                                         BeatScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetCurrentPage
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_SetCurrentPage final
{
public:
	int32                                         NewPage;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetLoop
// 0x0001 (0x0001 - 0x0000)
struct FabricStepSequencerComponent_SetLoop final
{
public:
	bool                                          bNewLoop;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetMaxSteps
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_SetMaxSteps final
{
public:
	int32                                         NumSteps;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetMonophonic
// 0x0001 (0x0001 - 0x0000)
struct FabricStepSequencerComponent_SetMonophonic final
{
public:
	bool                                          bNewMonophonic;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetMusicClock
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_SetMusicClock final
{
public:
	class UMusicClockComponent*                   InMusicClock;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetNoteForTrack
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_SetNoteForTrack final
{
public:
	struct FMidiNote                              Note;                                              // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Track;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetNoteStyle
// 0x0001 (0x0001 - 0x0000)
struct FabricStepSequencerComponent_SetNoteStyle final
{
public:
	EFabricNoteStyle                              style;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetNumberPages
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_SetNumberPages final
{
public:
	int32                                         NumPages;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetNumberSteps
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_SetNumberSteps final
{
public:
	int32                                         NumSteps;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetNumberTracks
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_SetNumberTracks final
{
public:
	int32                                         NumTracks;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetPlaying
// 0x0001 (0x0001 - 0x0000)
struct FabricStepSequencerComponent_SetPlaying final
{
public:
	bool                                          bNewPlaying;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetQuarterNotesLength
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_SetQuarterNotesLength final
{
public:
	float                                         QuarterNotes;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.SetStepContinuation
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_SetStepContinuation final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsContinuation;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.SetStepContinuationOnPage
// 0x0010 (0x0010 - 0x0000)
struct FabricStepSequencerComponent_SetStepContinuationOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsContinuation;                                   // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.SetStepEnabled
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_SetStepEnabled final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bState;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.SetStepEnabledOnPage
// 0x0010 (0x0010 - 0x0000)
struct FabricStepSequencerComponent_SetStepEnabledOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bState;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.ToggleStepEnabled
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_ToggleStepEnabled final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.ToggleStepEnabledOnPage
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_ToggleStepEnabledOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetCurrentPage
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetCurrentPage final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetLengthStepBeats
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetLengthStepBeats final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetLengthStepQuarterNotes
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetLengthStepQuarterNotes final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetLengthTrackBeats
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetLengthTrackBeats final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetLengthTrackQuarterNotes
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetLengthTrackQuarterNotes final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetLongestContinuationLengthForColumn
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_GetLongestContinuationLengthForColumn final
{
public:
	int32                                         Column;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetLongestContinuationLengthForColumnOnPage
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_GetLongestContinuationLengthForColumnOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetMaxSteps
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetMaxSteps final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetNumberSteps
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetNumberSteps final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetNumberTracks
// 0x0004 (0x0004 - 0x0000)
struct FabricStepSequencerComponent_GetNumberTracks final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetNumUsedSteps
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_GetNumUsedSteps final
{
public:
	int32                                         TotalSteps;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetPageData
// 0x0018 (0x0018 - 0x0000)
struct FabricStepSequencerComponent_GetPageData final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FStepSequencePage                      OutPageData;                                       // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepContinuationLength
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_GetStepContinuationLength final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepContinuationLengthOnPage
// 0x0010 (0x0010 - 0x0000)
struct FabricStepSequencerComponent_GetStepContinuationLengthOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepEnabled
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_GetStepEnabled final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepEnabledOnPage
// 0x0010 (0x0010 - 0x0000)
struct FabricStepSequencerComponent_GetStepEnabledOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepIsContinuation
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_GetStepIsContinuation final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepIsContinuationOnPage
// 0x0010 (0x0010 - 0x0000)
struct FabricStepSequencerComponent_GetStepIsContinuationOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepStartBeat
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_GetStepStartBeat final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetStepStartQuarterNotes
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_GetStepStartQuarterNotes final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.GetSupportsContinuation
// 0x0001 (0x0001 - 0x0000)
struct FabricStepSequencerComponent_GetSupportsContinuation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricStepSequencerComponent.IsPageBlank
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_IsPageBlank final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.IsStepEnabledForAnyTrack
// 0x0008 (0x0008 - 0x0000)
struct FabricStepSequencerComponent_IsStepEnabledForAnyTrack final
{
public:
	int32                                         Column;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricStepSequencerComponent.IsStepEnabledForAnyTrackOnPage
// 0x000C (0x000C - 0x0000)
struct FabricStepSequencerComponent_IsStepEnabledForAnyTrackOnPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricMetaSoundPatchOwner.GetMetaSoundPatchWrapper
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchOwner_GetMetaSoundPatchWrapper final
{
public:
	class UFabricMetaSoundPatchWrapper*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.AddToGraphOnFirstConnect
// 0x0001 (0x0001 - 0x0000)
struct FabricMetaSoundPatchWrapper_AddToGraphOnFirstConnect final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.AddToManagerGraph
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_AddToManagerGraph final
{
public:
	class UFabricMetaSoundManagerComponent*       Manager;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.OnAddedToManagerGraph
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_OnAddedToManagerGraph final
{
public:
	class UFabricMetaSoundManagerComponent*       Manager;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.OnMetaSoundGeneratorHandleChanged
// 0x0010 (0x0010 - 0x0000)
struct FabricMetaSoundPatchWrapper_OnMetaSoundGeneratorHandleChanged final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetasoundGeneratorHandle*              GeneratorHandle;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.OnMetaSoundGeneratorHandleChangedDelegate
// 0x0010 (0x0010 - 0x0000)
struct FabricMetaSoundPatchWrapper_OnMetaSoundGeneratorHandleChangedDelegate final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetasoundGeneratorHandle*              GeneratorHandle;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.OnMetaSoundOutputChanged
// 0x0018 (0x0018 - 0x0000)
struct FabricMetaSoundPatchWrapper_OnMetaSoundOutputChanged final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMetaSoundOutput                       Output;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.OnMetaSoundOutputValueChanged
// 0x0018 (0x0018 - 0x0000)
struct FabricMetaSoundPatchWrapper_OnMetaSoundOutputValueChanged final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMetaSoundOutput                       MetaSoundOutput;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetBoolInput
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetBoolInput final
{
public:
	class FName                                   MetaSoundInputName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetEnumInput
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetEnumInput final
{
public:
	class FName                                   MetaSoundInputName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetFloatInput
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetFloatInput final
{
public:
	class FName                                   MetaSoundInputName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetIntInput
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetIntInput final
{
public:
	class FName                                   MetaSoundInputName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetNodeEnabled
// 0x0001 (0x0001 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetNodeEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetPositionalProxyActor
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetPositionalProxyActor final
{
public:
	class AActor*                                 InLocationProxyActor;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetRunsOnServer
// 0x0001 (0x0001 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetRunsOnServer final
{
public:
	bool                                          bAllowRunOnServer;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.SetStringInput
// 0x0018 (0x0018 - 0x0000)
struct FabricMetaSoundPatchWrapper_SetStringInput final
{
public:
	class FName                                   MetaSoundInputName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.GetMetaSoundInputNames
// 0x0050 (0x0050 - 0x0000)
struct FabricMetaSoundPatchWrapper_GetMetaSoundInputNames final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FabricRuntime.FabricMetaSoundPatchWrapper.GetMusicClock
// 0x0008 (0x0008 - 0x0000)
struct FabricMetaSoundPatchWrapper_GetMusicClock final
{
public:
	class UMusicClockComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

