#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FMCalibrationRuntime

#include "Basic.hpp"

#include "FMCalibrationRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FMCalibrationRuntime.BeatmatchCalibrationHelper.CalcCalibrationResult
// 0x0020 (0x0020 - 0x0000)
struct BeatmatchCalibrationHelper_CalcCalibrationResult final
{
public:
	TArray<float>                                 Samples;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         BPS;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibrationState                             ResultingState;                                    // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ResultMs;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.LoadCalibrationLocalToDevice
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_LoadCalibrationLocalToDevice final
{
public:
	bool                                          bAsync;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SaveCalibrationLocalToDevice
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SaveCalibrationLocalToDevice final
{
public:
	bool                                          bAsync;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SendToggleModalMessage
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_SendToggleModalMessage final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePreamble;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetAudioLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_SetAudioLatencyMs final
{
public:
	float                                         LatencyMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsAutolaunchDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsAutolaunchDisabled final
{
public:
	bool                                          bAutolaunchDisabled;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsCalibrated
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsCalibrated final
{
public:
	bool                                          bCalibrated;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsCalibrationDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsCalibrationDebugEnabled final
{
public:
	bool                                          bCalibrationDebugEnabled;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsPreambleDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsPreambleDisabled final
{
public:
	bool                                          bPreambleDisabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetVideoLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_SetVideoLatencyMs final
{
public:
	float                                         LatencyMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetAudioLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_GetAudioLatencyMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsAutolaunchDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsAutolaunchDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsCalibrated
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsCalibrated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsCalibrationDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsCalibrationDebugEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsPreambleDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsPreambleDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetVideoLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_GetVideoLatencyMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

