#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FMDeviceCablesRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum FMDeviceCablesRuntime.EDeviceCableActivatedState
// NumValues: 0x0003
enum class EDeviceCableActivatedState : uint8
{
	Active                                   = 0,
	Dormant                                  = 1,
	EDeviceCableActivatedState_MAX           = 2,
};

// Enum FMDeviceCablesRuntime.EPortSelectStatus
// NumValues: 0x000F
enum class EPortSelectStatus : uint8
{
	Error                                    = 0,
	ControllerCableUsed                      = 1,
	GaveControllerCable                      = 2,
	CableSwap                                = 3,
	NewCableUsed                             = 4,
	ConstantCableUsed                        = 5,
	ConnectionEnded                          = 6,
	NoCableAvailable                         = 7,
	TypeMismatch                             = 8,
	AttemptedMultiConnect                    = 9,
	SelfSelect                               = 10,
	InvalidConnection                        = 11,
	WouldCreateLoop                          = 12,
	Unselectable                             = 13,
	EPortSelectStatus_MAX                    = 14,
};

// Enum FMDeviceCablesRuntime.EDeviceCablePortAnimationSyncType
// NumValues: 0x0004
enum class EDeviceCablePortAnimationSyncType : uint8
{
	Follower                                 = 0,
	Authority                                = 1,
	Independent                              = 2,
	EDeviceCablePortAnimationSyncType_MAX    = 3,
};

// Enum FMDeviceCablesRuntime.EDeviceCablePortFlowType
// NumValues: 0x0004
enum class EDeviceCablePortFlowType : uint8
{
	Input                                    = 0,
	Output                                   = 1,
	Any                                      = 2,
	EDeviceCablePortFlowType_MAX             = 3,
};

// Enum FMDeviceCablesRuntime.EDeviceCablePortDataType
// NumValues: 0x0007
enum class EDeviceCablePortDataType : uint8
{
	Scalar                                   = 0,
	Note                                     = 1,
	Audio                                    = 2,
	Texture                                  = 3,
	Mesh                                     = 4,
	Any                                      = 5,
	EDeviceCablePortDataType_MAX             = 6,
};

// Enum FMDeviceCablesRuntime.EDeviceCablePortSelectableState
// NumValues: 0x0003
enum class EDeviceCablePortSelectableState : uint8
{
	Selectable                               = 0,
	Unselectable                             = 1,
	EDeviceCablePortSelectableState_MAX      = 2,
};

// Enum FMDeviceCablesRuntime.EFMDeviceCablePortComponentAllowMultipleConnections
// NumValues: 0x0004
enum class EFMDeviceCablePortComponentAllowMultipleConnections : uint32
{
	NoPreference                             = 0,
	ForceMultiple                            = 1,
	ForceSingle                              = 2,
	EFMDeviceCablePortComponentAllowMultipleConnections_MAX = 3,
};

// Enum FMDeviceCablesRuntime.EDeviceCableLoadableState
// NumValues: 0x0003
enum class EDeviceCableLoadableState : uint8
{
	Loadable                                 = 0,
	NotLoadable                              = 1,
	EDeviceCableLoadableState_MAX            = 2,
};

// Enum FMDeviceCablesRuntime.EFMDeviceCableAnimationQuality
// NumValues: 0x0004
enum class EFMDeviceCableAnimationQuality : uint8
{
	High                                     = 0,
	Med                                      = 1,
	Low                                      = 2,
	EFMDeviceCableAnimationQuality_MAX       = 3,
};

// Enum FMDeviceCablesRuntime.EDeviceCableInteractionType
// NumValues: 0x0003
enum class EDeviceCableInteractionType : uint8
{
	Free                                     = 0,
	StaticOutput                             = 1,
	EDeviceCableInteractionType_MAX          = 2,
};

// Enum FMDeviceCablesRuntime.EFMDeviceCableWildcardOrderingState
// NumValues: 0x0004
enum class EFMDeviceCableWildcardOrderingState : uint32
{
	Inactive                                 = 0,
	Pending                                  = 1,
	Active                                   = 2,
	EFMDeviceCableWildcardOrderingState_MAX  = 3,
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableTerminalDeviceInfo
// 0x0010 (0x0010 - 0x0000)
struct FFMDeviceCableTerminalDeviceInfo final
{
public:
	TWeakObjectPtr<class UFMDeviceCablePortComponent> TerminalPort;                                  // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  TerminalActor;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableOrderingMovementState
// 0x00A0 (0x00A0 - 0x0000)
struct FFMDeviceCableOrderingMovementState
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            Curve;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vector;                                            // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementTimeSeconds;                               // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMovementActive;                                   // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInvertVector;                                     // 0x002D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMovementState;                                    // 0x002E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         RunningMovementTimeSeconds;                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UFMDeviceCableWildcardPortComponent*> RelevantPorts;                                // 0x0038(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x58];                                      // 0x0048(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FMDeviceCablesRuntime.PortUpdateInfo
// 0x0020 (0x0020 - 0x0000)
struct FPortUpdateInfo final
{
public:
	EPortSelectStatus                             PortSelectStatus;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFMDeviceCablePortComponent*            ConstantPort;                                      // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMDeviceCablePortComponent*            ConnectedPort;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMDeviceCablePortComponent*            DisconnectedPort;                                  // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableActiveConnectionsList
// 0x0010 (0x0010 - 0x0000)
struct FFMDeviceCableActiveConnectionsList final
{
public:
	TArray<class UFMDeviceCableConnectionBase*>   ActiveConnections;                                 // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableArtifact
// 0x0020 (0x0020 - 0x0000)
struct FFMDeviceCableArtifact final
{
public:
	class UFabricMeshTreeNode*                    MeshTreeNode;                                      // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFabricMetaSoundTreeNode*               MetaSoundTreeNode;                                 // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFabricTextureTreeNode*                 TextureTreeNode;                                   // 0x0010(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFabricModulationNode*                  ModulationNode;                                    // 0x0018(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCablePassthroughDeviceInfo
// 0x0018 (0x0018 - 0x0000)
struct FFMDeviceCablePassthroughDeviceInfo final
{
public:
	TWeakObjectPtr<class UFMDeviceCablePortComponent> InputPort;                                     // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UFMDeviceCablePortComponent> OutputPort;                                    // 0x0008(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  PassthroughActor;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableConnectedDevicesInfo
// 0x0030 (0x0030 - 0x0000)
struct FFMDeviceCableConnectedDevicesInfo final
{
public:
	struct FFMDeviceCableTerminalDeviceInfo       SourceDeviceInfo;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FFMDeviceCableTerminalDeviceInfo       DestinationDeviceInfo;                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FFMDeviceCablePassthroughDeviceInfo> PassthroughDeviceInfos;                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableDefaultOutputs
// 0x0008 (0x0008 - 0x0000)
struct FFMDeviceCableDefaultOutputs final
{
public:
	class USoundSourceBus*                        SourceBus;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableTopologyNode
// 0x00A8 (0x00A8 - 0x0000)
struct alignas(0x08) FFMDeviceCableTopologyNode final
{
public:
	TWeakObjectPtr<class UFMDeviceCablePortComponent> Port;                                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0xA0];                                       // 0x0008(0x00A0)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FMDeviceCablesRuntime.ModulatorPortSaveData
// 0x0020 (0x0020 - 0x0000)
struct FModulatorPortSaveData final
{
public:
	struct FGuid                                  ConnectionGuid;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          ConnectedGuids;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableOrderingPortState
// 0x0018 (0x0018 - 0x0000)
struct FFMDeviceCableOrderingPortState final
{
public:
	class UFMDeviceCableWildcardPortComponent*    WildcardPort;                                      // 0x0000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMDeviceCableWildcardOrderingState           VisualState;                                       // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMDeviceCableWildcardOrderingState           State;                                             // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Slot;                                              // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableOrderingMovementStateSlot
// 0x0000 (0x00A0 - 0x00A0)
struct FFMDeviceCableOrderingMovementStateSlot final : public FFMDeviceCableOrderingMovementState
{
};

// ScriptStruct FMDeviceCablesRuntime.FMDeviceCableOrderingMovementStateIndividual
// 0x00A0 (0x0140 - 0x00A0)
struct FFMDeviceCableOrderingMovementStateIndividual final : public FFMDeviceCableOrderingMovementState
{
public:
	uint8                                         Pad_A0[0xA0];                                      // 0x00A0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

