#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FMDeviceCablesRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "FMDeviceCablesRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayEventRouter_structs.hpp"


namespace SDK
{

// Class FMDeviceCablesRuntime.FMDeviceCable
// 0x01D8 (0x08E8 - 0x0710)
class AFMDeviceCable final : public ABuildingActor
{
public:
	uint8                                         Pad_710[0x18];                                     // 0x0710(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class USplineComponent*                       SplineComponent;                                   // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   DeviceCableHead;                                   // 0x0730(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USplineMeshComponent>       SplineMeshComponentClass;                          // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             ScalarStaticMesh;                                  // 0x0740(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             AudioStaticMesh;                                   // 0x0760(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             NoteStaticMesh;                                    // 0x0780(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             TextureStaticMesh;                                 // 0x07A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             MeshStaticMesh;                                    // 0x07C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SplineLengthParam;                                 // 0x07E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SplineStartParam;                                  // 0x07E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SplineEndParam;                                    // 0x07E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PortTypeParam;                                     // 0x07EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CableStubLength;                                   // 0x07F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CableDistanceFromPortB;                            // 0x07F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CableMinTangent;                                   // 0x07F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CableMaxTangent;                                   // 0x07FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CableSectionLengthAtCableCenter;                   // 0x0800(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CableSectionLengthAtCableHeads;                    // 0x0804(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CableSectionCountAtCableHeads;                     // 0x0808(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CableCenterSectionsMaxCount;                       // 0x080C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ExtremeMinDotProduct;                              // 0x0810(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxExtremeCableBendSize;                           // 0x0814(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ExtremeAngleTangentScale;                          // 0x0818(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81C[0x4];                                      // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class USplineMeshComponent*>           CableSplineMeshArray;                              // 0x0820(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFMDeviceCableAnimatorBase> DeviceCableAnimator;                            // 0x0830(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DeviceCableMaterial;                               // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DeviceCableHeadMaterial;                           // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_848[0x10];                                     // 0x0848(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UFMDeviceCablePortComponent*            ConstantPort;                                      // 0x0858(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCablePortComponent*            PortA;                                             // 0x0860(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCablePortComponent*            ServerPortA;                                       // 0x0868(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCablePortComponent*            PortB;                                             // 0x0870(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCablePortComponent*            ServerPortB;                                       // 0x0878(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_880[0x68];                                     // 0x0880(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BuildMeshOnSpline(bool bCollisionEnabled);
	void ConnectConstantPort(class UFMDeviceCablePortComponent* Port);
	void ConnectPort(class UFMDeviceCablePortComponent* Port);
	void Disconnect();
	void OnCableConnected(bool bThroughReplication);
	void OnCableDisconnected(bool bThroughReplication);
	void OnCableGrabbed(bool bThroughReplication);
	void OnCableReturned();
	void OnRep_ServerPortA();
	void OnRep_ServerPortB();
	void OnScalesUpdated(const struct FVector& StartScale, const struct FVector& EndScale);
	void OnSplineUpdated(bool bCollisionEnabled);
	void SetFocusedVisuals(bool bIsFocused);
	void UpdateDeviceCableAnimator();
	void UpdateVisualParameters();

	EDeviceCablePortDataType GetCableDataType() const;
	class USplineComponent* GetCableSpline() const;
	class UFMDeviceCablePortComponent* GetConstantPort() const;
	class UStaticMeshComponent* GetDeviceCableHead() const;
	class UFMDeviceCablePortComponent* GetPortA() const;
	class UFMDeviceCablePortComponent* GetPortB() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCable">();
	}
	static class AFMDeviceCable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFMDeviceCable>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableAnimatorBase
// 0x00B8 (0x00E0 - 0x0028)
class UFMDeviceCableAnimatorBase : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class UFMDeviceCablePortComponent> OwnerPort;                                     // 0x0080(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x58];                                      // 0x0088(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddMaterialInstance(class UMaterialInstanceDynamic* InMaterialInstance);
	void OnConnectionEnded(class UFMDeviceCableConnectionBase* EndedConnection);
	void OnConnectionStarted(class UFMDeviceCableConnectionBase* NewConnection);
	void OnPortArtifactUpdated();
	void ReceiveTick(float DeltaSeconds);
	void RemoveMaterialInstance(class UMaterialInstanceDynamic* InMaterialInstance);
	void SetOwnerPort(class UFMDeviceCablePortComponent* OwnerPort_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableAnimatorBase">();
	}
	static class UFMDeviceCableAnimatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableAnimatorBase>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableAnimatorMidiEvent
// 0x00A8 (0x0188 - 0x00E0)
class UFMDeviceCableAnimatorMidiEvent final : public UFMDeviceCableAnimatorBase
{
public:
	class FName                                   NoteTextureParam;                                  // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            NoteShapeCurve;                                    // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NotePercentOfTexture;                              // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NoteTravelBeats;                                   // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NoteStartDelayBeats;                               // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0x14];                                      // 0x00FC(0x0014)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             NoteTexture;                                       // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFabricMetaSoundPatchWrapper*           PatchWrapper;                                      // 0x0118(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x68];                                     // 0x0120(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnMetaSoundOutputIntChangedBatch(const class FName& OutputName, const TArray<int32>& Output);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableAnimatorMidiEvent">();
	}
	static class UFMDeviceCableAnimatorMidiEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableAnimatorMidiEvent>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableAnimatorFloatProvider
// 0x0010 (0x00F0 - 0x00E0)
class UFMDeviceCableAnimatorFloatProvider final : public UFMDeviceCableAnimatorBase
{
public:
	class FName                                   CableDataParam;                                    // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   FloatProviderTypeParam;                            // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFabricFloatProviderBase*               FloatProvider;                                     // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetFloatProvider(class UFabricFloatProviderBase* InFloatProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableAnimatorFloatProvider">();
	}
	static class UFMDeviceCableAnimatorFloatProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableAnimatorFloatProvider>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableAnimatorTextureProvider
// 0x0010 (0x00F0 - 0x00E0)
class UFMDeviceCableAnimatorTextureProvider final : public UFMDeviceCableAnimatorBase
{
public:
	class FName                                   CableDataParam;                                    // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DecayRate;                                         // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFabricTextureProviderBase*             TextureProvider;                                   // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetTextureProvider(class UFabricTextureProviderBase* InTextureProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableAnimatorTextureProvider">();
	}
	static class UFMDeviceCableAnimatorTextureProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableAnimatorTextureProvider>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableAnimatorMeshProvider
// 0x0010 (0x00F0 - 0x00E0)
class UFMDeviceCableAnimatorMeshProvider final : public UFMDeviceCableAnimatorBase
{
public:
	class FName                                   CableDataParam;                                    // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DecayRate;                                         // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFabricMeshProviderBase*                MeshProvider;                                      // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetMeshProvider(class UFabricMeshProviderBase* InMeshProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableAnimatorMeshProvider">();
	}
	static class UFMDeviceCableAnimatorMeshProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableAnimatorMeshProvider>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableAnimatorAudioAnalyzer
// 0x0080 (0x0160 - 0x00E0)
class UFMDeviceCableAnimatorAudioAnalyzer final : public UFMDeviceCableAnimatorBase
{
public:
	class FName                                   FftTextureParam;                                   // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   WaveformTextureParam;                              // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AmplitudeTextureParam;                             // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AmplitudeDataParam;                                // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CableQualityParam;                                 // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CableReactivityParam;                              // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         WaveformNumSamplesHeld;                            // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         WaveformSmoothingDistance;                         // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WaveformSmoothingFactor;                           // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WaveformDecayPerSecond;                            // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             WaveformTexture;                                   // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             AmplitudeTexture;                                  // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFabricMetaSoundPatchWrapper*           PatchWrapper;                                      // 0x0118(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x40];                                     // 0x0120(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnMetaSoundOutputFloatChangedBatch(const class FName& OutputName, TArray<float>* Output, struct FFabricMetaSoundPatchWrapperPeakTamer* PeakTamer, float DeltaSeconds);
	void SetAnalyzerName(class FName AnalyzerName);

	float GetLastAnalyzerValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableAnimatorAudioAnalyzer">();
	}
	static class UFMDeviceCableAnimatorAudioAnalyzer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableAnimatorAudioAnalyzer>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableConnectionBase
// 0x00A8 (0x00D0 - 0x0028)
class UFMDeviceCableConnectionBase : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bConnectionActive;                                 // 0x0080(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TWeakObjectPtr<class UFMDeviceCablePortComponent>> BuildingCompositeArtifactFromPorts;    // 0x0088(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FFMDeviceCableConnectedDevicesInfo     ConnectedDevicesInfo;                              // 0x0098(0x0030)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FFMDeviceCableDefaultOutputs           DefaultOutputs;                                    // 0x00C8(0x0008)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void EndConnectionBP();
	void RebuildDirtyConnectionBP();
	void StartConnectionBP();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableConnectionBase">();
	}
	static class UFMDeviceCableConnectionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableConnectionBase>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableMetaSoundConnection
// 0x0000 (0x00D0 - 0x00D0)
class UFMDeviceCableMetaSoundConnection : public UFMDeviceCableConnectionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableMetaSoundConnection">();
	}
	static class UFMDeviceCableMetaSoundConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableMetaSoundConnection>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableNoteConnection
// 0x0000 (0x00D0 - 0x00D0)
class UFMDeviceCableNoteConnection final : public UFMDeviceCableMetaSoundConnection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableNoteConnection">();
	}
	static class UFMDeviceCableNoteConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableNoteConnection>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableAudioConnection
// 0x0000 (0x00D0 - 0x00D0)
class UFMDeviceCableAudioConnection final : public UFMDeviceCableMetaSoundConnection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableAudioConnection">();
	}
	static class UFMDeviceCableAudioConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableAudioConnection>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableFloatConnection
// 0x0000 (0x00D0 - 0x00D0)
class UFMDeviceCableFloatConnection final : public UFMDeviceCableConnectionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableFloatConnection">();
	}
	static class UFMDeviceCableFloatConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableFloatConnection>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableTextureConnection
// 0x0000 (0x00D0 - 0x00D0)
class UFMDeviceCableTextureConnection final : public UFMDeviceCableConnectionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableTextureConnection">();
	}
	static class UFMDeviceCableTextureConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableTextureConnection>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableMeshConnection
// 0x0008 (0x00D8 - 0x00D0)
class UFMDeviceCableMeshConnection final : public UFMDeviceCableConnectionBase
{
public:
	uint32                                        PreviousMeshInstanceHash;                          // 0x00D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableMeshConnection">();
	}
	static class UFMDeviceCableMeshConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableMeshConnection>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableControllerComponent
// 0x0060 (0x0100 - 0x00A0)
class UFMDeviceCableControllerComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const TArray<class UFMDeviceCablePortComponent*>& ConnectedPorts)> OnControllerCableConnected; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnControllerCableDisconnected;                     // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ControllerCablePort;                               // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     DeviceCableManagerClass;                           // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCablePortComponent*            LocalControllerPort;                               // 0x00D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCablePortComponent*            ServerControllerPort;                              // 0x00E0(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AActor>                  LocalControllerPortActor;                          // 0x00E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCableManagerComponent*         LocalDeviceCableManager;                           // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMDeviceCableManagerComponent*         ServerDeviceCableManager;                          // 0x00F8(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DropCable();
	void OnCreativePlotLinkedVolumeChanged(class AFortVolume* FortVolume);
	void OnFortPawnChanged(class AFortPawn* Pawn);
	void OnNoFabricInteractablesHit();
	void OnRep_ServerControllerPort();
	void OnRep_ServerDeviceCableManager();
	void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void SelectPort(class UFMDeviceCablePortComponent* SelectedPort);
	void ServerDisconnectController();
	void ServerPortActivatedStateChanged(class UFMDeviceCablePortComponent* Port, EDeviceCableActivatedState ActivatedState);
	void ServerPortsUpdated(const TArray<struct FPortUpdateInfo>& PortChangeInfos);
	void ServerSelectPort(class UFMDeviceCablePortComponent* SelectedPort);
	void ServerVolumeChanged();
	void SetControllerTargetForControllerPortBP(class AActor* ControllerPortActor, class APlayerController* Controller);

	bool IsCableConnectionValid(class UFMDeviceCablePortComponent* OtherPort) const;
	bool IsHoldingCable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableControllerComponent">();
	}
	static class UFMDeviceCableControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableControllerComponent>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableManagerComponent
// 0x0268 (0x0308 - 0x00A0)
class UFMDeviceCableManagerComponent final : public UActorComponent
{
public:
	TSubclassOf<class AFMDeviceCable>             DeviceCableClass;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         StartingCablePoolSize;                             // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDeviceCableInteractionType                   CableInteractionType;                              // 0x00AC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<EDeviceCablePortDataType, TSubclassOf<class UFMDeviceCableConnectionBase>> ConnectionClasses; // 0x00B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class USoundSourceBus*                        DefaultSourceBus;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayEventListenerBackwardCompatibleHandle PlayerEnteredHandle;                       // 0x0108(0x0048)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AFMDeviceCable*>                 FreeDeviceCables;                                  // 0x0150(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UFMDeviceCableConnectionBase*>   CableConnections;                                  // 0x0160(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, TWeakObjectPtr<class UFMDeviceCablePortComponent>> PortsInVolume;             // 0x0170(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, struct FGuid>              OriginalGuidToDuplicatedGuidThisFrame;             // 0x01C0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<TSoftObjectPtr<class UObject>, TSoftObjectPtr<class UObject>> SourceObjectToDuplicatedObjectThisFrame; // 0x0210(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0xA0];                                     // 0x0260(0x00A0)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFMDeviceCableDefaultOutputs           DefaultConnectionOutputs;                          // 0x0300(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	EDeviceCableInteractionType GetCableInteractionType();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableManagerComponent">();
	}
	static class UFMDeviceCableManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableManagerComponent>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCablePortComponent
// 0x02F0 (0x0930 - 0x0640)
class UFMDeviceCablePortComponent : public UStaticMeshComponent
{
public:
	uint8                                         Pad_638[0x38];                                     // 0x0638(0x0038)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(float Size)>    OnCablePortSizeUpdated;                            // 0x0670(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMDeviceCableAnimatorBase* Animator)> OnAnimatorCreated;    // 0x0680(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMDeviceCablePortComponent* ConnectedPort)> OnConnected;    // 0x0690(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A0[0x20];                                     // 0x06A0(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class UFMDeviceCablePortComponent* DisconnectedPort)> OnDisconnected; // 0x06C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMDeviceCableConnectionBase* NewConnection)> OnConnectionStarted; // 0x06D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMDeviceCableConnectionBase* EndedConnection)> OnConnectionEnded; // 0x06E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPortArtifactUpdated;                             // 0x06F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<class UFabricFloatProviderBase*>& FloatProviders)> OnReceiveFloatProviders; // 0x0700(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFabricFloatProviderBase* FloatProvider)> OnDisconnectFloatProvider; // 0x0710(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     DeviceCableManagerClass;                           // 0x0720(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             OutputStaticMesh;                                  // 0x0728(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             AudioInStaticMesh;                                 // 0x0748(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             NoteInStaticMesh;                                  // 0x0768(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             TextureInStaticMesh;                               // 0x0788(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             MeshInStaticMesh;                                  // 0x07A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>             ScalarInStaticMesh;                                // 0x07C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EDeviceCablePortDataType, TSubclassOf<class UFMDeviceCableAnimatorBase>> CableAnimatorClasses; // 0x07E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	EDeviceCablePortFlowType                      PortFlowType;                                      // 0x0838(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDeviceCablePortDataType                      PortDataType;                                      // 0x0839(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDeviceCableLoadableState                     PortLoadableState;                                 // 0x083A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDeviceCablePortAnimationSyncType             AnimationSyncType;                                 // 0x083B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowMultipleConnections;                         // 0x083C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowSiblingConnections;                          // 0x083D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_83E[0x2];                                      // 0x083E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	EFMDeviceCablePortComponentAllowMultipleConnections OverrideAllowMultipleConnections;            // 0x0840(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFMDeviceCablePortComponentAllowMultipleConnections OverrideAllowSiblingConnections;             // 0x0844(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHideWhenNotRelevant;                              // 0x0848(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPlayerPort;                                     // 0x0849(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOnPreviewBuildingActor;                         // 0x084A(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84B[0x1];                                      // 0x084B(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   EnterVolumeTag;                                    // 0x084C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ExitVolumeTag;                                     // 0x0850(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_854[0x4];                                      // 0x0854(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UFMDeviceCablePortComponent*>    ConnectedPorts;                                    // 0x0858(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFMDeviceCablePortComponent*>    ServerConnectedPorts;                              // 0x0868(0x0010)(ExportObject, Net, ZeroConstructor, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFMDeviceCableConnectionBase*>   CurrentConnections;                                // 0x0878(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AFMDeviceCable*                         ConstantCable;                                     // 0x0888(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFMDeviceCableManagerComponent*         DeviceCableManager;                                // 0x0890(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFMDeviceCablePortComponent*>    OtherPortsOnActor;                                 // 0x0898(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EDeviceCableActivatedState                    PortActivatedState;                                // 0x08A8(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDeviceCableActivatedState                    ServerPortActivatedState;                          // 0x08A9(0x0001)(Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDeviceCablePortSelectableState               PortSelectableState;                               // 0x08AA(0x0001)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8AB[0x5];                                      // 0x08AB(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class UFMDeviceCableAnimatorBase*             DeviceCableAnimator;                               // 0x08B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  ConnectionGuid;                                    // 0x08B8(0x0010)(ZeroConstructor, Transient, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                          ConnectedGuids;                                    // 0x08C8(0x0010)(ZeroConstructor, Transient, SaveGame, Protected, NativeAccessSpecifierProtected)
	struct FFMDeviceCableArtifact                 CachedArtifact;                                    // 0x08D8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8F8[0x10];                                     // 0x08F8(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UFMDeviceCablePortComponent*>    PendingConnectionBroadcasts;                       // 0x0908(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGuid                                  SaveGuid;                                          // 0x0918(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_928[0x8];                                      // 0x0928(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool ActorHasValidControllerBP(class AActor* Actor, class AFortPlayerPawn** OutFortPlayerPawn, class APlayerController** OutPlayerController);
	void EndConnectionWithPort(class UFMDeviceCablePortComponent* OtherPort);
	class AFMDeviceCable* GetConstantCable();
	class UFMDeviceCableAnimatorBase* GetDeviceCableAnimator();
	struct FGuid GetGuid();
	void OnPlayerControllerPortConnected(const TArray<class UFMDeviceCablePortComponent*>& ControllerPorts);
	void OnPlayerControllerPortDisconnected();
	void OnRep_ConstantCable();
	void OnRep_DeviceCableManager();
	void OnRep_ServerConnectedPorts();
	void OnRep_ServerPortActivatedState();
	void OpenConnectionToPort(class UFMDeviceCablePortComponent* OtherPort);
	EPortSelectStatus Select(class UFMDeviceCablePortComponent* PlayerSelectionPort, TArray<struct FPortUpdateInfo>* OutPortUpdates);
	EPortSelectStatus SelectWithStaticOutputInteraction(class UFMDeviceCablePortComponent* PlayerSelectionPort, TArray<struct FPortUpdateInfo>* OutPortUpdates);
	void SetCachedArtifact(const struct FFMDeviceCableArtifact& InCachedArtifact);
	void SetDeviceCableAnimator(class UFMDeviceCableAnimatorBase* InAnimator);
	void SetPortActivatedState(EDeviceCableActivatedState NewActivatedState);
	void SetPortConnectionsDirty();
	void SetPortSelectableState(EDeviceCablePortSelectableState NewSelectableState);
	void SetPortVisibility(bool bPortVisible);
	void UpdateStaticMesh();

	EDeviceCablePortAnimationSyncType GetAnimationSyncType() const;
	const struct FFMDeviceCableArtifact GetCachedArtifact() const;
	const TArray<class UFMDeviceCablePortComponent*> GetConnectedPorts() const;
	const TArray<class UFMDeviceCableConnectionBase*> GetConnections() const;
	bool GetIsPlayerPort() const;
	bool GetIsTerminalPort(EDeviceCablePortFlowType FlowType) const;
	TArray<class UFMDeviceCablePortComponent*> GetNextPortsInConnections() const;
	const TArray<class UFMDeviceCablePortComponent*> GetOtherPortsOnActor() const;
	EDeviceCableActivatedState GetPortActivatedState() const;
	EDeviceCablePortDataType GetPortDataType() const;
	EDeviceCablePortFlowType GetPortFlowType() const;
	EDeviceCablePortSelectableState GetPortSelectableState() const;
	TArray<class UFMDeviceCablePortComponent*> GetPreviousPortsInConnections() const;
	bool IsConnected() const;
	bool IsConnectedToPort(class UFMDeviceCablePortComponent* Port) const;
	bool MatchesPortConnectionType(class UFMDeviceCablePortComponent* OtherPort) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCablePortComponent">();
	}
	static class UFMDeviceCablePortComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCablePortComponent>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableModulatorPortComponent
// 0x0030 (0x0960 - 0x0930)
class UFMDeviceCableModulatorPortComponent final : public UFMDeviceCablePortComponent
{
public:
	uint8                                         Pad_930[0x8];                                      // 0x0930(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 AssociatedProperty;                                // 0x0938(0x0010)(Net, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UObject>                 AssociatedObject;                                  // 0x0948(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_950[0x10];                                     // 0x0950(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetDeviceCableManager(class UFMDeviceCableManagerComponent* InDeviceCableManager);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableModulatorPortComponent">();
	}
	static class UFMDeviceCableModulatorPortComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableModulatorPortComponent>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCablesFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFMDeviceCablesFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class USoundSourceBus* DeepCopySoundSourceBus(const class UObject* Context, class UObject* Outer_0, class USoundSourceBus* Source);
	static struct FSoundSourceBusSendInfo MakeSoundSourceBusSendInfo(class USoundSourceBus* SoundSourceBus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCablesFunctionLibrary">();
	}
	static class UFMDeviceCablesFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCablesFunctionLibrary>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent
// 0x04D0 (0x0570 - 0x00A0)
class UFMDeviceCableWildcardOrderingComponent final : public UActorComponent
{
public:
	struct FFMDeviceCableOrderingMovementState    InputsShowHideMovement;                            // 0x00A0(0x00A0)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FFMDeviceCableOrderingMovementStateIndividual OutputsShowHideMovement;                    // 0x0140(0x0140)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FFMDeviceCableOrderingMovementStateSlot OutputsCollapseExpandMovement;                    // 0x0280(0x00A0)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FFMDeviceCableOrderingMovementStateIndividual OutputListShiftMovement;                    // 0x0320(0x0140)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FName                                   ClosedMeshTag;                                     // 0x0460(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TopMeshTag;                                        // 0x0464(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MiddleMeshTag;                                     // 0x0468(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BottomMeshTag;                                     // 0x046C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ClosedMesh;                                        // 0x0470(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   TopMesh;                                           // 0x0478(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>           MiddleMeshes;                                      // 0x0480(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   BottomMesh;                                        // 0x0490(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_498[0x10];                                     // 0x0498(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UFMDeviceCableWildcardPortComponent*> InputWildcardPorts;                           // 0x04A8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UFMDeviceCableWildcardPortComponent*> OutputWildcardPorts;                          // 0x04B8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C8[0x30];                                     // 0x04C8(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UFMDeviceCableWildcardPortComponent*> PortsWithPendingDisconnects;                  // 0x04F8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_508[0x50];                                     // 0x0508(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFMDeviceCableOrderingPortState> ServerPortStates;                                 // 0x0558(0x0010)(Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnInputPortConnected(class UFMDeviceCablePortComponent* ConnectedPort);
	void OnInputPortDataTypeChanged(class UFMDeviceCableWildcardPortComponent* WildcardPort, EDeviceCablePortDataType DataType);
	void OnInputPortDisconnected(class UFMDeviceCablePortComponent* DisconnectedPort);
	void OnOutputPortConnected(class UFMDeviceCablePortComponent* SourcePort, class UFMDeviceCablePortComponent* ConnectedPort);
	void OnOutputPortDisconnected(class UFMDeviceCablePortComponent* SourcePort, class UFMDeviceCablePortComponent* DisconnectedPort);
	void OnOutputPortSlotSetFromSave(class UFMDeviceCableWildcardPortComponent* WildcardPort, bool bHasConnections);
	void OnRep_ServerPortStates();
	void SetInputRoot(const struct FVector& RootLocation);
	void SetOutputPortsExpanded(bool bExpanded);
	void SetOutputRoot(const struct FVector& RootLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableWildcardOrderingComponent">();
	}
	static class UFMDeviceCableWildcardOrderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableWildcardOrderingComponent>();
	}
};

// Class FMDeviceCablesRuntime.FMDeviceCableWildcardPortComponent
// 0x0030 (0x0960 - 0x0930)
class UFMDeviceCableWildcardPortComponent final : public UFMDeviceCablePortComponent
{
public:
	TMulticastInlineDelegate<void(class UFMDeviceCableWildcardPortComponent* WildcardPort, EDeviceCablePortDataType DataType)> OnWildcardDataTypeChanged; // 0x0930(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMDeviceCableWildcardPortComponent* WildcardPort, bool bHasConnections)> OnWildcardPortSlotSetFromSave; // 0x0940(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         SlotIndex;                                         // 0x0950(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SavedSlotIndex;                                    // 0x0954(0x0004)(Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_958[0x8];                                      // 0x0958(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnPlayerControllerPortConnectedWildcard(const TArray<class UFMDeviceCablePortComponent*>& ControllerPorts);
	void OnPlayerControllerPortDisconnectedWildcard();
	void OnRep_SavedSlotIndex();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMDeviceCableWildcardPortComponent">();
	}
	static class UFMDeviceCableWildcardPortComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMDeviceCableWildcardPortComponent>();
	}
};

}

