#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FMDeviceCablesRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FMDeviceCablesRuntime_structs.hpp"
#include "FabricRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FMDeviceCablesRuntime.FMDeviceCable.BuildMeshOnSpline
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCable_BuildMeshOnSpline final
{
public:
	bool                                          bCollisionEnabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.ConnectConstantPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCable_ConnectConstantPort final
{
public:
	class UFMDeviceCablePortComponent*            Port;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.ConnectPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCable_ConnectPort final
{
public:
	class UFMDeviceCablePortComponent*            Port;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.OnCableConnected
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCable_OnCableConnected final
{
public:
	bool                                          bThroughReplication;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.OnCableDisconnected
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCable_OnCableDisconnected final
{
public:
	bool                                          bThroughReplication;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.OnCableGrabbed
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCable_OnCableGrabbed final
{
public:
	bool                                          bThroughReplication;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.OnScalesUpdated
// 0x0030 (0x0030 - 0x0000)
struct FMDeviceCable_OnScalesUpdated final
{
public:
	struct FVector                                StartScale;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndScale;                                          // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.OnSplineUpdated
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCable_OnSplineUpdated final
{
public:
	bool                                          bCollisionEnabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.SetFocusedVisuals
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCable_SetFocusedVisuals final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.GetCableDataType
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCable_GetCableDataType final
{
public:
	EDeviceCablePortDataType                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.GetCableSpline
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCable_GetCableSpline final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.GetConstantPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCable_GetConstantPort final
{
public:
	class UFMDeviceCablePortComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.GetDeviceCableHead
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCable_GetDeviceCableHead final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.GetPortA
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCable_GetPortA final
{
public:
	class UFMDeviceCablePortComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCable.GetPortB
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCable_GetPortB final
{
public:
	class UFMDeviceCablePortComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorBase.AddMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorBase_AddMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               InMaterialInstance;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorBase.OnConnectionEnded
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorBase_OnConnectionEnded final
{
public:
	class UFMDeviceCableConnectionBase*           EndedConnection;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorBase.OnConnectionStarted
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorBase_OnConnectionStarted final
{
public:
	class UFMDeviceCableConnectionBase*           NewConnection;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorBase.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct FMDeviceCableAnimatorBase_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorBase.RemoveMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorBase_RemoveMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               InMaterialInstance;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorBase.SetOwnerPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorBase_SetOwnerPort final
{
public:
	class UFMDeviceCablePortComponent*            OwnerPort_0;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorMidiEvent.OnMetaSoundOutputIntChangedBatch
// 0x0018 (0x0018 - 0x0000)
struct FMDeviceCableAnimatorMidiEvent_OnMetaSoundOutputIntChangedBatch final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 Output;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorFloatProvider.SetFloatProvider
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorFloatProvider_SetFloatProvider final
{
public:
	class UFabricFloatProviderBase*               InFloatProvider;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorTextureProvider.SetTextureProvider
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorTextureProvider_SetTextureProvider final
{
public:
	class UFabricTextureProviderBase*             InTextureProvider;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorMeshProvider.SetMeshProvider
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableAnimatorMeshProvider_SetMeshProvider final
{
public:
	class UFabricMeshProviderBase*                InMeshProvider;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorAudioAnalyzer.OnMetaSoundOutputFloatChangedBatch
// 0x0040 (0x0040 - 0x0000)
struct FMDeviceCableAnimatorAudioAnalyzer_OnMetaSoundOutputFloatChangedBatch final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<float>                                 Output;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FFabricMetaSoundPatchWrapperPeakTamer  PeakTamer;                                         // 0x0018(0x0024)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorAudioAnalyzer.SetAnalyzerName
// 0x0004 (0x0004 - 0x0000)
struct FMDeviceCableAnimatorAudioAnalyzer_SetAnalyzerName final
{
public:
	class FName                                   AnalyzerName;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableAnimatorAudioAnalyzer.GetLastAnalyzerValue
// 0x0004 (0x0004 - 0x0000)
struct FMDeviceCableAnimatorAudioAnalyzer_GetLastAnalyzerValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.OnCreativePlotLinkedVolumeChanged
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableControllerComponent_OnCreativePlotLinkedVolumeChanged final
{
public:
	class AFortVolume*                            FortVolume;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.OnFortPawnChanged
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableControllerComponent_OnFortPawnChanged final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.OnWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableControllerComponent_OnWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.SelectPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableControllerComponent_SelectPort final
{
public:
	class UFMDeviceCablePortComponent*            SelectedPort;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.ServerPortActivatedStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableControllerComponent_ServerPortActivatedStateChanged final
{
public:
	class UFMDeviceCablePortComponent*            Port;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeviceCableActivatedState                    ActivatedState;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.ServerPortsUpdated
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableControllerComponent_ServerPortsUpdated final
{
public:
	TArray<struct FPortUpdateInfo>                PortChangeInfos;                                   // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.ServerSelectPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableControllerComponent_ServerSelectPort final
{
public:
	class UFMDeviceCablePortComponent*            SelectedPort;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.SetControllerTargetForControllerPortBP
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableControllerComponent_SetControllerTargetForControllerPortBP final
{
public:
	class AActor*                                 ControllerPortActor;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      Controller;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.IsCableConnectionValid
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableControllerComponent_IsCableConnectionValid final
{
public:
	class UFMDeviceCablePortComponent*            OtherPort;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCableControllerComponent.IsHoldingCable
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCableControllerComponent_IsHoldingCable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableManagerComponent.GetCableInteractionType
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCableManagerComponent_GetCableInteractionType final
{
public:
	EDeviceCableInteractionType                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.ActorHasValidControllerBP
// 0x0020 (0x0020 - 0x0000)
struct FMDeviceCablePortComponent_ActorHasValidControllerBP final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        OutFortPlayerPawn;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      OutPlayerController;                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.EndConnectionWithPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCablePortComponent_EndConnectionWithPort final
{
public:
	class UFMDeviceCablePortComponent*            OtherPort;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetConstantCable
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCablePortComponent_GetConstantCable final
{
public:
	class AFMDeviceCable*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetDeviceCableAnimator
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCablePortComponent_GetDeviceCableAnimator final
{
public:
	class UFMDeviceCableAnimatorBase*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetGuid
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_GetGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.OnPlayerControllerPortConnected
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_OnPlayerControllerPortConnected final
{
public:
	TArray<class UFMDeviceCablePortComponent*>    ControllerPorts;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.OpenConnectionToPort
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCablePortComponent_OpenConnectionToPort final
{
public:
	class UFMDeviceCablePortComponent*            OtherPort;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.Select
// 0x0020 (0x0020 - 0x0000)
struct FMDeviceCablePortComponent_Select final
{
public:
	class UFMDeviceCablePortComponent*            PlayerSelectionPort;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPortUpdateInfo>                OutPortUpdates;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EPortSelectStatus                             ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.SelectWithStaticOutputInteraction
// 0x0020 (0x0020 - 0x0000)
struct FMDeviceCablePortComponent_SelectWithStaticOutputInteraction final
{
public:
	class UFMDeviceCablePortComponent*            PlayerSelectionPort;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPortUpdateInfo>                OutPortUpdates;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EPortSelectStatus                             ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.SetCachedArtifact
// 0x0020 (0x0020 - 0x0000)
struct FMDeviceCablePortComponent_SetCachedArtifact final
{
public:
	struct FFMDeviceCableArtifact                 InCachedArtifact;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.SetDeviceCableAnimator
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCablePortComponent_SetDeviceCableAnimator final
{
public:
	class UFMDeviceCableAnimatorBase*             InAnimator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.SetPortActivatedState
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_SetPortActivatedState final
{
public:
	EDeviceCableActivatedState                    NewActivatedState;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.SetPortSelectableState
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_SetPortSelectableState final
{
public:
	EDeviceCablePortSelectableState               NewSelectableState;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.SetPortVisibility
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_SetPortVisibility final
{
public:
	bool                                          bPortVisible;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetAnimationSyncType
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_GetAnimationSyncType final
{
public:
	EDeviceCablePortAnimationSyncType             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetCachedArtifact
// 0x0020 (0x0020 - 0x0000)
struct FMDeviceCablePortComponent_GetCachedArtifact final
{
public:
	struct FFMDeviceCableArtifact                 ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetConnectedPorts
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_GetConnectedPorts final
{
public:
	TArray<class UFMDeviceCablePortComponent*>    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetConnections
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_GetConnections final
{
public:
	TArray<class UFMDeviceCableConnectionBase*>   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetIsPlayerPort
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_GetIsPlayerPort final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetIsTerminalPort
// 0x0002 (0x0002 - 0x0000)
struct FMDeviceCablePortComponent_GetIsTerminalPort final
{
public:
	EDeviceCablePortFlowType                      FlowType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetNextPortsInConnections
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_GetNextPortsInConnections final
{
public:
	TArray<class UFMDeviceCablePortComponent*>    ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetOtherPortsOnActor
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_GetOtherPortsOnActor final
{
public:
	TArray<class UFMDeviceCablePortComponent*>    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetPortActivatedState
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_GetPortActivatedState final
{
public:
	EDeviceCableActivatedState                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetPortDataType
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_GetPortDataType final
{
public:
	EDeviceCablePortDataType                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetPortFlowType
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_GetPortFlowType final
{
public:
	EDeviceCablePortFlowType                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetPortSelectableState
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_GetPortSelectableState final
{
public:
	EDeviceCablePortSelectableState               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.GetPreviousPortsInConnections
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_GetPreviousPortsInConnections final
{
public:
	TArray<class UFMDeviceCablePortComponent*>    ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.IsConnected
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCablePortComponent_IsConnected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.IsConnectedToPort
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_IsConnectedToPort final
{
public:
	class UFMDeviceCablePortComponent*            Port;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCablePortComponent.MatchesPortConnectionType
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCablePortComponent_MatchesPortConnectionType final
{
public:
	class UFMDeviceCablePortComponent*            OtherPort;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCableModulatorPortComponent.SetDeviceCableManager
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableModulatorPortComponent_SetDeviceCableManager final
{
public:
	class UFMDeviceCableManagerComponent*         InDeviceCableManager;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablesFunctionLibrary.DeepCopySoundSourceBus
// 0x0020 (0x0020 - 0x0000)
struct FMDeviceCablesFunctionLibrary_DeepCopySoundSourceBus final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Outer_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSourceBus*                        Source;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSourceBus*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCablesFunctionLibrary.MakeSoundSourceBusSendInfo
// 0x00C0 (0x00C0 - 0x0000)
struct FMDeviceCablesFunctionLibrary_MakeSoundSourceBusSendInfo final
{
public:
	class USoundSourceBus*                        SoundSourceBus;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundSourceBusSendInfo                ReturnValue;                                       // 0x0008(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.OnInputPortConnected
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_OnInputPortConnected final
{
public:
	class UFMDeviceCablePortComponent*            ConnectedPort;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.OnInputPortDataTypeChanged
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_OnInputPortDataTypeChanged final
{
public:
	class UFMDeviceCableWildcardPortComponent*    WildcardPort;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeviceCablePortDataType                      DataType;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.OnInputPortDisconnected
// 0x0008 (0x0008 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_OnInputPortDisconnected final
{
public:
	class UFMDeviceCablePortComponent*            DisconnectedPort;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.OnOutputPortConnected
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_OnOutputPortConnected final
{
public:
	class UFMDeviceCablePortComponent*            SourcePort;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMDeviceCablePortComponent*            ConnectedPort;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.OnOutputPortDisconnected
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_OnOutputPortDisconnected final
{
public:
	class UFMDeviceCablePortComponent*            SourcePort;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMDeviceCablePortComponent*            DisconnectedPort;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.OnOutputPortSlotSetFromSave
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_OnOutputPortSlotSetFromSave final
{
public:
	class UFMDeviceCableWildcardPortComponent*    WildcardPort;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasConnections;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.SetInputRoot
// 0x0018 (0x0018 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_SetInputRoot final
{
public:
	struct FVector                                RootLocation;                                      // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.SetOutputPortsExpanded
// 0x0001 (0x0001 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_SetOutputPortsExpanded final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardOrderingComponent.SetOutputRoot
// 0x0018 (0x0018 - 0x0000)
struct FMDeviceCableWildcardOrderingComponent_SetOutputRoot final
{
public:
	struct FVector                                RootLocation;                                      // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMDeviceCablesRuntime.FMDeviceCableWildcardPortComponent.OnPlayerControllerPortConnectedWildcard
// 0x0010 (0x0010 - 0x0000)
struct FMDeviceCableWildcardPortComponent_OnPlayerControllerPortConnectedWildcard final
{
public:
	TArray<class UFMDeviceCablePortComponent*>    ControllerPorts;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

}

