#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortAutoRunNotificationWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortAutoRunNotificationWidget.FortAutoRunNotificationWidget_C.OnAutoRunEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAutoRunNotificationWidget_C_OnAutoRunEnabled final
{
public:
	bool                                          bAutoRunEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FortAutoRunNotificationWidget.FortAutoRunNotificationWidget_C.ExecuteUbergraph_FortAutoRunNotificationWidget
// 0x0018 (0x0018 - 0x0000)
struct FortAutoRunNotificationWidget_C_ExecuteUbergraph_FortAutoRunNotificationWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAutoRunEnabled;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

