#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortSortFilterControls

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FortSortFilterControls.FortSortFilterControls_C.SetFortSortFilterVM
// 0x0028 (0x0028 - 0x0000)
struct FortSortFilterControls_C_SetFortSortFilterVM final
{
public:
	class UFortSortFilterVM*                      ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FortSortFilterControls.FortSortFilterControls_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct FortSortFilterControls_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function FortSortFilterControls.FortSortFilterControls_C.NavigateDownFromTextBox
// 0x0010 (0x0010 - 0x0000)
struct FortSortFilterControls_C_NavigateDownFromTextBox final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortSortFilterControls.FortSortFilterControls_C.NavigateDownFromButtom
// 0x0010 (0x0010 - 0x0000)
struct FortSortFilterControls_C_NavigateDownFromButtom final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortSortFilterControls.FortSortFilterControls_C.ExecuteUbergraph_FortSortFilterControls
// 0x0030 (0x0030 - 0x0000)
struct FortSortFilterControls_C_ExecuteUbergraph_FortSortFilterControls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0018(0x0008)(NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSubGame_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FortSortFilterControls.FortSortFilterControls_C.BndEvt__FortSortFilterControls_Button_SortAndFilter_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortSortFilterControls_C_BndEvt__FortSortFilterControls_Button_SortAndFilter_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortSortFilterControls.FortSortFilterControls_C.BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortSortFilterControls_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortSortFilterControls.FortSortFilterControls_C.FormatSortFilterLabel
// 0x00C0 (0x00C0 - 0x0000)
struct FortSortFilterControls_C_FormatSortFilterLabel final
{
public:
	class FText                                   StringFormat;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   SortFilterName;                                    // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewParam2;                                         // 0x0030(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
};

// Function FortSortFilterControls.FortSortFilterControls_C.__fef5b753-4222-1a8e-8f37-d1b296ebd213_SourceToDest
// 0x0030 (0x0030 - 0x0000)
struct FortSortFilterControls_C___fef5b753_4222_1a8e_8f37_d1b296ebd213_SourceToDest final
{
public:
	class FText                                   NewParam2;                                         // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_FormatSortFilterLabel_NewParam2;          // 0x0018(0x0018)()
};

// Function FortSortFilterControls.FortSortFilterControls_C.__31b4c26f-4640-a9de-cb5f-358067836780_SourceToDest
// 0x0030 (0x0030 - 0x0000)
struct FortSortFilterControls_C___31b4c26f_4640_a9de_cb5f_358067836780_SourceToDest final
{
public:
	class FText                                   NewParam2;                                         // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_FormatSortFilterLabel_NewParam2;          // 0x0018(0x0018)()
};

}

