#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteConversationUI

#include "Basic.hpp"

#include "FortniteConversationUI_structs.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteConversationRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FortniteConversationUI.FortConversationOptionBrief.ConfigureBP
// 0x00B0 (0x00B0 - 0x0000)
struct FortConversationOptionBrief_ConfigureBP final
{
public:
	struct FConversationContext                   ClientContext;                                     // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FClientConversationOptionEntry         OptionEntry;                                       // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SelectedIndex;                                     // 0x00A8(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationUI.FortItemTransactionBrief.OnTransactionInfoReceived
// 0x0008 (0x0008 - 0x0000)
struct FortItemTransactionBrief_OnTransactionInfoReceived final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortApplyAbilityBrief.OnUnableToPurchase
// 0x0001 (0x0001 - 0x0000)
struct FortApplyAbilityBrief_OnUnableToPurchase final
{
public:
	EPreventAbilityUseReason                      Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBasicBrief.OnChoiceTextReceived
// 0x0018 (0x0018 - 0x0000)
struct FortBasicBrief_OnChoiceTextReceived final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBasicItemBrief.OnAbleToUse
// 0x0001 (0x0001 - 0x0000)
struct FortBasicItemBrief_OnAbleToUse final
{
public:
	bool                                          bShowWarningMessage;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBasicItemBrief.OnItemInfoReceived
// 0x0010 (0x0010 - 0x0000)
struct FortBasicItemBrief_OnItemInfoReceived final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StackSize;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationUI.FortBasicItemBrief.OnUnableToUse
// 0x0018 (0x0018 - 0x0000)
struct FortBasicItemBrief_OnUnableToUse final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBasicItemBrief.OnUpdateDescriptionText
// 0x0018 (0x0018 - 0x0000)
struct FortBasicItemBrief_OnUpdateDescriptionText final
{
public:
	class FText                                   DescriptionText;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBuyBrief.OnDisplayUnavailability
// 0x0001 (0x0001 - 0x0000)
struct FortBuyBrief_OnDisplayUnavailability final
{
public:
	ECannotBuyReason                              CannotBuyReason;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBuyBrief.OnPurchaseDataReceived
// 0x0008 (0x0008 - 0x0000)
struct FortBuyBrief_OnPurchaseDataReceived final
{
public:
	int32                                         StackSize;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemainingForSale;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnCanInteract
// 0x0001 (0x0001 - 0x0000)
struct FortConversationMarker_OnCanInteract final
{
public:
	bool                                          bCanInteract;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnConversationActorProximityChanged
// 0x0010 (0x0010 - 0x0000)
struct FortConversationMarker_OnConversationActorProximityChanged final
{
public:
	EInteractionRange                             TargetInteractionRange;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortNonPlayerConversationParticipantComponent* ConversationComponent;                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnInteractionRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct FortConversationMarker_OnInteractionRangeChanged final
{
public:
	EInteractionRange                             TargetInteractionRange;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnMessageShownOverActor
// 0x0008 (0x0008 - 0x0000)
struct FortConversationMarker_OnMessageShownOverActor final
{
public:
	class AActor*                                 OverActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnSetIndicatedActor
// 0x0008 (0x0008 - 0x0000)
struct FortConversationMarker_OnSetIndicatedActor final
{
public:
	class AActor*                                 NewIndicatorActor;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMessageWidget.OnMainMessageSet
// 0x0030 (0x0030 - 0x0000)
struct FortConversationMessageWidget_OnMainMessageSet final
{
public:
	class FText                                   NPCName;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   MessageBody;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMessageWidget.OnPreviewMessageSet
// 0x0018 (0x0018 - 0x0000)
struct FortConversationMessageWidget_OnPreviewMessageSet final
{
public:
	class FText                                   PreviewText;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMessageWidget.SetPreviewMessage
// 0x0018 (0x0018 - 0x0000)
struct FortConversationMessageWidget_SetPreviewMessage final
{
public:
	class FText                                   MessageToSet;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.OnSetupFromDisplayAsset
// 0x0008 (0x0008 - 0x0000)
struct FortConversationOption_OnSetupFromDisplayAsset final
{
public:
	class UObject*                                DisplayAsset;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.OnSetupFromItemDef
// 0x0008 (0x0008 - 0x0000)
struct FortConversationOption_OnSetupFromItemDef final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.OnSetupPivotFromRadialInformation
// 0x0008 (0x0008 - 0x0000)
struct FortConversationOption_OnSetupPivotFromRadialInformation final
{
public:
	int32                                         NumElements;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.GetUnlockLevel
// 0x0004 (0x0004 - 0x0000)
struct FortConversationOption_GetUnlockLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.IsAvailable
// 0x0001 (0x0001 - 0x0000)
struct FortConversationOption_IsAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.IsLocked
// 0x0001 (0x0001 - 0x0000)
struct FortConversationOption_IsLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOptionsPanel.AddChildToDynamicPanel
// 0x0010 (0x0010 - 0x0000)
struct FortConversationOptionsPanel_AddChildToDynamicPanel final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPanelSlot*                             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationScreen.OnConversationOptionUnavailable
// 0x0008 (0x0008 - 0x0000)
struct FortConversationScreen_OnConversationOptionUnavailable final
{
public:
	class UFortRadialSlot*                        SelectedEntry;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationScreen.OnItemSelected
// 0x0004 (0x0004 - 0x0000)
struct FortConversationScreen_OnItemSelected final
{
public:
	int32                                         OriginalIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationScreen.OnSelectedItemAvailabilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortConversationScreen_OnSelectedItemAvailabilityChanged final
{
public:
	bool                                          bIsAvailable;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationScreen.ShouldBlockOptionIntroAnim
// 0x0001 (0x0001 - 0x0000)
struct FortConversationScreen_ShouldBlockOptionIntroAnim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortDataDrivenServiceBrief.OnTransactionInfoReceived
// 0x0008 (0x0008 - 0x0000)
struct FortDataDrivenServiceBrief_OnTransactionInfoReceived final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortDataDrivenServiceBrief.OnUnableToPurchase
// 0x0018 (0x0018 - 0x0000)
struct FortDataDrivenServiceBrief_OnUnableToPurchase final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortDuelBrief.DisplayLootItems
// 0x0010 (0x0010 - 0x0000)
struct FortDuelBrief_DisplayLootItems final
{
public:
	TArray<class UFortItem*>                      Items;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortHireBrief.HandleNPCDismissal
// 0x0002 (0x0002 - 0x0000)
struct FortHireBrief_HandleNPCDismissal final
{
public:
	bool                                          bAtMaxNPCNum;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWillDismissNPCAtHire;                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortItemFundBrief.GetDataForKey
// 0x0030 (0x0030 - 0x0000)
struct FortItemFundBrief_GetDataForKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseIndexAdjustment;                               // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortItemFundBrief.InitializeFromContext
// 0x0038 (0x0038 - 0x0000)
struct FortItemFundBrief_InitializeFromContext final
{
public:
	struct FConversationContext                   ConversationContext;                               // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortItemFundBrief.OnProgressUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortItemFundBrief_OnProgressUpdated final
{
public:
	float                                         CurrentFundingFraction;                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortMultiItemFundBrief.UpdateSelectedVisuals
// 0x0004 (0x0004 - 0x0000)
struct FortMultiItemFundBrief_UpdateSelectedVisuals final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortNPCTextDisplay.OnItemNameUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortNPCTextDisplay_OnItemNameUpdated final
{
public:
	class FString                                 ItemName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortQuestBrief.OnQuestExpirationTimeSet
// 0x0001 (0x0001 - 0x0000)
struct FortQuestBrief_OnQuestExpirationTimeSet final
{
public:
	bool                                          bDisplayExpirationTime;                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortQuestBrief.OnQuestInformationRecieved
// 0x00A8 (0x00A8 - 0x0000)
struct FortQuestBrief_OnQuestInformationRecieved final
{
public:
	class FText                                   Objective;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortRarityItemData                    RarityData;                                        // 0x0018(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CategoryTag;                                       // 0x0098(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         XPReward;                                          // 0x009C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MoneyReward;                                       // 0x00A0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationUI.FortShowFutureStormCircleBrief.OnUnableToPurchase
// 0x0001 (0x0001 - 0x0000)
struct FortShowFutureStormCircleBrief_OnUnableToPurchase final
{
public:
	EPreventUseStormCircleServiceReason           Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortTransactionStrip.HandleOnItemCountChanged
// 0x0020 (0x0020 - 0x0000)
struct FortTransactionStrip_HandleOnItemCountChanged final
{
public:
	TScriptInterface<class IFortInventoryOwnerInterface> InventoryOwner;                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                    Definition;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Delta;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationUI.FortTransactionStrip.OnSetTransactionCostVisibility
// 0x0001 (0x0001 - 0x0000)
struct FortTransactionStrip_OnSetTransactionCostVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortTransactionStrip.OnTransactionInfoReceived
// 0x0038 (0x0038 - 0x0000)
struct FortTransactionStrip_OnTransactionInfoReceived final
{
public:
	struct FFortServiceTransactionInfo            TransactionInfo;                                   // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortUpgradeBrief.OnUnableToUpgrade
// 0x0001 (0x0001 - 0x0000)
struct FortUpgradeBrief_OnUnableToUpgrade final
{
public:
	EFortWeaponUpgradeInteractionResult           CannotUpgradeCause;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortUpgradeBrief.OnUpgradeInfoReceived
// 0x0008 (0x0008 - 0x0000)
struct FortUpgradeBrief_OnUpgradeInfoReceived final
{
public:
	class UFortItem*                              CurrentWeapon;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

