#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortCosmeticVariantRow_RichColor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortCosmeticVariantRow_RichColor.FortCosmeticVariantRow_RichColor_C
// 0x0030 (0x0318 - 0x02E8)
class UFortCosmeticVariantRow_RichColor_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_VariantName;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortVariantRichColorChannelVM*         FortVariantRichColorChannelVM;                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTileView*                        TileView_VariantOptions;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDelegateHandleController              NewVar;                                            // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetFortVariantRichColorChannelVM(class UFortVariantRichColorChannelVM* ViewModel);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_FortCosmeticVariantRow_RichColor(int32 EntryPoint);
	void BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);

	void GetDesiredFocusTarget(class UWidget** FocusTarget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortCosmeticVariantRow_RichColor_C">();
	}
	static class UFortCosmeticVariantRow_RichColor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticVariantRow_RichColor_C>();
	}
};

}

