#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteAIServer

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayInteractionsModule_structs.hpp"


namespace SDK
{

// Enum FortniteAIServer.SwitchSeatType
// NumValues: 0x0005
enum class ESwitchSeatType : uint8
{
	ToDriver                                 = 0,
	ToPassenger                              = 1,
	ToGunner                                 = 2,
	ToSpotter                                = 3,
	SwitchSeatType_MAX                       = 4,
};

// Enum FortniteAIServer.EFortAthenaStateTreeTaskFeatureExecutionMode
// NumValues: 0x0004
enum class EFortAthenaStateTreeTaskFeatureExecutionMode : uint32
{
	DoNotExecute                             = 0,
	ExecuteOnEnter                           = 1,
	ExecuteOnExit                            = 2,
	EFortAthenaStateTreeTaskFeatureExecutionMode_MAX = 3,
};

// Enum FortniteAIServer.SeatStatusType
// NumValues: 0x0005
enum class ESeatStatusType : uint8
{
	Driver                                   = 0,
	Passenger                                = 1,
	Gunner                                   = 2,
	Spotter                                  = 3,
	SeatStatusType_MAX                       = 4,
};

// Enum FortniteAIServer.EFortWorldConditionPlayerHasConvertedNPCCondition
// NumValues: 0x0003
enum class EFortWorldConditionPlayerHasConvertedNPCCondition : uint8
{
	HasReachedConvertedNPCLimit              = 0,
	HasAnotherConvertedNPC                   = 1,
	EFortWorldConditionPlayerHasConvertedNPCCondition_MAX = 2,
};

// Enum FortniteAIServer.EFortPointsFromNavGraphGoalPathDistanceFilterOperator
// NumValues: 0x0003
enum class EFortPointsFromNavGraphGoalPathDistanceFilterOperator : uint8
{
	AllGoalsInRange                          = 0,
	AnyGoalInRange                           = 1,
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator_MAX = 2,
};

// Enum FortniteAIServer.EFortTestGoalActorDot
// NumValues: 0x0003
enum class EFortTestGoalActorDot : uint8
{
	Dot3D                                    = 0,
	Dot2D                                    = 1,
	EFortTestGoalActorDot_MAX                = 2,
};

// Enum FortniteAIServer.EDistanceMode
// NumValues: 0x0004
enum class EDistanceMode : uint8
{
	DistItemToContext                        = 0,
	DistItemGoalActorToContext               = 1,
	DistItemToItemGoalActor                  = 2,
	EDistanceMode_MAX                        = 3,
};

// Enum FortniteAIServer.ECountAIAssignedToType
// NumValues: 0x0004
enum class ECountAIAssignedToType : uint8
{
	Goal                                     = 0,
	Actor                                    = 1,
	Assignment                               = 2,
	ECountAIAssignedToType_MAX               = 3,
};

// Enum FortniteAIServer.EFortAthenaAICanMoveState
// NumValues: 0x0007
enum class EFortAthenaAICanMoveState : uint8
{
	None                                     = 0,
	Failed_AgentOffNavmesh                   = 1,
	Failed_GoalOffNavmesh                    = 2,
	Failed_Falling                           = 3,
	Success                                  = 4,
	Success_Partial                          = 5,
	EFortAthenaAICanMoveState_MAX            = 6,
};

// Enum FortniteAIServer.EEvasiveManeuverType
// NumValues: 0x0006
enum class EEvasiveManeuverType : uint8
{
	Crouch                                   = 0,
	Dodge                                    = 1,
	Jump                                     = 2,
	JetpackStrafe                            = 3,
	None                                     = 4,
	EEvasiveManeuverType_MAX                 = 5,
};

// Enum FortniteAIServer.EFreeFallingMode
// NumValues: 0x0005
enum class EFreeFallingMode : uint8
{
	Idle                                     = 0,
	Random                                   = 1,
	TowardNearestAlly                        = 2,
	PatrolPath                               = 3,
	EFreeFallingMode_MAX                     = 4,
};

// Enum FortniteAIServer.EFocusingBehavior
// NumValues: 0x000B
enum class EFocusingBehavior : uint8
{
	FocusCurrentTarget                       = 0,
	IgnoreThreatAfterTimer                   = 1,
	IgnoreThreatAlways                       = 2,
	IgnoreThreatToFlee                       = 3,
	LookAtInvestigate                        = 4,
	LookAtAmbush                             = 5,
	LookAtHeardSound                         = 6,
	LookAtScanAround                         = 7,
	LookAtScanAroundOnly                     = 8,
	Invalid                                  = 9,
	EFocusingBehavior_MAX                    = 10,
};

// Enum FortniteAIServer.ECannotMeleeAttackReason
// NumValues: 0x0006
enum class ECannotMeleeAttackReason : uint8
{
	None                                     = 0,
	CooldownActive                           = 1,
	Other                                    = 2,
	AttackDestinationNotValid                = 3,
	TargetOutsideLeash                       = 4,
	ECannotMeleeAttackReason_MAX             = 5,
};

// Enum FortniteAIServer.EPathTestQueryType
// NumValues: 0x0004
enum class EPathTestQueryType : uint8
{
	NavmeshRaycast2D                         = 0,
	HierarchicalQuery                        = 1,
	RegularPathFinding                       = 2,
	EPathTestQueryType_MAX                   = 3,
};

// Enum FortniteAIServer.EBTSetBlackboardBoolExitActions
// NumValues: 0x0004
enum class EBTSetBlackboardBoolExitActions : uint8
{
	Invert                                   = 0,
	Revert                                   = 1,
	Keep                                     = 2,
	EBTSetBlackboardBoolExitActions_MAX      = 3,
};

// Enum FortniteAIServer.EGlideBehavior
// NumValues: 0x0003
enum class EGlideBehavior : uint8
{
	GlideFocusOnDestination                  = 0,
	GlideSurveyArea                          = 1,
	EGlideBehavior_MAX                       = 2,
};

// Enum FortniteAIServer.EGlideMovementType
// NumValues: 0x0004
enum class EGlideMovementType : uint8
{
	GlideMovementLinear                      = 0,
	GlideMovementSpiral                      = 1,
	GlideMovementSerpentine                  = 2,
	EGlideMovementType_MAX                   = 3,
};

// Enum FortniteAIServer.EActionState
// NumValues: 0x0008
enum class EActionState : uint8
{
	TryingToEquip                            = 0,
	EquippingItem                            = 1,
	UsingItem                                = 2,
	WaitingItemTermination                   = 3,
	WaitBeforeEquippingNextItem              = 4,
	ActionEndedWithNoError                   = 5,
	ActionEndedWithError                     = 6,
	EActionState_MAX                         = 7,
};

// Enum FortniteAIServer.EEncampmentRole
// NumValues: 0x0004
enum class EEncampmentRole : uint8
{
	Guard                                    = 0,
	Build                                    = 1,
	Count                                    = 2,
	EEncampmentRole_MAX                      = 3,
};

// Enum FortniteAIServer.EHasMatchingGameplayTagContainerTestType
// NumValues: 0x0003
enum class EHasMatchingGameplayTagContainerTestType : uint8
{
	Any                                      = 0,
	All                                      = 1,
	EHasMatchingGameplayTagContainerTestType_MAX = 2,
};

// Enum FortniteAIServer.EFortAthenaArithmeticOperation
// NumValues: 0x0005
enum class EFortAthenaArithmeticOperation : uint8
{
	Add                                      = 0,
	Subtract                                 = 1,
	Multiply                                 = 2,
	Divide                                   = 3,
	EFortAthenaArithmeticOperation_MAX       = 4,
};

// Enum FortniteAIServer.EFortAthenaPlayContextualAnimExecutionMethod
// NumValues: 0x0005
enum class EFortAthenaPlayContextualAnimExecutionMethod : uint8
{
	StartInteraction                         = 0,
	JoinInteraction                          = 1,
	TransitionAllActors                      = 2,
	TransitionSingleActor                    = 3,
	EFortAthenaPlayContextualAnimExecutionMethod_MAX = 4,
};

// ScriptStruct FortniteAIServer.PositioningEQS
// 0x0050 (0x0050 - 0x0000)
struct FPositioningEQS final
{
public:
	struct FGameplayTagQuery                      ItemTagQuery;                                      // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UEnvQuery*                              QueryTemplate;                                     // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.EquippedItemTagAssociationData
// 0x0090 (0x0090 - 0x0000)
struct FEquippedItemTagAssociationData final
{
public:
	struct FGameplayTagQuery                      ItemTagQuery;                                      // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      TokenSystemTagQuery;                               // 0x0048(0x0048)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaHandleSoftDisableGuardStateTreeTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FFortAthenaHandleSoftDisableGuardStateTreeTaskInstanceData final
{
public:
	struct FStateTreeStructRef                    SoftDisableStateReference;                         // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToTeleportOnFailure;                         // 0x0010(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaHandleSoftDisableGuardStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaHandleSoftDisableGuardStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaSoftDisableStateTreeParameter
// 0x0010 (0x0010 - 0x0000)
struct FFortAthenaSoftDisableStateTreeParameter final
{
public:
	TArray<class AActor*>                         ActorsToTeleportOnExit;                            // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaHandleSoftDisableStateTreeTaskInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FFortAthenaHandleSoftDisableStateTreeTaskInstanceData final
{
public:
	TArray<class AActor*>                         ActorsToCleanup;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bHasReceivedSoftDisableEvent;                      // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           ReceivedSoftDisableEvent;                          // 0x0014(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAthenaSoftDisableStateTreeParameter OutState;                                        // 0x0018(0x0010)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaHandleSoftDisableStateTreeTask
// 0x0028 (0x0048 - 0x0020)
struct FFortAthenaHandleSoftDisableStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FGameplayTag                           StateTreeEventTag;                                 // 0x0020(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                TeleportOnNavmeshQueryBoxExtents;                  // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxTeleportToTryPerActor;                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaPickRandomMontageConfig
// 0x0010 (0x0010 - 0x0000)
struct FFortAthenaPickRandomMontageConfig final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RandomWeight;                                      // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaPickRandomMontageStateTreeTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FFortAthenaPickRandomMontageStateTreeTaskInstanceData final
{
public:
	TArray<struct FFortAthenaPickRandomMontageConfig> PossibleMontages;                              // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAnimMontage*                           PickedMontage;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaPickRandomMontageStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaPickRandomMontageStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaToggleAllowInteractStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FFortAthenaToggleAllowInteractStateTreeTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaToggleAllowInteractStateTreeTaskTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FFortAthenaToggleAllowInteractStateTreeTaskTreeTask final : public FStateTreeTaskCommonBase
{
public:
	EFortAthenaStateTreeTaskFeatureExecutionMode  AddExecutionMode;                                  // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortAthenaStateTreeTaskFeatureExecutionMode  RemoveExecutionMode;                               // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct FortniteAIServer.FortAthenaTrackEventConsumeStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FFortAthenaTrackEventConsumeStateTreeTaskInstanceData final
{
public:
	struct FStateTreeStructRef                    ReferencedEvent;                                   // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaTrackEventConsumeStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaTrackEventConsumeStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaTrackEventStateTreeTaskStateTreeParameter
// 0x0008 (0x0008 - 0x0000)
struct FFortAthenaTrackEventStateTreeTaskStateTreeParameter final
{
public:
	bool                                          bHasReceivedTrackedEvent;                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           ReceivedEventTag;                                  // 0x0004(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaTrackEventStateTreeTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FFortAthenaTrackEventStateTreeTaskInstanceData final
{
public:
	struct FFortAthenaTrackEventStateTreeTaskStateTreeParameter OutParameter;                        // 0x0000(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaTrackEventStateTreeTask
// 0x0050 (0x0070 - 0x0020)
struct FFortAthenaTrackEventStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FGameplayTagQuery                      EventTagQuery;                                     // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StateTreeEventTag;                                 // 0x0068(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaWorldConditionInstanceData
// 0x0050 (0x0050 - 0x0000)
struct FFortAthenaWorldConditionInstanceData final
{
public:
	class AActor*                                 ActorA;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorB;                                            // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorC;                                            // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutResult;                                        // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWorldConditionQueryState              QueryState;                                        // 0x0020(0x0030)(NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaWorldConditionInstanceDataStateTreeTask
// 0x0020 (0x0040 - 0x0020)
struct FFortAthenaWorldConditionInstanceDataStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FWorldConditionQueryDefinition         Conditions;                                        // 0x0020(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           StateTreeEventTag;                                 // 0x0038(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortBTService_InjectionTagKey
// 0x0008 (0x0008 - 0x0000)
struct FFortBTService_InjectionTagKey final
{
public:
	struct FGameplayTag                           InjectionTag;                                      // 0x0000(0x0004)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InjectionKeyName;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortWorldConditionGameplayTagActorQueryState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FFortWorldConditionGameplayTagActorQueryState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortWorldConditionGameplayTagActor
// 0x0030 (0x0040 - 0x0010)
struct FFortWorldConditionGameplayTagActor final : public FWorldConditionCommonBase
{
public:
	struct FWorldConditionContextDataRef          ActorContextRef;                                   // 0x0010(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TagContainerToCheck;                               // 0x0018(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	EHasMatchingGameplayTagContainerTestType      TestType;                                          // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortWorldConditionPlayerHasConvertedNPC
// 0x0010 (0x0020 - 0x0010)
struct FFortWorldConditionPlayerHasConvertedNPC final : public FWorldConditionCommonActorBase
{
public:
	struct FWorldConditionContextDataRef          ActorRef;                                          // 0x0010(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EFortWorldConditionPlayerHasConvertedNPCCondition ConditionToCheck;                              // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortWorldConditionTimeOfDay
// 0x0010 (0x0020 - 0x0010)
struct FFortWorldConditionTimeOfDay final : public FWorldConditionCommonBase
{
public:
	struct FWorldConditionContextDataRef          ActorContextRef;                                   // 0x0010(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         ValidTimesOfDay;                                   // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortWorldConditionWorldStatState
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FFortWorldConditionWorldStatState final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortWorldConditionWorldStat
// 0x0010 (0x0020 - 0x0010)
struct FFortWorldConditionWorldStat final : public FWorldConditionCommonBase
{
public:
	class UFortWorldStatDefinition*               WorldStatDefinition;                               // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        Value;                                             // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.GameFeatureFortAIEvaluatorEntry
// 0x0048 (0x0048 - 0x0000)
struct FGameFeatureFortAIEvaluatorEntry final
{
public:
	TSoftObjectPtr<class UBehaviorTree>           TreeAsset;                                         // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InjectionTag;                                      // 0x0020(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftClassPtr<class UClass>                   AIEvaluatorClass;                                  // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortPointOnCurveRange
// 0x0008 (0x0008 - 0x0000)
struct FFortPointOnCurveRange final
{
public:
	float                                         MinPercentage;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPercentage;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortPointsOnCurve
// 0x0030 (0x0030 - 0x0000)
struct FFortPointsOnCurve final
{
public:
	TSoftObjectPtr<class UCurveFloat>             Curve;                                             // 0x0000(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortPointOnCurveRange>         RangesForPointsOnCurve;                            // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortQueryGenerator_PerceivedActors_Settings
// 0x0040 (0x0040 - 0x0000)
struct FFortQueryGenerator_PerceivedActors_Settings final
{
public:
	bool                                          bIgnoreDBNOPawns;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreSleepingAIs;                                // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAIDataProviderFloatValue              MaxTimeSincePerceived;                             // 0x0008(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortGameplayTagQueryPerDifficulty
// 0x0060 (0x0060 - 0x0000)
struct FFortGameplayTagQueryPerDifficulty final
{
public:
	struct FDataTableRowHandle                    DifficultyInfo;                                    // 0x0000(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      TagQueryToMatch;                                   // 0x0010(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         Difficulty;                                        // 0x0058(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.GoalDistanceData
// 0x0098 (0x0098 - 0x0000)
struct FGoalDistanceData final
{
public:
	bool                                          bIgnoreScreeningDistance;                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAIDataProviderFloatValue              ScreeningTestMaxDistance;                          // 0x0008(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCurveFloat>             TestScoreCurve;                                    // 0x0040(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              CurveDistanceScale;                                // 0x0060(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.MimicConverterAbilityData
// 0x0068 (0x0068 - 0x0000)
struct FMimicConverterAbilityData final
{
public:
	struct FGameplayTagQuery                      RequiredConverterAbilityTags;                      // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilitiesToApply;                                  // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FlankingLocationInfo
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FFlankingLocationInfo final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FailedToReachPOI
// 0x0008 (0x0008 - 0x0000)
struct FFailedToReachPOI final
{
public:
	int32                                         BotPOIID;                                          // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FailCount;                                         // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.SmartObjectActivityResult
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FSmartObjectActivityResult final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.GameplayAbilityEvaluatorModule
// 0x0028 (0x0028 - 0x0000)
struct FGameplayAbilityEvaluatorModule final
{
public:
	struct FGameplayTagContainer                  GameplayAbilityTag;                                // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                CachedAbilitySystemComponent;                      // 0x0020(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.GameplayTagActorHasMatchingGameplayTagInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FGameplayTagActorHasMatchingGameplayTagInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagToCheck;                                        // 0x0008(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.GameplayTagActorHasMatchingGameplayTagCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayTagActorHasMatchingGameplayTagCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.GameplayTagActorHasMatchingGameplayTagContainerInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FGameplayTagActorHasMatchingGameplayTagContainerInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TagContainerToCheck;                               // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.GameplayTagActorHasMatchingGameplayContainerTagCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayTagActorHasMatchingGameplayContainerTagCondition final : public FStateTreeConditionCommonBase
{
public:
	EHasMatchingGameplayTagContainerTestType      TestType;                                          // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaAddGameplayTagsStateTreeTaskInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FFortAthenaAddGameplayTagsStateTreeTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaAddGameplayTagsStateTreeTask
// 0x0010 (0x0030 - 0x0020)
struct FFortAthenaAddGameplayTagsStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	bool                                          bReplicateChange;                                  // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	EFortAthenaStateTreeTaskFeatureExecutionMode  AddExecutionMode;                                  // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortAthenaStateTreeTaskFeatureExecutionMode  RemoveExecutionMode;                               // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaArithmeticStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FFortAthenaArithmeticStateTreeTask : public FStateTreeTaskCommonBase
{
public:
	EGameplayInteractionTaskTrigger               OperationTrigger;                                  // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortAthenaArithmeticOperation                Operation;                                         // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaIntArithmeticStateTreeTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FFortAthenaIntArithmeticStateTreeTaskInstanceData final
{
public:
	int32                                         FirstOperand;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SecondOperand;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStructRef                    ReferencedResult;                                  // 0x0008(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaIntArithmeticStateTreeTask
// 0x0000 (0x0028 - 0x0028)
struct FFortAthenaIntArithmeticStateTreeTask final : public FFortAthenaArithmeticStateTreeTask
{
};

// ScriptStruct FortniteAIServer.FortAthenaFocusAtStateTreeTaskInstanceData
// 0x0090 (0x0090 - 0x0000)
struct FFortAthenaFocusAtStateTreeTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FocusActor;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FocusActorOffset;                                  // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FocusWorldPoint;                                   // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetBackOnExit;                                    // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x4F];                                      // 0x0041(0x004F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaFocusAtStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaFocusAtStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaIntStateTreeParameter
// 0x0004 (0x0004 - 0x0000)
struct FFortAthenaIntStateTreeParameter final
{
public:
	int32                                         Int;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaMakeIntVariableStateTreeTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FFortAthenaMakeIntVariableStateTreeTaskInstanceData final
{
public:
	int32                                         DefaultIntValue;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAthenaIntStateTreeParameter       OutInt;                                            // 0x0004(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaMakeIntVariableStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FFortAthenaMakeIntVariableStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	bool                                          bResetOnReselect;                                  // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaPlayContextualAnimStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaPlayContextualAnimStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaPlayInteractionStateTreeTaskActorInfo
// 0x0024 (0x0024 - 0x0000)
struct alignas(0x04) FFortAthenaPlayInteractionStateTreeTaskActorInfo final
{
public:
	uint8                                         Pad_0[0x24];                                       // 0x0000(0x0024)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaStateTreeCrouchTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FFortAthenaStateTreeCrouchTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaStateTreeCrouchTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaStateTreeCrouchTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaStateTreeInteractTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FFortAthenaStateTreeInteractTaskInstanceData final
{
public:
	ETInteractionType                             InteractType;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InteractTargetActor;                               // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractDuration;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaStateTreeInteractTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaStateTreeInteractTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaStateTreeLookAroundTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FFortAthenaStateTreeLookAroundTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtDurationMin;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtDurationMax;                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtDuration;                                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaStateTreeLookAroundTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaStateTreeLookAroundTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaTeleportToActorStateTreeTaskInstanceData
// 0x0040 (0x0040 - 0x0000)
struct FFortAthenaTeleportToActorStateTreeTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TeleportRelativeLocation;                          // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TeleportRelativeRotation;                          // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAIServer.FortAthenaTeleportToActorStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FFortAthenaTeleportToActorStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct FortniteAIServer.FortAthenaToggleGameplayEffectStateTreeTaskInstanceData
// 0x00C8 (0x00C8 - 0x0000)
struct FFortAthenaToggleGameplayEffectStateTreeTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    GameplayEffectClassesToAdd;                        // 0x0010(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bAutomaticallyRemoveAddedEffectsOnExit;            // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TSubclassOf<class UGameplayEffect>>    GameplayEffectClassesToRemove;                     // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayEffectsByTagsToRemove;                     // 0x0038(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayEffectsBySourceTagsToRemove;               // 0x0058(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayEffectsByAppliedTagsToRemove;              // 0x0078(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayEffectsByGrantedTagsToRemove;              // 0x0098(0x0020)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAIServer.FortAthenaToggleGameplayEffectStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FFortAthenaToggleGameplayEffectStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	EFortAthenaStateTreeTaskFeatureExecutionMode  AddExecutionMode;                                  // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortAthenaStateTreeTaskFeatureExecutionMode  RemoveExecutionMode;                               // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct FortniteAIServer.FortWorldConditionWorldState
// 0x0048 (0x0058 - 0x0010)
struct FFortWorldConditionWorldState final : public FWorldConditionCommonBase
{
public:
	struct FGameplayTagQuery                      WorldStateQuery;                                   // 0x0010(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
};

}

