#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteAIServer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteAIServer_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayInteractionsModule_structs.hpp"
#include "GameplayInteractionsModule_classes.hpp"
#include "StateTreeModule_classes.hpp"
#include "ContextualAnimation_structs.hpp"


namespace SDK
{

// Class FortniteAIServer.FortAthenaAIBotEvaluator_TagQuery
// 0x0050 (0x00F8 - 0x00A8)
class UFortAthenaAIBotEvaluator_TagQuery : public UFortAthenaAIBotEvaluator
{
public:
	struct FGameplayTagQuery                      TagQuery;                                          // 0x00A8(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	class UAbilitySystemComponent*                CachedAbilitySystemComponent;                      // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_TagQuery">();
	}
	static class UFortAthenaAIBotEvaluator_TagQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_TagQuery>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_ApproachNearbyPawns
// 0x0128 (0x02D0 - 0x01A8)
class UFortAthenaAIBotEvaluator_ApproachNearbyPawns final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_1A8[0x20];                                     // 0x01A8(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         MaxApproaches;                                     // 0x01C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortNearbyActorsPerceptionConfiguration PerceptionConfiguration;                         // 0x01F0(0x00D0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   EnableKeyName;                                     // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0xC];                                      // 0x02C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_ApproachNearbyPawns">();
	}
	static class UFortAthenaAIBotEvaluator_ApproachNearbyPawns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_ApproachNearbyPawns>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_Harvest
// 0x0148 (0x02F0 - 0x01A8)
class UFortAthenaAIBotEvaluator_Harvest final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_1A8[0x40];                                     // 0x01A8(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UNavigationQueryFilter>     ProjectionNavigationQueryFilterClass;              // 0x01E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UNavigationQueryFilter>     ValidNavigationQueryFilterClassOverride;           // 0x01F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaximumTimeToHelpFromLastPlayerDamage;             // 0x01F8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         KeepTargetTimeOnWeaponTrigger;                     // 0x0220(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AmountOfTimesPlayerBuiltStructuresNeedToBeDamaged; // 0x0248(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToTrackDamagedActors;                          // 0x0270(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxDistanceFromActorForFallbackNoHarvestBehaviour; // 0x0298(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   HarvestTargetKeyName;                              // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   HarvestTargetHitPointKeyName;                      // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   HarvestDestinationKeyName;                         // 0x02D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   FallbackBehaviorKeyName;                           // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   CannotDamageKeyName;                               // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   WeaponTriggerMeleeKeyName;                         // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleConverted(const class AFortPawn* InstigatorPawn, const class AFortPawn* ConvertedPawn);
	void HandleUnconverted(const class AFortPawn* UnconvertedPawn, EUnconvertReason UnconvertReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_Harvest">();
	}
	static class UFortAthenaAIBotEvaluator_Harvest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_Harvest>();
	}
};

// Class FortniteAIServer.FortQueryTest_CurieState
// 0x0048 (0x0240 - 0x01F8)
class UFortQueryTest_CurieState final : public UEnvQueryTest
{
public:
	struct FGameplayTagQuery                      CurieStateQuery;                                   // 0x01F8(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryTest_CurieState">();
	}
	static class UFortQueryTest_CurieState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_CurieState>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_MoveAway
// 0x0108 (0x02B0 - 0x01A8)
class UFortAthenaAIBotEvaluator_MoveAway final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_1A8[0x70];                                     // 0x01A8(0x0070)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         MaxSecondsToReactToBump;                           // 0x0218(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSecondsToReactToBox;                            // 0x0240(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinSecondsBetweenInstantReactions;                 // 0x0268(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class UEnvQuery*                              FindAwayLocationFromPawnQueryTemplate;             // 0x0290(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEnvQueryRunMode                              FindAwayLocationFromPawnRunMode;                   // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UEnvQuery*                              FindAwayLocationFromBoxQueryTemplate;              // 0x02A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEnvQueryRunMode                              FindAwayLocationFromBoxRunMode;                    // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_MoveAway">();
	}
	static class UFortAthenaAIBotEvaluator_MoveAway* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_MoveAway>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_Attack
// 0x0018 (0x01C0 - 0x01A8)
class UFortAthenaAIBotEvaluator_Attack : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_1A8[0x4];                                      // 0x01A8(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   WeaponKeyName;                                     // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MoveToDestinationKeyName;                          // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TargetActorName;                                   // 0x01B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_Attack">();
	}
	static class UFortAthenaAIBotEvaluator_Attack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_Attack>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_Escape
// 0x0030 (0x01D8 - 0x01A8)
class UFortAthenaAIBotEvaluator_Escape final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	struct FGameplayTagContainer                  EscapeTags;                                        // 0x01A8(0x0020)(Edit, NativeAccessSpecifierPrivate)
	float                                         CooldownBetweenAggressivenessChanges;              // 0x01C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   AggressivenessName;                                // 0x01CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x8];                                      // 0x01D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_Escape">();
	}
	static class UFortAthenaAIBotEvaluator_Escape* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_Escape>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_TokenPosition
// 0x0058 (0x0218 - 0x01C0)
class UFortAthenaAIBotEvaluator_TokenPosition final : public UFortAthenaAIBotEvaluator_Attack
{
public:
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPositioningEQS>                EQSs;                                              // 0x01D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bAllowSamePositionSelection;                       // 0x01E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         TokenPositionCooldown;                             // 0x01E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TokenPositionCooldownVariation;                    // 0x01E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NextPositionTimestamp;                             // 0x01EC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasCurrentDestination;                            // 0x01F0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F1[0xF];                                      // 0x01F1(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortAICombatTokenConsumerComponent*    CachedTokenConsumerComponent;                      // 0x0200(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortAICombatTokenProviderComponent> CachedTokenProviderComponent;          // 0x0208(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RunningEQSRequestID;                               // 0x0210(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_TokenPosition">();
	}
	static class UFortAthenaAIBotEvaluator_TokenPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_TokenPosition>();
	}
};

// Class FortniteAIServer.FortAthenaAIEvaluator_AbovePhysicsObject
// 0x0000 (0x00A0 - 0x00A0)
class UFortAthenaAIEvaluator_AbovePhysicsObject final : public UFortAthenaAIEvaluator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIEvaluator_AbovePhysicsObject">();
	}
	static class UFortAthenaAIEvaluator_AbovePhysicsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIEvaluator_AbovePhysicsObject>();
	}
};

// Class FortniteAIServer.FortQueryGenerator_RandomPointsInBoundingVolume
// 0x0040 (0x00C8 - 0x0088)
class UFortQueryGenerator_RandomPointsInBoundingVolume final : public UEnvQueryGenerator_ProjectedPoints
{
public:
	TSubclassOf<class UEnvQueryContext>           GenerateIn;                                        // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAIDataProviderFloatValue              RandomPointsCount;                                 // 0x0090(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryGenerator_RandomPointsInBoundingVolume">();
	}
	static class UFortQueryGenerator_RandomPointsInBoundingVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryGenerator_RandomPointsInBoundingVolume>();
	}
};

// Class FortniteAIServer.FortAthenaBTService_MovementStyle
// 0x0008 (0x0078 - 0x0070)
class UFortAthenaBTService_MovementStyle final : public UBTService
{
public:
	EFortMovementStyle                            MovementStyle;                                     // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTService_MovementStyle">();
	}
	static class UFortAthenaBTService_MovementStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTService_MovementStyle>();
	}
};

// Class FortniteAIServer.FortAthenaBTService_TokenQuery
// 0x0020 (0x0090 - 0x0070)
class UFortAthenaBTService_TokenQuery final : public UBTService
{
public:
	TArray<struct FEquippedItemTagAssociationData> EquippedItemTagAssociationDatas;                  // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FName                                   WeaponKeyName;                                     // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TargetActorName;                                   // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTService_TokenQuery">();
	}
	static class UFortAthenaBTService_TokenQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTService_TokenQuery>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_FreeFalling
// 0x0108 (0x01B0 - 0x00A8)
class UFortAthenaAIBotEvaluator_FreeFalling final : public UFortAthenaAIBotEvaluator
{
public:
	class FName                                   DiveExecutionStatusKeyName;                        // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DiveDestinationKeyName;                            // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   GlideExecutionStatusKeyName;                       // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   GlideDestinationKeyName;                           // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   JumpOffBusDestinationName;                         // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC[0xA];                                       // 0x00BC(0x000A)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bRandomlySelectFreeFallingMode;                    // 0x00C6(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         IdleWeight;                                        // 0x00C8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RandomWeight;                                      // 0x00F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TowardNearestAllyWeight;                           // 0x0118(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EFreeFallingMode                              FreeFallingMode;                                   // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MaxOffsetRangeFromNearestAlly;                     // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bShouldRecomputeDestinationWhenTowardNearestAlly : 1; // 0x0148(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bShouldSearchAllyInSquad : 1;                      // 0x0148(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bShouldSearchAllyInTeam : 1;                       // 0x0148(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bGlideAllowed : 1;                                 // 0x0148(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SkyTubeDivingStuckTimeThreshold;                   // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x20];                                     // 0x0150(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerStateAthena*                 NearestAlly;                                       // 0x0170(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                CachedLatestDestination;                           // 0x0178(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaAIBotMovementDigestedSkillSet* CacheMovementDigestedSkillSet;                   // 0x0190(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortSkyTube*                           CachedSkyTube;                                     // 0x01A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_FreeFalling">();
	}
	static class UFortAthenaAIBotEvaluator_FreeFalling* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_FreeFalling>();
	}
};

// Class FortniteAIServer.FortBTWorldConditionSchema
// 0x0010 (0x0048 - 0x0038)
class UFortBTWorldConditionSchema final : public UWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBTWorldConditionSchema">();
	}
	static class UFortBTWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBTWorldConditionSchema>();
	}
};

// Class FortniteAIServer.FortAthenaBTService_WorldCondition
// 0x0068 (0x00D8 - 0x0070)
class UFortAthenaBTService_WorldCondition final : public UBTService
{
public:
	struct FWorldConditionQueryDefinition         Conditions;                                        // 0x0070(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   ConditionsResultName;                              // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWorldConditionQueryState              QueryState;                                        // 0x0090(0x0030)(NativeAccessSpecifierPrivate)
	class AAIController*                          CachedOwnerController;                             // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 CachedOwnerPawn;                                   // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTService_WorldCondition">();
	}
	static class UFortAthenaBTService_WorldCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTService_WorldCondition>();
	}
};

// Class FortniteAIServer.FortQueryTest_GoalBase
// 0x0070 (0x0268 - 0x01F8)
class UFortQueryTest_GoalBase : public UEnvQueryTest
{
public:
	uint8                                         bScoreEnemies : 1;                                 // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bScoreEncounterGoals : 1;                          // 0x01F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bScoreWorldGoals : 1;                              // 0x01F8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bScoreSpecificAssignments : 1;                     // 0x01F8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFortAIAssignmentIdentifier>    AssignmentIDs;                                     // 0x0200(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAIAssignmentIdentifier>    ProhibitedAssignmentIDs;                           // 0x0210(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      GoalActorTagQuery;                                 // 0x0220(0x0048)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryTest_GoalBase">();
	}
	static class UFortQueryTest_GoalBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_GoalBase>();
	}
};

// Class FortniteAIServer.FortQueryTest_GoalActorTimeSinceSpawn
// 0x0000 (0x0268 - 0x0268)
class UFortQueryTest_GoalActorTimeSinceSpawn final : public UFortQueryTest_GoalBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryTest_GoalActorTimeSinceSpawn">();
	}
	static class UFortQueryTest_GoalActorTimeSinceSpawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_GoalActorTimeSinceSpawn>();
	}
};

// Class FortniteAIServer.FortAthenaBTTask_Harvest
// 0x0028 (0x0098 - 0x0070)
class UFortAthenaBTTask_Harvest final : public UBTTaskNode
{
public:
	class FName                                   HarvestExecutionStatusKeyName;                     // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   HarvestTargetKeyName;                              // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   HarvestTargetHitPointKeyName;                      // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   HarvestDestinationKeyName;                         // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   WeaponTriggerMeleeKeyName;                         // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTTask_Harvest">();
	}
	static class UFortAthenaBTTask_Harvest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTTask_Harvest>();
	}
};

// Class FortniteAIServer.FortAthenaBTTask_ReactToVerb
// 0x0010 (0x0080 - 0x0070)
class UFortAthenaBTTask_ReactToVerb final : public UBTTaskNode
{
public:
	class FName                                   ReactToVerbExecutionStatusKeyName;                 // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   GameplayEffectReactionKeyName;                     // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTTask_ReactToVerb">();
	}
	static class UFortAthenaBTTask_ReactToVerb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTTask_ReactToVerb>();
	}
};

// Class FortniteAIServer.FortAthenaAIBotEvaluator_HitAndRun
// 0x00F8 (0x02A0 - 0x01A8)
class UFortAthenaAIBotEvaluator_HitAndRun final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	struct FScalableFloat                         AttackDurationBeforeEvade;                         // 0x01A8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MeleeAttackMaxDistToEvade;                         // 0x01D0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ClampEvadeDistanceEnable;                          // 0x01F8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinDistanceToEvade;                                // 0x0220(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxDistanceToEvade;                                // 0x0248(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   EvadeKeyName;                                      // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   EvadeMovementStateKeyName;                         // 0x0274(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   EvadeDestinationKeyName;                           // 0x0278(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   WeaponTriggerMeleeName;                            // 0x027C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x10];                                     // 0x0280(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MeleeAttackMaxDistToEvadeSqr;                      // 0x0290(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxDistanceToEvadeSqr;                             // 0x0294(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_HitAndRun">();
	}
	static class UFortAthenaAIBotEvaluator_HitAndRun* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_HitAndRun>();
	}
};

// Class FortniteAIServer.FortAthenaBTTask_VehicleSwitchSeat
// 0x0008 (0x0078 - 0x0070)
class UFortAthenaBTTask_VehicleSwitchSeat final : public UBTTaskNode
{
public:
	ESwitchSeatType                               SwitchSeatType;                                    // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTTask_VehicleSwitchSeat">();
	}
	static class UFortAthenaBTTask_VehicleSwitchSeat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTTask_VehicleSwitchSeat>();
	}
};

// Class FortniteAIServer.FortStateTreeConditionSchema
// 0x0018 (0x0050 - 0x0038)
class UFortStateTreeConditionSchema final : public UWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStateTreeConditionSchema">();
	}
	static class UFortStateTreeConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStateTreeConditionSchema>();
	}
};

// Class FortniteAIServer.FortQueryTest_BuildingCriteria
// 0x0650 (0x08B8 - 0x0268)
class UFortQueryTest_BuildingCriteria final : public UFortQueryTest_GoalBase
{
public:
	struct FAIDataProviderFloatValue              ScoreForGroundSupportedFloor;                      // 0x0268(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              ScoreForBeingGroundSupported;                      // 0x02A0(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              ScoreForTraps;                                     // 0x02D8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              ScoreForWalls;                                     // 0x0310(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              ScoreForNavigableOpening;                          // 0x0348(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortAIAssignmentIdentifier            RootAssignmentID;                                  // 0x0380(0x0030)(Edit, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               bPreferCloserToRootAssignment;                     // 0x03B0(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              ScoreForDistanceFromClosestRootAssignmentGoal;     // 0x03E8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MinDistanceForDistanceScoring;                     // 0x0420(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MaxDistanceForDistanceScoring;                     // 0x0458(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MaxHealthScore;                                    // 0x0490(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               bPreferHigherHealth;                               // 0x04C8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              ClampMaxHealthValue;                               // 0x0500(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              ClampMinHealthValue;                               // 0x0538(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               bPreferHigherHealthPercentage;                     // 0x0570(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MaxHealthPercentageScore;                          // 0x05A8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               bWantsBuildingRepairableByOwner;                   // 0x05E0(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              RepairableBuildingScore;                           // 0x0618(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              NotRepairableBuildingScore;                        // 0x0650(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              NeedsRepairBuildingScore;                          // 0x0688(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              DoesntNeedsRepairBuildingScore;                    // 0x06C0(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               bWantsDamagedByFriendly;                           // 0x06F8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              DamagedByFriendlyMaxLifespan;                      // 0x0730(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              DamagedByFriendlyMinDamage;                        // 0x0768(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              DamagedByFriendlyScore;                            // 0x07A0(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               bWantsDamagedByEnemy;                              // 0x07D8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              DamagedByEnemyMaxLifespan;                         // 0x0810(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              DamagedByEnemyMinDamage;                           // 0x0848(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              DamagedByEnemyScore;                               // 0x0880(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryTest_BuildingCriteria">();
	}
	static class UFortQueryTest_BuildingCriteria* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_BuildingCriteria>();
	}
};

// Class FortniteAIServer.FortBTDecorator_AIBotVehicleSeatStatus
// 0x0008 (0x0070 - 0x0068)
class UFortBTDecorator_AIBotVehicleSeatStatus final : public UBTDecorator
{
public:
	ESeatStatusType                               SeatType;                                          // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBTDecorator_AIBotVehicleSeatStatus">();
	}
	static class UFortBTDecorator_AIBotVehicleSeatStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBTDecorator_AIBotVehicleSeatStatus>();
	}
};

// Class FortniteAIServer.FortBTService_AIEvaluatorsInjector
// 0x0020 (0x0090 - 0x0070)
class UFortBTService_AIEvaluatorsInjector final : public UBTService
{
public:
	TArray<class UObject*>                        ReferenceHolder;                                   // 0x0070(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FFortBTService_InjectionTagKey> InjectionTagsKeys;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBTService_AIEvaluatorsInjector">();
	}
	static class UFortBTService_AIEvaluatorsInjector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBTService_AIEvaluatorsInjector>();
	}
};

// Class FortniteAIServer.FortQueryTest_HotspotSlotOrientation
// 0x0040 (0x0238 - 0x01F8)
class UFortQueryTest_HotspotSlotOrientation final : public UEnvQueryTest
{
public:
	TSubclassOf<class UEnvQueryContext>           FaceToward;                                        // 0x01F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              DotThreshold;                                      // 0x0200(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryTest_HotspotSlotOrientation">();
	}
	static class UFortQueryTest_HotspotSlotOrientation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_HotspotSlotOrientation>();
	}
};

// Class FortniteAIServer.FortBTService_ClearGoalAndAssignment
// 0x0000 (0x0070 - 0x0070)
class UFortBTService_ClearGoalAndAssignment final : public UBTService
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBTService_ClearGoalAndAssignment">();
	}
	static class UFortBTService_ClearGoalAndAssignment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBTService_ClearGoalAndAssignment>();
	}
};

// Class FortniteAIServer.FortAthenaNpcEvaluator_Encampment
// 0x02A8 (0x0450 - 0x01A8)
class UFortAthenaNpcEvaluator_Encampment final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	struct FScalableFloat                         EncampmentEnable;                                  // 0x01A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EncampmentTentativeDelayMin;                       // 0x01D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EncampmentTentativeDelayMax;                       // 0x01F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EncampmentDurationMin;                             // 0x0220(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EncampmentDurationMax;                             // 0x0248(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         BuilderPercentage;                                 // 0x0270(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         BuilderMinDistance;                                // 0x0298(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         BuilderMaxDistance;                                // 0x02C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GuardMinDistance;                                  // 0x02E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GuardMaxDistance;                                  // 0x0310(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AllowInSwimming;                                   // 0x0338(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AllowInFalling;                                    // 0x0360(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinSquadMembersCountToBuild;                       // 0x0388(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FName                                   EncampmentStatusKeyName;                           // 0x03B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   EncampmentMovementStateKeyName;                    // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   EncampmentCenterLocationKeyName;                   // 0x03C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   EncampmentDestinationKeyName;                      // 0x03C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   EncampmentAroundCampFireLocationKeyName;           // 0x03D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   EncampmentRoleKeyName;                             // 0x03D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   DefensiveBuildName;                                // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E4[0x6C];                                     // 0x03E4(0x006C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaNpcEvaluator_Encampment">();
	}
	static class UFortAthenaNpcEvaluator_Encampment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaNpcEvaluator_Encampment>();
	}
};

// Class FortniteAIServer.FortGameFeatureAction_InjectAIBehavior
// 0x0010 (0x0048 - 0x0038)
class UFortGameFeatureAction_InjectAIBehavior final : public UFortGameInstanceGameFeatureAction
{
public:
	TArray<struct FFortAISpawnerTagQueryInjectedBehavior> InjectedBehaviors;                         // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameFeatureAction_InjectAIBehavior">();
	}
	static class UFortGameFeatureAction_InjectAIBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameFeatureAction_InjectAIBehavior>();
	}
};

// Class FortniteAIServer.FortQueryTest_GoalOverallDamageCaused
// 0x0000 (0x0268 - 0x0268)
class UFortQueryTest_GoalOverallDamageCaused final : public UFortQueryTest_GoalBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryTest_GoalOverallDamageCaused">();
	}
	static class UFortQueryTest_GoalOverallDamageCaused* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_GoalOverallDamageCaused>();
	}
};

// Class FortniteAIServer.FortInjectedBehaviorsComponent
// 0x0050 (0x00F0 - 0x00A0)
class UFortInjectedBehaviorsComponent final : public UFortGameStateComponent
{
public:
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortInjectedBehaviorsComponent">();
	}
	static class UFortInjectedBehaviorsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortInjectedBehaviorsComponent>();
	}
};

// Class FortniteAIServer.FortQueryContext_NearbyFactionMembers
// 0x0028 (0x0050 - 0x0028)
class UFortQueryContext_NearbyFactionMembers final : public UEnvQueryContext
{
public:
	struct FScalableFloat                         NearbyFactionMemberDistance;                       // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryContext_NearbyFactionMembers">();
	}
	static class UFortQueryContext_NearbyFactionMembers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryContext_NearbyFactionMembers>();
	}
};

// Class FortniteAIServer.FortQueryTest_InsideAthenaLeash
// 0x0000 (0x01F8 - 0x01F8)
class UFortQueryTest_InsideAthenaLeash final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryTest_InsideAthenaLeash">();
	}
	static class UFortQueryTest_InsideAthenaLeash* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_InsideAthenaLeash>();
	}
};

// Class FortniteAIServer.FortQueryContext_PlayspaceVolume
// 0x0000 (0x0028 - 0x0028)
class UFortQueryContext_PlayspaceVolume final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryContext_PlayspaceVolume">();
	}
	static class UFortQueryContext_PlayspaceVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryContext_PlayspaceVolume>();
	}
};

// Class FortniteAIServer.FortAthenaNpcEvaluator_Patrolling
// 0x0050 (0x01F8 - 0x01A8)
class UFortAthenaNpcEvaluator_Patrolling final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	class FName                                   PatrollingKeyName;                                 // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PatrollingMovementStateKeyName;                    // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PatrollingDestinationKeyName;                      // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DynamicBlueprintStatusKeyName;                     // 0x01B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DynamicBlueprintActorKeyName;                      // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PatrollingShouldMoveKeyName;                       // 0x01BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PatrollingAppendDestinationKeyName;                // 0x01C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C4[0x10];                                     // 0x01C4(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DistanceToTestPoint;                               // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanDisablePatrolling;                             // 0x01D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanReenablePatrolling;                            // 0x01D9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ReenableTimer;                                     // 0x01DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanSelectNearestPatrolPointAtStart;               // 0x01E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
