#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteConversationRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum FortniteConversationRuntime.EInteractionRange
// NumValues: 0x0003
enum class EInteractionRange : uint8
{
	Preview                                  = 0,
	Interaction                              = 1,
	EInteractionRange_MAX                    = 2,
};

// ScriptStruct FortniteConversationRuntime.FortConversationEnterEvent
// 0x0008 (0x0008 - 0x0000)
struct FFortConversationEnterEvent final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteConversationRuntime.FortConversationLeaveEvent
// 0x0008 (0x0008 - 0x0000)
struct FFortConversationLeaveEvent final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteConversationRuntime.FortConversation_Spectator_EnterConversation
// 0x0001 (0x0001 - 0x0000)
struct FFortConversation_Spectator_EnterConversation final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteConversationRuntime.FortConversation_Spectator_LeaveConversation
// 0x0001 (0x0001 - 0x0000)
struct FFortConversation_Spectator_LeaveConversation final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteConversationRuntime.FortConversation_SetDialogMarkerClassEvent
// 0x0001 (0x0001 - 0x0000)
struct FFortConversation_SetDialogMarkerClassEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteConversationRuntime.NPCConversationIndicatorMessage
// 0x0008 (0x0008 - 0x0000)
struct FNPCConversationIndicatorMessage
{
public:
	class UFortNonPlayerConversationParticipantComponent* NPCConversationComponent;                  // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteConversationRuntime.FortConversation_NPC_AddIndicator
// 0x0000 (0x0008 - 0x0008)
struct FFortConversation_NPC_AddIndicator final : public FNPCConversationIndicatorMessage
{
};

// ScriptStruct FortniteConversationRuntime.FortConversation_NPC_RemoveIndicator
// 0x0000 (0x0008 - 0x0008)
struct FFortConversation_NPC_RemoveIndicator final : public FNPCConversationIndicatorMessage
{
};

// ScriptStruct FortniteConversationRuntime.ConversationSettingDialogMarkerData
// 0x0020 (0x0020 - 0x0000)
struct FConversationSettingDialogMarkerData final
{
public:
	TSoftClassPtr<class UClass>                   DialogMarkerSoftClass;                             // 0x0000(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteConversationRuntime.FortConversationConditionalMessage
// 0x0020 (0x0020 - 0x0000)
struct FFortConversationConditionalMessage final
{
public:
	class UFortConversationContextCondition*      Condition;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteConversationRuntime.FortConversationNodeConditionalMessages
// 0x0010 (0x0010 - 0x0000)
struct FFortConversationNodeConditionalMessages final
{
public:
	TArray<struct FFortConversationConditionalMessage> Messages;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

}

