#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteAI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteVersion_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "StructUtils_structs.hpp"
#include "NetCore_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "WorldConditions_structs.hpp"


namespace SDK
{

// Enum FortniteAI.EAlertLevel
// NumValues: 0x0006
enum class EAlertLevel : uint8
{
	Unaware                                  = 0,
	Suspicious                               = 1,
	LostTarget                               = 2,
	Threatened                               = 3,
	Count                                    = 4,
	EAlertLevel_MAX                          = 5,
};

// Enum FortniteAI.EConvertedType
// NumValues: 0x0005
enum class EConvertedType : uint8
{
	NPC                                      = 0,
	Creature                                 = 1,
	All                                      = 2,
	Unknown                                  = 3,
	EConvertedType_MAX                       = 4,
};

// Enum FortniteAI.PingCommandType
// NumValues: 0x000A
enum class EPingCommandType : uint8
{
	GoTo                                     = 0,
	BackToMe                                 = 1,
	BackToDefault                            = 2,
	HoldPosition                             = 3,
	Revive                                   = 4,
	Dismiss                                  = 5,
	Item                                     = 6,
	Attack                                   = 7,
	Invalid                                  = 8,
	MAX                                      = 9,
};

// Enum FortniteAI.ENavigationObstacleOverride
// NumValues: 0x0005
enum class ENavigationObstacleOverride : uint8
{
	UseMeshSettings                          = 0,
	ForceEnabled                             = 1,
	ForceDisabled                            = 2,
	ExportAsPrimitive                        = 3,
	ENavigationObstacleOverride_MAX          = 4,
};

// Enum FortniteAI.EUnconvertReason
// NumValues: 0x000A
enum class EUnconvertReason : uint8
{
	StealByOtherPlayer                       = 0,
	ConverterDeath                           = 1,
	ConvertedDeath                           = 2,
	TooManyConverted                         = 3,
	TooFarFromConverter                      = 4,
	GameplayTagBlockConvert                  = 5,
	EndPlay                                  = 6,
	Dismiss                                  = 7,
	Unknown                                  = 8,
	EUnconvertReason_MAX                     = 9,
};

// Enum FortniteAI.EAIVisibilityOptions
// NumValues: 0x0009
enum class EAIVisibilityOptions : uint8
{
	None                                     = 0,
	AlwaysHidden                             = 1,
	AlwaysVisible                            = 2,
	HiddenWhenIdle                           = 4,
	HiddenWhenCrouched                       = 8,
	HiddenWhenIdleAndCrouched                = 12,
	VisibleWhenOverlappingPerceivedActor     = 16,
	CheckPriorVisibility                     = 32,
	EAIVisibilityOptions_MAX                 = 33,
};

// Enum FortniteAI.ELootElementType
// NumValues: 0x0005
enum class ELootElementType : uint8
{
	Pickup                                   = 0,
	Chest                                    = 1,
	SupplyDrop                               = 2,
	Invalid                                  = 255,
	ELootElementType_MAX                     = 256,
};

// Enum FortniteAI.EBotNamingMode
// NumValues: 0x0007
enum class EBotNamingMode : uint8
{
	RealName                                 = 0,
	SkinName                                 = 1,
	Anonymous                                = 2,
	Custom                                   = 3,
	CharacterDataDisplayName                 = 4,
	CustomIncremental                        = 5,
	EBotNamingMode_MAX                       = 6,
};

// Enum FortniteAI.EFortEncounterUtilityDesire
// NumValues: 0x0006
enum class EFortEncounterUtilityDesire : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	VeryHigh                                 = 3,
	Max_None                                 = 4,
	EFortEncounterUtilityDesire_MAX          = 5,
};

// Enum FortniteAI.EAIHotSpotSlotFilter
// NumValues: 0x0004
enum class EAIHotSpotSlotFilter : uint8
{
	All                                      = 0,
	AvailableOnly                            = 1,
	UnavailableOnly                          = 2,
	EAIHotSpotSlotFilter_MAX                 = 3,
};

// Enum FortniteAI.EAIHotSpotAssignmentFilter
// NumValues: 0x0004
enum class EAIHotSpotAssignmentFilter : uint8
{
	All                                      = 0,
	WithSlots                                = 1,
	WaitingList                              = 2,
	EAIHotSpotAssignmentFilter_MAX           = 3,
};

// Enum FortniteAI.EAIHotSpotSlot
// NumValues: 0x0006
enum class EAIHotSpotSlot : uint8
{
	Free                                     = 0,
	Claimed                                  = 1,
	Occupied                                 = 2,
	Blocked                                  = 3,
	Disabled                                 = 4,
	EAIHotSpotSlot_MAX                       = 5,
};

// Enum FortniteAI.EAthenaPathFollowingFocus
// NumValues: 0x0003
enum class EAthenaPathFollowingFocus : uint8
{
	TowardsNextPathPoint                     = 0,
	AlignWithSmoothedVelocity                = 1,
	EAthenaPathFollowingFocus_MAX            = 2,
};

// Enum FortniteAI.EAthenaAITelemetryEventType
// NumValues: 0x0003
enum class EAthenaAITelemetryEventType : uint8
{
	Spawn                                    = 0,
	Despawn                                  = 1,
	EAthenaAITelemetryEventType_MAX          = 2,
};

// Enum FortniteAI.EAICustomTargetRequestType
// NumValues: 0x0004
enum class EAICustomTargetRequestType : uint8
{
	Movement                                 = 1,
	MeleeAttack                              = 2,
	RangedAttack                             = 4,
	EAICustomTargetRequestType_MAX           = 5,
};

// Enum FortniteAI.EDespawnAIType
// NumValues: 0x0003
enum class EDespawnAIType : uint8
{
	Relevancy                                = 0,
	Distance                                 = 1,
	EDespawnAIType_MAX                       = 2,
};

// Enum FortniteAI.EFortAIDirectorEventContribution
// NumValues: 0x0003
enum class EFortAIDirectorEventContribution : uint8
{
	Increment                                = 0,
	Set                                      = 1,
	EFortAIDirectorEventContribution_MAX     = 2,
};

// Enum FortniteAI.EFortAIDirectorFactorContribution
// NumValues: 0x0003
enum class EFortAIDirectorFactorContribution : uint8
{
	Direct                                   = 0,
	Inverse                                  = 1,
	EFortAIDirectorFactorContribution_MAX    = 2,
};

// Enum FortniteAI.EFortEncounterPacingState
// NumValues: 0x0006
enum class EFortEncounterPacingState : uint8
{
	Ramp                                     = 0,
	Peak                                     = 1,
	Fade                                     = 2,
	Rest                                     = 3,
	Max_None                                 = 4,
	EFortEncounterPacingState_MAX            = 5,
};

// Enum FortniteAI.EFortEncounterState
// NumValues: 0x0008
enum class EFortEncounterState : uint8
{
	Uninitialized                            = 0,
	InitializingProperties                   = 1,
	InitializingRiftManager                  = 2,
	AwaitingActivation                       = 3,
	Active                                   = 4,
	ReplacingRifts                           = 5,
	Max_None                                 = 6,
	EFortEncounterState_MAX                  = 7,
};

// Enum FortniteAI.EFortAIWaveProgressSection
// NumValues: 0x0004
enum class EFortAIWaveProgressSection : uint8
{
	SectionOne                               = 0,
	SectionTwo                               = 1,
	Max_None                                 = 2,
	EFortAIWaveProgressSection_MAX           = 3,
};

// Enum FortniteAI.EFortEncounterSequenceResult
// NumValues: 0x0004
enum class EFortEncounterSequenceResult : uint8
{
	Success                                  = 0,
	FailedEncounterInProgress                = 1,
	Failed                                   = 2,
	EFortEncounterSequenceResult_MAX         = 3,
};

// Enum FortniteAI.EAssignmentCreationResult
// NumValues: 0x0004
enum class EAssignmentCreationResult : uint8
{
	AssignmentNotFoundOrCreated              = 0,
	AssignmentCreated                        = 1,
	AssignmentFound                          = 2,
	EAssignmentCreationResult_MAX            = 3,
};

// Enum FortniteAI.ECorePerceptionTypes
// NumValues: 0x0007
enum class ECorePerceptionTypes : uint8
{
	Sight                                    = 0,
	Hearing                                  = 1,
	Damage                                   = 2,
	Touch                                    = 3,
	Team                                     = 4,
	Prediction                               = 5,
	MAX                                      = 6,
};

// Enum FortniteAI.EFortAILODLevel
// NumValues: 0x000A
enum class EFortAILODLevel : uint8
{
	Invalid                                  = 0,
	MIN                                      = 0,
	Dormant                                  = 1,
	BelowLower                               = 2,
	Lower                                    = 3,
	AboveLower                               = 4,
	BelowNormal                              = 5,
	Normal                                   = 6,
	AboveNormal                              = 7,
	MAX                                      = 8,
};

// Enum FortniteAI.EAssignmentType
// NumValues: 0x0006
enum class EAssignmentType : uint8
{
	Invalid                                  = 0,
	Encounter                                = 1,
	World                                    = 2,
	Enemy                                    = 3,
	NumAssignmentTypes                       = 4,
	EAssignmentType_MAX                      = 5,
};

// Enum FortniteAI.EBuildingWallArea
// NumValues: 0x0004
enum class EBuildingWallArea : uint8
{
	Regular                                  = 0,
	Flat                                     = 1,
	Special                                  = 2,
	EBuildingWallArea_MAX                    = 3,
};

// Enum FortniteAI.EBuildingStairsRailing
// NumValues: 0x0004
enum class EBuildingStairsRailing : uint8
{
	None                                     = 0,
	Partial                                  = 1,
	Full                                     = 2,
	EBuildingStairsRailing_MAX               = 3,
};

// Enum FortniteAI.EBuildingFloorRailing
// NumValues: 0x0003
enum class EBuildingFloorRailing : uint8
{
	None                                     = 0,
	Balcony                                  = 1,
	EBuildingFloorRailing_MAX                = 2,
};

// Enum FortniteAI.EFortHotSpotSlot
// NumValues: 0x0005
enum class EFortHotSpotSlot : uint8
{
	Melee                                    = 0,
	MeleeHuge                                = 1,
	Ranged                                   = 2,
	None                                     = 3,
	EFortHotSpotSlot_MAX                     = 4,
};

// Enum FortniteAI.EFortHotSpotDirection
// NumValues: 0x0008
enum class EFortHotSpotDirection : uint8
{
	PositiveX                                = 0,
	NegativeX                                = 1,
	PositiveY                                = 2,
	NegativeY                                = 3,
	PositiveZ                                = 4,
	NegativeZ                                = 5,
	Any                                      = 6,
	EFortHotSpotDirection_MAX                = 7,
};

// Enum FortniteAI.EFortHotSpotPreview
// NumValues: 0x0004
enum class EFortHotSpotPreview : uint8
{
	None                                     = 0,
	Smashing                                 = 1,
	Shooting                                 = 2,
	EFortHotSpotPreview_MAX                  = 3,
};

// Enum FortniteAI.EHotspotTypeConfigMode
// NumValues: 0x0004
enum class EHotspotTypeConfigMode : uint8
{
	AlwaysAdd                                = 0,
	WhenNotDefined                           = 1,
	WhenNotValid                             = 2,
	EHotspotTypeConfigMode_MAX               = 3,
};

// Enum FortniteAI.EFortPartialPathUsage
// NumValues: 0x0004
enum class EFortPartialPathUsage : uint8
{
	Always                                   = 0,
	OnlyGoalsOnDestructible                  = 1,
	Never                                    = 2,
	EFortPartialPathUsage_MAX                = 3,
};

// Enum FortniteAI.ETargetDistanceComparisonType
// NumValues: 0x0004
enum class ETargetDistanceComparisonType : uint8
{
	TwoDimensions                            = 0,
	ThreeDimensions                          = 1,
	CollisionHalfHeightMultiplier            = 2,
	ETargetDistanceComparisonType_MAX        = 3,
};

// Enum FortniteAI.EAIScalableFloatScalingType
// NumValues: 0x0003
enum class EAIScalableFloatScalingType : uint32
{
	Disabled                                 = 0,
	ReceivedDamageByTarget                   = 1,
	EAIScalableFloatScalingType_MAX          = 2,
};

// Enum FortniteAI.ETeleportReason
// NumValues: 0x0006
enum class ETeleportReason : uint8
{
	AgentNotOnNavmesh                        = 0,
	AgentDestinationNotOnNavMesh             = 1,
	AgentStuckInRepetitivePartialPaths       = 2,
	AgentBlocked                             = 3,
	Unknown                                  = 4,
	ETeleportReason_MAX                      = 5,
};

// Enum FortniteAI.EObstacleType
// NumValues: 0x0006
enum class EObstacleType : uint8
{
	IncomingSmashable                        = 0,
	BlockingSmashable                        = 1,
	BlockingDetectedTrap                     = 2,
	Unknown                                  = 3,
	Count                                    = 3,
	EObstacleType_MAX                        = 4,
};

// Enum FortniteAI.EHarvestResult
// NumValues: 0x0005
enum class EHarvestResult : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Success                                  = 2,
	Fail                                     = 3,
	EHarvestResult_MAX                       = 4,
};

// Enum FortniteAI.EReachLocationValidationMode
// NumValues: 0x0005
enum class EReachLocationValidationMode : uint8
{
	None                                     = 0,
	Storm                                    = 1,
	Leash                                    = 2,
	SoftLeash                                = 3,
	EReachLocationValidationMode_MAX         = 4,
};

// Enum FortniteAI.EBlackboardUpdateType
// NumValues: 0x0004
enum class EBlackboardUpdateType : uint8
{
	NoUpdate                                 = 0,
	UpdateNow                                = 1,
	UpdateNextTick                           = 2,
	EBlackboardUpdateType_MAX                = 3,
};

// Enum FortniteAI.EBotControllerClamberStatus
// NumValues: 0x0005
enum class EBotControllerClamberStatus : uint8
{
	Invalid                                  = 0,
	MoveStarted                              = 1,
	MoveDone                                 = 2,
	MoveFailed                               = 3,
	EBotControllerClamberStatus_MAX          = 4,
};

// Enum FortniteAI.EDefensivePlayerStyleSource
// NumValues: 0x0003
enum class EDefensivePlayerStyleSource : uint8
{
	Unknown                                  = 0,
	Escape                                   = 1,
	MAX                                      = 2,
};

// Enum FortniteAI.ETwoPointSolverRotationA
// NumValues: 0x0006
enum class ETwoPointSolverRotationA : uint8
{
	PointAToQuerier                          = 0,
	QuerierToPointA                          = 1,
	PointAToQuerierWithRandomOffset          = 2,
	QuerierToPointAWithRandomOffset          = 3,
	Custom                                   = 4,
	ETwoPointSolverRotationA_MAX             = 5,
};

// Enum FortniteAI.EFortIntensityCurveSequenceType
// NumValues: 0x0005
enum class EFortIntensityCurveSequenceType : uint8
{
	Sequence                                 = 0,
	Loop                                     = 1,
	Random                                   = 2,
	Max_None                                 = 3,
	EFortIntensityCurveSequenceType_MAX      = 4,
};

// Enum FortniteAI.EFortNavLinkPattern
// NumValues: 0x0005
enum class EFortNavLinkPattern : uint8
{
	Floor                                    = 0,
	Stairs                                   = 1,
	Roof                                     = 2,
	Manual                                   = 3,
	EFortNavLinkPattern_MAX                  = 4,
};

// Enum FortniteAI.EFortNamedNavmesh
// NumValues: 0x0003
enum class EFortNamedNavmesh : uint8
{
	Husk                                     = 0,
	Smasher                                  = 1,
	MAX                                      = 2,
};

// Enum FortniteAI.EPathObstacleAction
// NumValues: 0x0005
enum class EPathObstacleAction : uint8
{
	Melee                                    = 0,
	Ignore                                   = 1,
	AbortMoveAsFailed                        = 2,
	FinishMoveAsSucceeded                    = 3,
	EPathObstacleAction_MAX                  = 4,
};

// Enum FortniteAI.EPathUndermineEvent
// NumValues: 0x0004
enum class EPathUndermineEvent : uint8
{
	Predicted                                = 0,
	Started                                  = 1,
	Finished                                 = 2,
	EPathUndermineEvent_MAX                  = 3,
};

// Enum FortniteAI.EWardAffectType
// NumValues: 0x0004
enum class EWardAffectType : uint8
{
	AffectsBothStartAndEndPoints             = 0,
	AffectsOnlyStartPoints                   = 1,
	AffectsOnlyEndPoints                     = 2,
	EWardAffectType_MAX                      = 3,
};

// Enum FortniteAI.ETagGoalScoringCategory
// NumValues: 0x0004
enum class ETagGoalScoringCategory : uint8
{
	Ignore                                   = 0,
	HighInterest                             = 1,
	NumCategories                            = 2,
	ETagGoalScoringCategory_MAX              = 3,
};

// Enum FortniteAI.EBoundingBoxSlotDirectionCalculation
// NumValues: 0x0005
enum class EBoundingBoxSlotDirectionCalculation : uint8
{
	Auto                                     = 0,
	FaceWall                                 = 1,
	FaceAwayFromWall                         = 2,
	FaceCenter                               = 3,
	EBoundingBoxSlotDirectionCalculation_MAX = 4,
};

// Enum FortniteAI.EFortAreaFlag
// NumValues: 0x0006
enum class EFortAreaFlag : uint8
{
	Default                                  = 0,
	Obstacle                                 = 1,
	Smashable                                = 2,
	Unwalkable                               = 3,
	Interactable                             = 4,
	EFortAreaFlag_MAX                        = 5,
};

// Enum FortniteAI.EInBoundsState
// NumValues: 0x0004
enum class EInBoundsState : uint8
{
	NoBounds                                 = 0,
	NotInBounds                              = 1,
	InBounds                                 = 2,
	EInBoundsState_MAX                       = 3,
};

// Enum FortniteAI.ENavPathRendererStatus
// NumValues: 0x0005
enum class ENavPathRendererStatus : uint8
{
	INVALID                                  = 0,
	CALCULATING                              = 1,
	SUCCESS                                  = 2,
	FAILED                                   = 3,
	ENavPathRendererStatus_MAX               = 4,
};

// Enum FortniteAI.EFortThreatDeactivationType
// NumValues: 0x0003
enum class EFortThreatDeactivationType : uint8
{
	Off                                      = 0,
	Dormant                                  = 1,
	EFortThreatDeactivationType_MAX          = 2,
};

// Enum FortniteAI.EFortCreativePatrolPathGroup
// NumValues: 0x0066
enum class EFortCreativePatrolPathGroup : uint8
{
	Group_None                               = 0,
	Group_1                                  = 1,
	Group_2                                  = 2,
	Group_3                                  = 3,
	Group_4                                  = 4,
	Group_5                                  = 5,
	Group_6                                  = 6,
	Group_7                                  = 7,
	Group_8                                  = 8,
	Group_9                                  = 9,
	Group_10                                 = 10,
	Group_11                                 = 11,
	Group_12                                 = 12,
	Group_13                                 = 13,
	Group_14                                 = 14,
	Group_15                                 = 15,
	Group_16                                 = 16,
	Group_17                                 = 17,
	Group_18                                 = 18,
	Group_19                                 = 19,
	Group_20                                 = 20,
	Group_21                                 = 21,
	Group_22                                 = 22,
	Group_23                                 = 23,
	Group_24                                 = 24,
	Group_25                                 = 25,
	Group_26                                 = 26,
	Group_27                                 = 27,
	Group_28                                 = 28,
	Group_29                                 = 29,
	Group_30                                 = 30,
	Group_31                                 = 31,
	Group_32                                 = 32,
	Group_33                                 = 33,
	Group_34                                 = 34,
	Group_35                                 = 35,
	Group_36                                 = 36,
	Group_37                                 = 37,
	Group_38                                 = 38,
	Group_39                                 = 39,
	Group_40                                 = 40,
	Group_41                                 = 41,
	Group_42                                 = 42,
	Group_43                                 = 43,
	Group_44                                 = 44,
	Group_45                                 = 45,
	Group_46                                 = 46,
	Group_47                                 = 47,
	Group_48                                 = 48,
	Group_49                                 = 49,
	Group_50                                 = 50,
	Group_51                                 = 51,
	Group_52                                 = 52,
	Group_53                                 = 53,
	Group_54                                 = 54,
	Group_55                                 = 55,
	Group_56                                 = 56,
	Group_57                                 = 57,
	Group_58                                 = 58,
	Group_59                                 = 59,
	Group_60                                 = 60,
	Group_61                                 = 61,
	Group_62                                 = 62,
	Group_63                                 = 63,
	Group_64                                 = 64,
	Group_65                                 = 65,
	Group_66                                 = 66,
	Group_67                                 = 67,
	Group_68                                 = 68,
	Group_69                                 = 69,
	Group_70                                 = 70,
	Group_71                                 = 71,
	Group_72                                 = 72,
	Group_73                                 = 73,
	Group_74                                 = 74,
	Group_75                                 = 75,
	Group_76                                 = 76,
	Group_77                                 = 77,
	Group_78                                 = 78,
	Group_79                                 = 79,
	Group_80                                 = 80,
	Group_81                                 = 81,
	Group_82                                 = 82,
	Group_83                                 = 83,
	Group_84                                 = 84,
	Group_85                                 = 85,
	Group_86                                 = 86,
	Group_87                                 = 87,
	Group_88                                 = 88,
	Group_89                                 = 89,
	Group_90                                 = 90,
	Group_91                                 = 91,
	Group_92                                 = 92,
	Group_93                                 = 93,
	Group_94                                 = 94,
	Group_95                                 = 95,
	Group_96                                 = 96,
	Group_97                                 = 97,
	Group_98                                 = 98,
	Group_99                                 = 99,
	Group_100                                = 100,
	Group_MAX                                = 101,
};

// Enum FortniteAI.EAIBotBuildingTemplate
// NumValues: 0x0006
enum class EAIBotBuildingTemplate : uint8
{
	SingleWall                               = 0,
	SingleRamp                               = 1,
	SingleRoof                               = 2,
	SingleBrace                              = 3,
	SingleWallWindow                         = 4,
	MAX                                      = 5,
};

// Enum FortniteAI.BotDataOverrideCosmeticMode
// NumValues: 0x0003
enum class EBotDataOverrideCosmeticMode : uint8
{
	SpecificLoadout                          = 0,
	CosmeticLibrary                          = 1,
	BotDataOverrideCosmeticMode_MAX          = 2,
};

// Enum FortniteAI.EAILootExcludeListReason
// NumValues: 0x000D
enum class EAILootExcludeListReason : uint8
{
	Invalid                                  = 0,
	ExecutionError                           = 1,
	CannotReachLootLocation                  = 2,
	OutsideSafeZoneRadius                    = 3,
	NoInventorySpace                         = 4,
	LootStateUnavailable                     = 5,
	PathNotFound                             = 6,
	GoalOffNavmesh                           = 7,
	AgentBlocked                             = 8,
	IsolatedIsland                           = 9,
	UnsupportedItem                          = 10,
	Count                                    = 11,
	EAILootExcludeListReason_MAX             = 12,
};

// Enum FortniteAI.EBotMovementState
// NumValues: 0x000D
enum class EBotMovementState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Failed_NoPathFound                       = 2,
	Failed_Aborted                           = 3,
	Failed_AgentOffNavmesh                   = 4,
	Failed_GoalOffNavmesh                    = 5,
	Failed_Blocked                           = 6,
	Failed_OffPath                           = 7,
	Failed_Falling                           = 8,
	Success                                  = 9,
	Success_Partial                          = 10,
	Success_AlreadyAtGoal                    = 11,
	EBotMovementState_MAX                    = 12,
};

// Enum FortniteAI.EBotUnstuckSteeringReason
// NumValues: 0x0004
enum class EBotUnstuckSteeringReason : uint8
{
	Unknown                                  = 0,
	OffNavMesh                               = 1,
	IsolatedIsland                           = 2,
	EBotUnstuckSteeringReason_MAX            = 3,
};

// Enum FortniteAI.EExecutionStatus
// NumValues: 0x0006
enum class EExecutionStatus : uint8
{
	ExecutionError                           = 0,
	ExecutionDenied                          = 1,
	ExecutionSuccess                         = 2,
	ExecutionPending                         = 3,
	ExecutionAllowed                         = 4,
	EExecutionStatus_MAX                     = 5,
};

// Enum FortniteAI.EFortAthenaAIObjectTrackerQueryOrder
// NumValues: 0x0003
enum class EFortAthenaAIObjectTrackerQueryOrder : uint8
{
	None                                     = 0,
	Distance                                 = 1,
	EFortAthenaAIObjectTrackerQueryOrder_MAX = 2,
};

// Enum FortniteAI.EFortAthenaSmartObjectPriority
// NumValues: 0x000B
enum class EFortAthenaSmartObjectPriority : uint8
{
	Lowest                                   = 0,
	Lower                                    = 1,
	Low                                      = 2,
	BelowNormal                              = 3,
	Normal                                   = 4,
	AboveNormal                              = 5,
	High                                     = 6,
	Higher                                   = 7,
	Highest                                  = 8,
	MIN                                      = 0,
	MAX                                      = 8,
};

// Enum FortniteAI.EFortAthenaSmartObjectUrgency
// NumValues: 0x0004
enum class EFortAthenaSmartObjectUrgency : uint8
{
	Low                                      = 0,
	Normal                                   = 1,
	High                                     = 2,
	EFortAthenaSmartObjectUrgency_MAX        = 3,
};

// Enum FortniteAI.EFortAthenaAISpawnerDataComponentTriBool
// NumValues: 0x0004
enum class EFortAthenaAISpawnerDataComponentTriBool : uint8
{
	Yes                                      = 0,
	No                                       = 1,
	DoNotModify                              = 2,
	EFortAthenaAISpawnerDataComponentTriBool_MAX = 3,
};

// Enum FortniteAI.EBehaviorTreeBranches
// NumValues: 0x0015
enum class EBehaviorTreeBranches : uint8
{
	CanUseDiving                             = 0,
	CanUseGliding                            = 1,
	CanReactToProjectile                     = 2,
	CanReactToTraps                          = 3,
	CanAvoidDangerArea                       = 4,
	CanBeConverted                           = 5,
	CanPropagateAwareness                    = 6,
	CanUseThreatenedBehaviors                = 7,
	CanUseLastKnownPositionBehavior          = 8,
	CanUseAlertedBehavior                    = 9,
	CanUseSmartObjects                       = 10,
	CanReviveDBNOTeammates                   = 11,
	CanPlayEmote                             = 12,
	CanConverse                              = 13,
	CanPatrolOnPath                          = 14,
	CanPatrolAround                          = 15,
	CanTeleportWhenStuck                     = 16,
	CanEmoteWhenStuck                        = 17,
	CanUseZiplines                           = 18,
	Count                                    = 19,
	EBehaviorTreeBranches_MAX                = 20,
};

// Enum FortniteAI.EBehaviorTreeBranchesBitmask
// NumValues: 0x0015
enum class EBehaviorTreeBranchesBitmask : uint8
{
	CanUseDiving                             = 0,
	CanUseGliding                            = 1,
	CanReactToProjectile                     = 2,
	CanReactToTraps                          = 3,
	CanAvoidDangerArea                       = 4,
	CanBeConverted                           = 5,
	CanPropagateAwareness                    = 6,
	CanUseThreatenedBehaviors                = 7,
	CanUseLastKnownPositionBehavior          = 8,
	CanUseAlertedBehavior                    = 9,
	CanUseSmartObjects                       = 10,
	CanReviveDBNOTeammates                   = 11,
	CanPlayEmote                             = 12,
	CanConverse                              = 13,
	CanPatrolOnPath                          = 14,
	CanPatrolAround                          = 15,
	CanTeleportWhenStuck                     = 16,
	CanEmoteWhenStuck                        = 17,
	CanUseZiplines                           = 18,
	Count                                    = 19,
	EBehaviorTreeBranchesBitmask_MAX         = 20,
};

// Enum FortniteAI.EPatrollingMode
// NumValues: 0x0004
enum class EPatrollingMode : uint8
{
	BackAndForth                             = 0,
	Loop                                     = 1,
	StopAtEnd                                = 2,
	EPatrollingMode_MAX                      = 3,
};

// Enum FortniteAI.EDBNOPlayStyle
// NumValues: 0x0006
enum class EDBNOPlayStyle : uint8
{
	Thirsty                                  = 0,
	Default                                  = 1,
	Passive                                  = 2,
	ThristyButPassiveOnPlayers               = 3,
	DefaultButPassiveOnPlayers               = 4,
	EDBNOPlayStyle_MAX                       = 5,
};

// Enum FortniteAI.EStimType
// NumValues: 0x000B
enum class EStimType : uint8
{
	Seeing                                   = 0,
	Seen                                     = 1,
	MightHaveSeen                            = 2,
	Hurt                                     = 3,
	Heard                                    = 4,
	Obstacle                                 = 5,
	Enemy                                    = 6,
	Touched                                  = 7,
	Unknown                                  = 8,
	Count                                    = 8,
	EStimType_MAX                            = 9,
};

// Enum FortniteAI.EPerceptionState
// NumValues: 0x000A
enum class EPerceptionState : uint8
{
	Threat_Seeing                            = 0,
	Threat_LKP                               = 1,
	Threat_Alerted                           = 2,
	ObstacleIncoming                         = 3,
	ObstacleBlockedBy                        = 4,
	ObstacleDetectedTrap                     = 5,
	Unknown                                  = 6,
	Count                                    = 6,
	Threat_Count                             = 3,
	EPerceptionState_MAX                     = 7,
};

// Enum FortniteAI.ETrackingOffsetModifierCurve
// NumValues: 0x0004
enum class ETrackingOffsetModifierCurve : uint8
{
	Default                                  = 0,
	CombatStart                              = 1,
	TargetLowHealth                          = 2,
	MAX                                      = 3,
};

// Enum FortniteAI.EPerceptionSoundType
// NumValues: 0x0008
enum class EPerceptionSoundType : uint8
{
	Default                                  = 0,
	Explosion                                = 1,
	ProjectileFlyBy                          = 2,
	ProjectileImpact                         = 3,
	WeaponFiring                             = 4,
	Building                                 = 5,
	MeleeImpact                              = 6,
	MAX                                      = 7,
};

// Enum FortniteAI.ELookAtType
// NumValues: 0x0005
enum class ELookAtType : uint8
{
	ScanAround                               = 0,
	Investigate                              = 1,
	HeardSound                               = 2,
	Ambush                                   = 3,
	MAX                                      = 4,
};

// Enum FortniteAI.ELeashReturnLocationMode
// NumValues: 0x0005
enum class ELeashReturnLocationMode : uint8
{
	Closest                                  = 0,
	Random                                   = 1,
	ReturnToCenter                           = 2,
	ReturnToCenterAvoidObstacle              = 3,
	ELeashReturnLocationMode_MAX             = 4,
};

// Enum FortniteAI.EOrientedConstructionBuildingType
// NumValues: 0x0010
enum class EOrientedConstructionBuildingType : uint8
{
	WallX                                    = 0,
	WallY                                    = 1,
	Floor                                    = 2,
	StairsUpX                                = 3,
	StairsUpY                                = 4,
	StairsDownX                              = 5,
	StairsDownY                              = 6,
	Roof                                     = 7,
	BraceLeftX                               = 8,
	BraceRightX                              = 9,
	BraceLeftY                               = 10,
	BraceRightY                              = 11,
	WallWindowX                              = 12,
	WallWindowY                              = 13,
	Count                                    = 14,
	EOrientedConstructionBuildingType_MAX    = 15,
};

// Enum FortniteAI.EConstructionBuildingType
// NumValues: 0x0008
enum class EConstructionBuildingType : uint8
{
	Wall                                     = 0,
	Floor                                    = 1,
	Stairs                                   = 2,
	Roof                                     = 3,
	Brace                                    = 4,
	WallWindow                               = 5,
	Count                                    = 6,
	EConstructionBuildingType_MAX            = 7,
};

// Enum FortniteAI.EAthenaAIServicePOIList
// NumValues: 0x0004
enum class EAthenaAIServicePOIList : uint8
{
	MainBusDrop                              = 0,
	SecondaryBusDrop                         = 1,
	OnGround                                 = 2,
	EAthenaAIServicePOIList_MAX              = 3,
};

// Enum FortniteAI.EAthenaAITrackedZoneType
// NumValues: 0x0003
enum class EAthenaAITrackedZoneType : uint8
{
	Occluder                                 = 0,
	Danger                                   = 1,
	EAthenaAITrackedZoneType_MAX             = 2,
};

// Enum FortniteAI.EBotPOIType
// NumValues: 0x0004
enum class EBotPOIType : uint8
{
	Unknown                                  = 0,
	ClusterLoot                              = 1,
	MidMatchObjective                        = 2,
	EBotPOIType_MAX                          = 3,
};

// Enum FortniteAI.EBotPOIUsageBitmask
// NumValues: 0x0004
enum class EBotPOIUsageBitmask : uint8
{
	None                                     = 0,
	BotJumpOffBus                            = 1,
	BotNavigation                            = 2,
	EBotPOIUsageBitmask_MAX                  = 3,
};

// Enum FortniteAI.ERatingsEnforcementType
// NumValues: 0x0005
enum class ERatingsEnforcementType : uint8
{
	Default                                  = 0,
	IgnoreMaximums                           = 1,
	IgnoreParty                              = 2,
	IgnorePartyMaximum                       = 3,
	ERatingsEnforcementType_MAX              = 4,
};

// Enum FortniteAI.EClampType
// NumValues: 0x0003
enum class EClampType : uint8
{
	Minimum                                  = 0,
	Maximum                                  = 1,
	EClampType_MAX                           = 2,
};

// ScriptStruct FortniteAI.UpdatedNavMeshTiles
// 0x0018 (0x0018 - 0x0000)
struct FUpdatedNavMeshTiles final
{
public:
	class AAthenaNavMesh*                         NavMesh;                                           // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAI.DebugMinimapData
// 0x01B0 (0x01B0 - 0x0000)
struct FDebugMinimapData final
{
public:
	bool                                          bIsOverridden;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            DebugMinimapIconBrush;                             // 0x0010(0x00C0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector2D                              DebugMinimapIconScale;                             // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DebugCompassIconBrush;                             // 0x00E0(0x00C0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector2D                              DebugCompassIconScale;                             // 0x01A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.FortInjectedBehaviorEntry
// 0x0088 (0x0088 - 0x0000)
struct FFortInjectedBehaviorEntry final
{
public:
	struct FGameplayTagContainer                  InjectionTags;                                     // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      InjectionRequirements;                             // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InjectedBehavior;                                  // 0x0068(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.FortAISpawnerTagQueryInjectedBehavior
// 0x0058 (0x0058 - 0x0000)
struct FFortAISpawnerTagQueryInjectedBehavior final
{
public:
	struct FGameplayTagQuery                      SpawnerTagsQuery;                                  // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FFortInjectedBehaviorEntry>     InjectedBehaviors;                                 // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.FortAIRuntimePerkInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FFortAIRuntimePerkInfo
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAI.FortAISpawnGroupUpgradeUIData
// 0x0068 (0x0068 - 0x0000)
struct FFortAISpawnGroupUpgradeUIData final
{
public:
	bool                                          bAlwaysDisplayHealthBar;                           // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideHealthBarColor;                           // 0x0001(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UTexture2D>              UpgradeIconImage;                                  // 0x0008(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            UpgradeIconTintColor;                              // 0x0028(0x0014)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FLinearColor                           HealthBarColorOverride;                            // 0x003C(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   UpgradeName;                                       // 0x0050(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.DigestedTargetBasedAccuracy
// 0x001C (0x001C - 0x0000)
struct FDigestedTargetBasedAccuracy final
{
public:
	float                                         AimTrackingOffsetErrorMultiplier;                  // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimTrackingHeightOffsetErrorMultiplier;            // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimTrackingDistanceErrorMultiplier;                // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimTrackingReactionTimeMultiplier;                 // 0x000C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimTrackingInterpTimeMultiplier;                   // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimTrackingInAirVelocityThresholdMultiplier;       // 0x0014(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimTrackinginAirHeightDataThresholdMultiplier;     // 0x0018(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct FortniteAI.AIVisibilityRangeSettings
// 0x000C (0x000C - 0x0000)
struct FAIVisibilityRangeSettings final
{
public:
	uint8                                         bUsesRangeSettings : 1;                            // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         VisibilitySettings;                                // 0x0001(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Range;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleTime;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.FortAIVisibilityDataTableRow
// 0x0058 (0x0060 - 0x0008)
struct FFortAIVisibilityDataTableRow final : public FTableRowBase
{
public:
	struct FGameplayTagQuery                      VisibilityTagQuery;                                // 0x0008(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FAIVisibilityRangeSettings>     RangeSettings;                                     // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.FortAthenaAIBotBuildingQueue
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FFortAthenaAIBotBuildingQueue final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAI.FortAthenaAILODSetting
// 0x0001 (0x0001 - 0x0000)
struct FFortAthenaAILODSetting
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.FortAILODSetting_AIEvaluator
// 0x0067 (0x0068 - 0x0001)
struct FFortAILODSetting_AIEvaluator final : public FFortAthenaAILODSetting
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         IntervalMultiplier;                                // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         RandomDeviationMultiplier;                         // 0x0038(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAI.WeightedAIPerk
// 0x0030 (0x0030 - 0x0000)
struct FWeightedAIPerk final
{
public:
	TSubclassOf<class UFortAIPerkBase>            PerkClass;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RandomWeight;                                      // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.FortAILODSetting_CharacterMovement
// 0x0187 (0x0188 - 0x0001)
struct FFortAILODSetting_CharacterMovement final : public FFortAthenaAILODSetting
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         Interval;                                          // 0x0008(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RandomDeviation;                                   // 0x0030(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumDynamicInterval;                            // 0x0058(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaximumDotDifferenceBetweenInputVectors;           // 0x0080(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bDisableAvoidance;                                 // 0x00A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bBotsEnableNavWalkingMode;                         // 0x00D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bBotsEnablePhysNavWalkingPathFollowingMode;        // 0x00F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bSweepWhileNavWalking;                             // 0x0120(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bGenerateOverlapInNavWalking;                      // 0x0148(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x18];                                     // 0x0170(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAI.FortAILODSetting_FortWeaponRanged
// 0x0067 (0x0068 - 0x0001)
struct FFortAILODSetting_FortWeaponRanged final : public FFortAthenaAILODSetting
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         Interval;                                          // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         RandomDeviation;                                   // 0x0038(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAI.FortAILODSetting_GenericTickingObject
// 0x0037 (0x0038 - 0x0001)
struct FFortAILODSetting_GenericTickingObject final : public FFortAthenaAILODSetting
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         TickMultiplier;                                    // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct FortniteAI.FortItemInjectedBehaviorsDataTableRow
// 0x0030 (0x0038 - 0x0008)
struct FFortItemInjectedBehaviorsDataTableRow final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     ItemDefinition;                                    // 0x0008(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortInjectedBehaviorEntry>     InjectedBehaviors;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteAI.DigestedAimingCircleSettings
// 0x0168 (0x0168 - 0x0000)
struct FDigestedAimingCircleSettings final
{
public:
	bool                                          bUseAimingCircle;                                  // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CircleCenterOffsetZ;                               // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinCircleOpeningAngleVerticalCurve;                // 0x0008(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCircleOpeningAngleVerticalCurve;                // 0x0030(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinCircleOpeningAngleHorizontalCurve;              // 0x0058(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCircleOpeningAngleHorizontalCurve;              // 0x0080(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                         MinCursorRotationSpeed;                            // 0x00A8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxCursorRotationSpeed;                            // 0x00AC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinCursorUpdateInterval;                           // 0x00B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxCursorUpdateInterval;                           // 0x00B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinCursorTrackingFrequency;                        // 0x00B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxCursorTrackingFrequency;                        // 0x00BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CircleShrinkCurve;                                 // 0x00C0(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                         MinDistanceForTimeBetweenHits;                     // 0x00E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDistanceForTimeBetweenHits;                     // 0x00EC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinTimeBetweenHitsAtMinRange;                      // 0x00F0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxTimeBetweenHitsAtMinRange;                      // 0x00F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinTimeBetweenHitsAtMaxRange;                      // 0x00F8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxTimeBetweenHitsAtMaxRange;                      // 0x00FC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceMissEnabled;                                 // 0x0100(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ExtraClampingDistance;                             // 0x0104(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPreventHeadshots;                                 // 0x0108(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         WeaponSpreadContributionToClampCurve;              // 0x0110(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                         KillingBlowGracePeriodAtMinRange;                  // 0x0138(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KillingBlowGracePeriodAtMaxRange;                  // 0x013C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ExtraHitOddsCurve;                                 // 0x0140(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct FortniteAI.DigestedWeaponAccuracy
// 0x0328 (0x0328 - 0x0000)
struct FDigestedWeaponAccuracy final
{
public:
	struct FScalableFloat                         TrackingOffsetError;                               // 0x0000(0x0028)(Transient, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingTrackingOffsetError;                      // 0x0028(0x0028)(Transient, NativeAccessSpecifierPrivate)
