#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteConversationRuntime

#include "Basic.hpp"

#include "CommonConversationRuntime_structs.hpp"
#include "FortniteConversationRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FortniteConversationRuntime.FortConversationContextCondition.DoesContextPass
// 0x0040 (0x0040 - 0x0000)
struct FortConversationContextCondition_DoesContextPass final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationRuntime.FortConversationContextConditionHelpers.GetMessageForContext
// 0x0068 (0x0068 - 0x0000)
struct FortConversationContextConditionHelpers_GetMessageForContext final
{
public:
	struct FFortConversationNodeConditionalMessages Messages;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FConversationContext                   Context;                                           // 0x0010(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FText                                   OutText;                                           // 0x0048(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationRuntime.FortConversationParamLibrary.ExtractConversationParameterValue
// 0x0038 (0x0038 - 0x0000)
struct FortConversationParamLibrary_ExtractConversationParameterValue final
{
public:
	TArray<struct FConversationNodeParameterPair> ConversationParameters;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 DesiredParameterName;                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterValueOut;                                 // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationRuntime.FortPlayerConversationComponent.ClientReceiveConversationGiftUINotification
// 0x0028 (0x0028 - 0x0000)
struct FortPlayerConversationComponent_ClientReceiveConversationGiftUINotification final
{
public:
	struct FGiftUINotificationInfo                ConversationGiftUINotification;                    // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationRuntime.FortPlayerConversationComponent.HandleDBNOChanged
// 0x0010 (0x0010 - 0x0000)
struct FortPlayerConversationComponent_HandleDBNOChanged final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDBNO;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteConversationRuntime.FortPlayerConversationComponent.HandleFollowedPlayerChanged
// 0x0010 (0x0010 - 0x0000)
struct FortPlayerConversationComponent_HandleFollowedPlayerChanged final
{
public:
	class AFortPlayerControllerSpectating*        SpectatingPC;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                       FollowedPlayerState;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationRuntime.FortPlayerConversationComponent.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct FortPlayerConversationComponent_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationRuntime.FortPlayerConversationComponent.RequestServerAbortConversationWithParticipant
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerConversationComponent_RequestServerAbortConversationWithParticipant final
{
public:
	const class UFortNonPlayerConversationParticipantComponent* Participant;                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

