#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortCosmeticVariantRow_Numeric

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortCosmeticVariantRow_Numeric.FortCosmeticVariantRow_Numeric_C.SetFortVariantNumericChannelVM
// 0x0028 (0x0028 - 0x0000)
struct FortCosmeticVariantRow_Numeric_C_SetFortVariantNumericChannelVM final
{
public:
	class UFortVariantNumericChannelVM*           ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Numeric.FortCosmeticVariantRow_Numeric_C.ExecuteUbergraph_FortCosmeticVariantRow_Numeric
// 0x0028 (0x0028 - 0x0000)
struct FortCosmeticVariantRow_Numeric_C_ExecuteUbergraph_FortCosmeticVariantRow_Numeric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_3;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Numeric.FortCosmeticVariantRow_Numeric_C.BndEvt__FortCosmeticVariantRow_Numeric_Button_ZeroDigitUp_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_Numeric_C_BndEvt__FortCosmeticVariantRow_Numeric_Button_ZeroDigitUp_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Numeric.FortCosmeticVariantRow_Numeric_C.BndEvt__FortCosmeticVariantRow_Numeric_Button_ZeroDigitDown_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_Numeric_C_BndEvt__FortCosmeticVariantRow_Numeric_Button_ZeroDigitDown_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Numeric.FortCosmeticVariantRow_Numeric_C.BndEvt__FortCosmeticVariantRow_Numeric_Button_TenDigitUp_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_Numeric_C_BndEvt__FortCosmeticVariantRow_Numeric_Button_TenDigitUp_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Numeric.FortCosmeticVariantRow_Numeric_C.BndEvt__FortCosmeticVariantRow_Numeric_Button_TenDigitDown_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_Numeric_C_BndEvt__FortCosmeticVariantRow_Numeric_Button_TenDigitDown_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Numeric.FortCosmeticVariantRow_Numeric_C.GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_Numeric_C_GetDesiredFocusTarget final
{
public:
	class UWidget*                                FocusTarget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}

