#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortCosmeticVariantRow_Redirector

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FortCosmeticVariantRow_Redirector.FortCosmeticVariantRow_Redirector_C.HandleVariantEngaged
// 0x0048 (0x0048 - 0x0000)
struct FortCosmeticVariantRow_Redirector_C_HandleVariantEngaged final
{
public:
	struct FMcpVariantChannelInfo                 InVariantChannelInfo;                              // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	const class UFortVariantItemVM*               ItemVM;                                            // 0x0040(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Redirector.FortCosmeticVariantRow_Redirector_C.ExecuteUbergraph_FortCosmeticVariantRow_Redirector
// 0x0060 (0x0060 - 0x0000)
struct FortCosmeticVariantRow_Redirector_C_ExecuteUbergraph_FortCosmeticVariantRow_Redirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMcpVariantChannelInfo                 K2Node_Event_InVariantChannelInfo;                 // 0x0008(0x0040)(ConstParm, HasGetValueTypeHash)
	const class UFortVariantItemVM*               K2Node_Event_ItemVM;                               // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortVariantChannelVM*                  CallFunc_Map_Find_Value;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Redirector.FortCosmeticVariantRow_Redirector_C.Add Variant Channel
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_Redirector_C_Add_Variant_Channel final
{
public:
	class UFortVariantChannelVM*                  ChannelVM;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function FortCosmeticVariantRow_Redirector.FortCosmeticVariantRow_Redirector_C.GetDesiredFocusTarget
// 0x0030 (0x0030 - 0x0000)
struct FortCosmeticVariantRow_Redirector_C_GetDesiredFocusTarget final
{
public:
	class UWidget*                                FocusTarget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_VariantRow_FocusTargetWidget_C> K2Node_DynamicCast_AsBPI_Variant_Row_Focus_Target_Widget; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_FocusTarget;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}

