#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortAudioClustersRuntime

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "FortAudioClustersRuntime_structs.hpp"


namespace SDK
{

// Class FortAudioClustersRuntime.FortAudioClustersSettings
// 0x0050 (0x0080 - 0x0030)
class UFortAudioClustersSettings final : public UDeveloperSettings
{
public:
	TMap<struct FGameplayTag, double>             ParameterDefaults;                                 // 0x0030(0x0050)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAudioClustersSettings">();
	}
	static class UFortAudioClustersSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAudioClustersSettings>();
	}
};

// Class FortAudioClustersRuntime.FortAudioClustersSubsystem
// 0x0000 (0x0040 - 0x0040)
class UFortAudioClustersSubsystem final : public UTickableWorldSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAudioClustersSubsystem">();
	}
	static class UFortAudioClustersSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAudioClustersSubsystem>();
	}
};

// Class FortAudioClustersRuntime.GameFeatureAction_AddAudioCluster
// 0x00C8 (0x00F0 - 0x0028)
class UGameFeatureAction_AddAudioCluster final : public UGameFeatureAction
{
public:
	TArray<struct FGameFeatureAudioClusterEntry>  Clusters;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGameplayTag>        OverrideTable;                                     // 0x0038(0x0050)(Edit, NativeAccessSpecifierPublic)
	class FName                                   DisabledActorTag;                                  // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x64];                                      // 0x008C(0x0064)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleRegisteredActorDeath(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddAudioCluster">();
	}
	static class UGameFeatureAction_AddAudioCluster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddAudioCluster>();
	}
};

// Class FortAudioClustersRuntime.GameFeatureAction_AddAudioClusterConfigMaps
// 0x0060 (0x0088 - 0x0028)
class UGameFeatureAction_AddAudioClusterConfigMaps final : public UGameFeatureAction
{
public:
	TArray<TSoftObjectPtr<class UAudioClusterConfigMap>> ConfigMaps;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddAudioClusterConfigMaps">();
	}
	static class UGameFeatureAction_AddAudioClusterConfigMaps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddAudioClusterConfigMaps>();
	}
};

}

