#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Frontend_Lobby_Background

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FrontendBackgroundData_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend_Lobby_Background.Frontend_Lobby_Background_C
// 0x0160 (0x0408 - 0x02A8)
class AFrontend_Lobby_Background_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FadeIn_Fade_3606FDF647A6577B9DAC47B89146CD85;      // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeIn__Direction_3606FDF647A6577B9DAC47B89146CD85; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     FadeIn;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOut_Fade_44D3B05B49031FA3891648AB32F57584;     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeOut__Direction_44D3B05B49031FA3891648AB32F57584; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     FadeOut;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        FadetoBlackFloor;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeGrid;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeGrid_Targetvalue;                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadetoBlackFloor_TargetValue;                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PresetEnvironment;                                 // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UTexture*                               Texture;                                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      PreBlueMaterial;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FFrontendBackgroundData> Backgrounds;                                 // 0x0318(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UNiagaraComponent*                      NiagaraFXComponent;                                // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          FadedFromBlue;                                     // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class ABP_FrontendBackPlate_C*                Six_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEmitter*                               P_Storm_Rain_01_5_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEmitter*                               P_Snow_Ambient_Lobby_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NS_SideWays_Volume_InFrontEnd_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   SM_Sideways_Smoke_FrontEnd_159_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   SM_Mother_Crash_BlinkingLights_01_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   SM_Sideways_Smoke_FrontEnd_0_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_1_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_4_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_Setup_Basic_Background_Data_MERGED_RefProperty; // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupGalileo_MERGED_RefProperty;               // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupSpecialEventBackgroundData_MERGED_RefProperty; // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupBasicBackgroundDataWithRenderTarget_MERGED_RefProperty; // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupSpecialEventBackgroundDataWithRenderTarget_MERGED_RefProperty; // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACMSLobbyDirector_C*                    CMSLobbyDirector_3_UpdateLevelActorsVisibility_MERGED_RefProperty; // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_UpdateLevelActorsVisibility_MERGED_RefProperty; // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateLevelActorsVisibility();
	void UpdateFade(double FadeValue, double FadeFloorToBlack, double InFadeGrid);
	void TestDynColor();
	void SetupSpecialEventBackgroundDataWithRenderTarget(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void SetupSpecialEventBackgroundData(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void SetupGalileo();
	void SetupBasicBackgroundDataWithRenderTarget(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void Setup_Basic_Background_Data(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void SetShowPedestalSparkles(bool Show);
	void ReceiveBeginPlay();
	void OnLoaded_E5F1E80A4DD36718D41FF68F137C4775(class UObject* Loaded);
	void OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99(class UObject* Loaded);
	void OnLoaded_7B16DAE04937EECB604410A2EC352CE3(class UObject* Loaded);
	void OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70(class UObject* Loaded);
	void LoadBackgroundData();
	void LoadAssets(TSoftObjectPtr<class UTexture> InTexture, TSoftObjectPtr<class UMaterialInstance> InMaterial, TSoftObjectPtr<class UMaterialInstance> InPreBlurMaterial);
	void FadeOut__UpdateFunc();
	void FadeOut__FinishedFunc();
	void FadeIn__UpdateFunc();
	void FadeIn__FinishedFunc();
	void FadeFromBlue();
	void ExecuteUbergraph_Frontend_Lobby_Background(int32 EntryPoint);
	void Convert_Legacy_Frontend_Background_Data(const struct FFrontendBackgroundData& Legacy_Frontend_Background_Data, struct FFrontendLobbyData* Frontend_Lobby_Data);
	void ContinueBackgroundSetup();
	void BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature(const struct FFrontendLobbyData& LobbyData);
	void BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature(class UTexture* BackgroundImage);
	void BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature(const class FString& PresetEnvironmentName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Frontend_Lobby_Background_C">();
	}
	static class AFrontend_Lobby_Background_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_Lobby_Background_C>();
	}
};

}

