#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FrontendBackgroundData

#include "Basic.hpp"

#include "FrontendFXData_structs.hpp"


namespace SDK
{

// UserDefinedStruct FrontendBackgroundData.FrontendBackgroundData
// 0x0088 (0x0088 - 0x0000)
struct FFrontendBackgroundData final
{
public:
	TSoftObjectPtr<class UTexture>                Texture_2_3547D6284A0E2943DB5EC88EE87E97DF;        // 0x0000(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       Material_6_CE9D2295415B51CDF1ED17B4FF554781;       // 0x0020(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       PreBlurMaterial_7_D600AA604396EA3D679C70876327DEF8; // 0x0040(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FFrontendFXData>                SpawnFXList_15_1A6BE00B475CC5544CE786879F76C49C;   // 0x0060(0x0010)(Edit, BlueprintVisible)
	double                                        FadeGrid_20_F2E82D3040D8341B710155A8337BCAB3;      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeFloortoBlack_22_216AC34A4AAB1E55AED6918145AD572F; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowBackgroundShapes_25_B3A9B6894AB2C74092C2DF978D2E734D; // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

