#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Athena_ZipLine_SmashParent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ZipLine_SmashParent.GA_Athena_ZipLine_SmashParent_C
// 0x00B0 (0x0C28 - 0x0B78)
class UGA_Athena_ZipLine_SmashParent_C : public UFortGameplayAbility_ZiplineSmashBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        UpdateIntervalForSmashVolume;                      // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 StructureDamageGE;                                 // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ZipLine_Athena_Harness_C*           ZiplineHarness;                                    // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaZipline*                     Zipline;                                           // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    ZiplineInteractComponent;                          // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EFortCustomMovement                           DrivingCustomMovementMode;                         // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB1[0x3];                                      // 0x0BB1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            FallImmunityGEFX;                                  // 0x0BB4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AttachVFXCue;                                      // 0x0BBC(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SmashCue;                                          // 0x0BC0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Swimming;                                        // 0x0BC4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Falling;                                         // 0x0BC8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  TagsThatBlockFallImmunityRemoval;                  // 0x0BD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           TH_DelayFallDamageRemoval;                         // 0x0BF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SurroundingsCheckTimerHandle;                      // 0x0BF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ZiplineExitTag;                                    // 0x0C00(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C04[0x4];                                      // 0x0C04(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Smash_Box_Extent;                                  // 0x0C08(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SmashBoxPosAdditionalZ;                            // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_5A9C02A9480D39B213A8AC81767C7A76();
	void BindEvent();
	void BreakNearbyStructures(class AFortPlayerPawn* PlayerPawn_0);
	void CheckForQuestProgress();
	void CheckMotor();
	void DelaySpawnMotor();
	void EndAsyncBreakNearbyStructuresOverlap(const TArray<class AActor*>& OverlapActors);
	void EnterWaterExit(class AFortPlayerPawn* FortPlayerPawn);
	void ExecuteUbergraph_GA_Athena_ZipLine_SmashParent(int32 EntryPoint);
	void FallingTagRemoved();
	void GameplayEvent_ZiplineEnter_BeginZiplining();
	void GameplayTagEvent_ZiplineEnter(const struct FGameplayEventData& EventData);
	void GameplayTagEvent_ZiplineExit(const struct FGameplayEventData& EventData);
	void Get_Zipline_Motor_Offset(struct FVector* Offset);
	void Get_Zipline_Pole_A_Socket_Loc(struct FVector* PoleBSocketLoc);
	void Get_Zipline_Pole_B_Socket_Loc(struct FVector* PoleBSocketLoc);
	void GetZiplineRotationForMotor(struct FRotator* Rotation);
	void HandleClientSplineZiplineStateChanged(bool bIsZiplining, class AFortPlayerPawn* Pawn);
	void HandleGameplayEventTag(const struct FGameplayEventData& EventData);
	void HandleZiplineStateChanged(bool bIsZiplining, class AFortPlayerPawn* Pawn);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBeginSkydiving_Bind();
	void OnEnteredAircraft_Bind();
	void OnEnterVehicle_Bind();
	void OnPawnDied(const class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnPawnLanded_Bind(const struct FHitResult& Hit);
	void Pre_BeginZiplinging();
	void Remove_Fall_Damage_Immunity_Delayed();
	void Removed_A0F18316443E5C5267615C9692274B36();
	void RemoveFallDamageImmunity();
	void Spawn_Motor(class AActor* PlayerPawn_0);
	void SplineZiplineMovementModeDelayOver();
	void StartSurroundingsCheck();
	void SurroundingsCheck();
	void SurroundingsCheck_MotorCheck();
	void SurroundingsCheck_SmashObjects();
	void SurruondingsCheck_VehicleCheck();
	void SwimmingStarted();
	void ZiplinePostBegin_Event();
	void ZipliningComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ZipLine_SmashParent_C">();
	}
	static class UGA_Athena_ZipLine_SmashParent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ZipLine_SmashParent_C>();
	}
};

}

