#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayGraph

#include "Basic.hpp"

#include "GameplayGraph_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayGraph.GraphElement
// 0x0018 (0x0040 - 0x0028)
class UGraphElement : public UObject
{
public:
	EGraphElementType                             ElementType;                                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         UniqueIndex;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGraph>                  ParentGraph;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GraphElement">();
	}
	static class UGraphElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphElement>();
	}
};

// Class GameplayGraph.Graph
// 0x01A8 (0x01D0 - 0x0028)
class UGraph : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<struct FGraphVertexHandle, class UGraphVertex*> Vertices;                                   // 0x0070(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x50];                                      // 0x00C0(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<struct FGraphEdgeHandle, class UGraphEdge*> Edges;                                          // 0x0110(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FGraphIslandHandle, class UGraphIsland*> Islands;                                    // 0x0160(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x20];                                     // 0x01B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Graph">();
	}
	static class UGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraph>();
	}
};

// Class GameplayGraph.GraphEdge
// 0x0020 (0x0060 - 0x0040)
class UGraphEdge final : public UGraphElement
{
public:
	struct FGraphVertexHandle                     A;                                                 // 0x0040(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGraphVertexHandle                     B;                                                 // 0x0050(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GraphEdge">();
	}
	static class UGraphEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphEdge>();
	}
};

// Class GameplayGraph.GraphIsland
// 0x00B8 (0x00F8 - 0x0040)
class UGraphIsland : public UGraphElement
{
public:
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Size After Last Property [ Dumper-8 ])
	TSet<struct FGraphVertexHandle>               Vertices;                                          // 0x00A0(0x0050)(SaveGame, NativeAccessSpecifierPrivate)
	bool                                          bPendingDestroy;                                   // 0x00F0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GraphIsland">();
	}
	static class UGraphIsland* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphIsland>();
	}
};

// Class GameplayGraph.GraphVertex
// 0x0090 (0x00D0 - 0x0040)
class UGraphVertex : public UGraphElement
{
public:
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<struct FGraphVertexHandle, struct FGraphEdgeHandle> Edges;                                  // 0x0070(0x0050)(NativeAccessSpecifierPrivate)
	struct FGraphIslandHandle                     ParentIsland;                                      // 0x00C0(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GraphVertex">();
	}
	static class UGraphVertex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphVertex>();
	}
};

}

