#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameHubRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class GameHubRuntime.GameHubBaseMutator
// 0x0010 (0x0348 - 0x0338)
class AGameHubBaseMutator final : public AFortAthenaMutator
{
public:
	uint8                                         Pad_338[0x10];                                     // 0x0338(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubBaseMutator">();
	}
	static class AGameHubBaseMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameHubBaseMutator>();
	}
};

// Class GameHubRuntime.GameHubPlayerSpawningComponent
// 0x0020 (0x00D0 - 0x00B0)
class UGameHubPlayerSpawningComponent final : public UPlayspaceComponent_PlayerSpawning
{
public:
	struct FGameplayTagContainer                  PlayerStartRequirements;                           // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubPlayerSpawningComponent">();
	}
	static class UGameHubPlayerSpawningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameHubPlayerSpawningComponent>();
	}
};

// Class GameHubRuntime.GameHubPlayspace
// 0x0028 (0x06E8 - 0x06C0)
class AGameHubPlayspace final : public AFortPlayspace
{
public:
	bool                                          bSimulatePlayerDamage;                             // 0x06C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  PlayerStartRequirements;                           // 0x06C8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubPlayspace">();
	}
	static class AGameHubPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameHubPlayspace>();
	}
};

}

