#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayBehaviorsModule

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayBehaviorsModule_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameplayBehaviorsModule.BTDecorator_GameplayTagQuery
// 0x0080 (0x00E8 - 0x0068)
class UBTDecorator_GameplayTagQuery final : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                 ActorForGameplayTagQuery;                          // 0x0068(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      GameplayTagQuery;                                  // 0x0090(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                   QueryTags;                                         // 0x00D8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_GameplayTagQuery">();
	}
	static class UBTDecorator_GameplayTagQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_GameplayTagQuery>();
	}
};

// Class GameplayBehaviorsModule.BTTask_StopGameplayBehavior
// 0x0008 (0x0078 - 0x0070)
class UBTTask_StopGameplayBehavior final : public UBTTaskNode
{
public:
	TSubclassOf<class UGameplayBehavior>          BehaviorToStop;                                    // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_StopGameplayBehavior">();
	}
	static class UBTTask_StopGameplayBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_StopGameplayBehavior>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehaviorConfig
// 0x0008 (0x0030 - 0x0028)
class UGameplayBehaviorConfig : public UObject
{
public:
	TSubclassOf<class UGameplayBehavior>          BehaviorClass;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehaviorConfig">();
	}
	static class UGameplayBehaviorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehaviorConfig>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehaviorConfig_BehaviorTree
// 0x0028 (0x0058 - 0x0030)
class UGameplayBehaviorConfig_BehaviorTree final : public UGameplayBehaviorConfig
{
public:
	TSoftObjectPtr<class UBehaviorTree>           BehaviorTree;                                      // 0x0030(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bRevertToPreviousBTOnFinish : 1;                   // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehaviorConfig_BehaviorTree">();
	}
	static class UGameplayBehaviorConfig_BehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehaviorConfig_BehaviorTree>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehavior
// 0x0060 (0x0088 - 0x0028)
class UGameplayBehavior : public UObject
{
public:
	uint8                                         Pad_28[0x14];                                      // 0x0028(0x0014)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           ActionTag;                                         // 0x003C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AActor*>                         RelevantActors;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class AActor*                                 TransientSmartObjectOwner;                         // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 TransientAvatar;                                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UGameplayTask*>                  ActiveTasks;                                       // 0x0078(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void K2_AbortBehavior(class AActor* Avatar);
	void K2_EndBehavior(class AActor* Avatar);
	void K2_OnFinished(class AActor* Avatar, bool bWasInterrupted);
	void K2_OnFinishedCharacter(class ACharacter* Avatar, bool bWasInterrupted);
	void K2_OnFinishedPawn(class APawn* Avatar, bool bWasInterrupted);
	void K2_OnTriggered(class AActor* Avatar, const class UGameplayBehaviorConfig* Config, class AActor* SmartObjectOwner);
	void K2_OnTriggeredCharacter(class ACharacter* Avatar, const class UGameplayBehaviorConfig* Config, class AActor* SmartObjectOwner);
	void K2_OnTriggeredPawn(class APawn* Avatar, const class UGameplayBehaviorConfig* Config, class AActor* SmartObjectOwner);
	void K2_TriggerBehavior(class AActor* Avatar, class UGameplayBehaviorConfig* Config, class AActor* SmartObjectOwner);

	int32 K2_GetNextActorIndexInSequence(int32 CurrentIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehavior">();
	}
	static class UGameplayBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehavior>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehavior_BehaviorTree
// 0x0020 (0x00A8 - 0x0088)
class UGameplayBehavior_BehaviorTree final : public UGameplayBehavior
{
public:
	class UBehaviorTree*                          PreviousBT;                                        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AAIController*                          AIController;                                      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSingleRun;                                        // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99[0xF];                                       // 0x0099(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehavior_BehaviorTree">();
	}
	static class UGameplayBehavior_BehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehavior_BehaviorTree>();
	}
};

// Class GameplayBehaviorsModule.BlackboardKeyType_GameplayTag
// 0x0000 (0x0030 - 0x0030)
class UBlackboardKeyType_GameplayTag final : public UBlackboardKeyType
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlackboardKeyType_GameplayTag">();
	}
	static class UBlackboardKeyType_GameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlackboardKeyType_GameplayTag>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehaviorConfig_Animation
// 0x0030 (0x0060 - 0x0030)
class UGameplayBehaviorConfig_Animation final : public UGameplayBehaviorConfig
{
public:
	TSoftObjectPtr<class UAnimMontage>            AnimMontage;                                       // 0x0030(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PlayRate;                                          // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   StartSectionName;                                  // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bLoop : 1;                                         // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehaviorConfig_Animation">();
	}
	static class UGameplayBehaviorConfig_Animation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehaviorConfig_Animation>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehaviorsBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameplayBehaviorsBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddGameplayTagFilterToBlackboardKeySelector(struct FBlackboardKeySelector* InSelector, class UObject* Owner, class FName PropertyName);
	static struct FGameplayTagContainer GetBlackboardValueAsGameplayTag(class UBTNode* NodeOwner, const struct FBlackboardKeySelector& Key);
	static struct FGameplayTagContainer GetBlackboardValueAsGameplayTagFromBlackboardComp(class UBlackboardComponent* BlackboardComp, const class FName& KeyName);
	static void SetBlackboardValueAsGameplayTag(class UBTNode* NodeOwner, const struct FBlackboardKeySelector& Key, const struct FGameplayTagContainer& Value);
	static void SetValueAsGameplayTagForBlackboardComp(class UBlackboardComponent* BlackboardComp, const class FName& KeyName, const struct FGameplayTagContainer& GameplayTagValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehaviorsBlueprintFunctionLibrary">();
	}
	static class UGameplayBehaviorsBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehaviorsBlueprintFunctionLibrary>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehaviorSubsystem
// 0x0050 (0x0080 - 0x0030)
class UGameplayBehaviorSubsystem final : public UWorldSubsystem
{
public:
	TMap<class AActor*, struct FAgentGameplayBehaviors> AgentGameplayBehaviors;                      // 0x0030(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehaviorSubsystem">();
	}
	static class UGameplayBehaviorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehaviorSubsystem>();
	}
};

// Class GameplayBehaviorsModule.GameplayBehavior_AnimationBased
// 0x0010 (0x0098 - 0x0088)
class UGameplayBehavior_AnimationBased final : public UGameplayBehavior
{
public:
	TArray<struct FMontagePlaybackData>           ActivePlayback;                                    // 0x0088(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void OnMontageFinished(class UAnimMontage* Montage, bool bInterrupted, class AActor* InAvatar);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayBehavior_AnimationBased">();
	}
	static class UGameplayBehavior_AnimationBased* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayBehavior_AnimationBased>();
	}
};

}

