#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayGraph

#include "Basic.hpp"


namespace SDK
{

// Enum GameplayGraph.EGraphElementType
// NumValues: 0x0005
enum class EGraphElementType : uint32
{
	Node                                     = 0,
	Edge                                     = 1,
	Island                                   = 2,
	Unknown                                  = 3,
	EGraphElementType_MAX                    = 4,
};

// ScriptStruct GameplayGraph.GraphProperties
// 0x0001 (0x0001 - 0x0000)
struct FGraphProperties final
{
public:
	bool                                          bGenerateIslands;                                  // 0x0000(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayGraph.GraphHandle
// 0x0010 (0x0010 - 0x0000)
struct FGraphHandle
{
public:
	int64                                         UniqueIndex;                                       // 0x0000(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGraphElement>           Element;                                           // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct GameplayGraph.GraphVertexHandle
// 0x0000 (0x0010 - 0x0010)
struct FGraphVertexHandle final : public FGraphHandle
{
};

// ScriptStruct GameplayGraph.GraphEdgeHandle
// 0x0000 (0x0010 - 0x0010)
struct FGraphEdgeHandle final : public FGraphHandle
{
};

// ScriptStruct GameplayGraph.SerializedEdgeData
// 0x0020 (0x0020 - 0x0000)
struct FSerializedEdgeData final
{
public:
	struct FGraphVertexHandle                     Node1;                                             // 0x0000(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGraphVertexHandle                     Node2;                                             // 0x0010(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayGraph.GraphIslandHandle
// 0x0000 (0x0010 - 0x0010)
struct FGraphIslandHandle final : public FGraphHandle
{
};

// ScriptStruct GameplayGraph.SerializedIslandData
// 0x0010 (0x0010 - 0x0000)
struct FSerializedIslandData final
{
public:
	TArray<struct FGraphVertexHandle>             Vertices;                                          // 0x0000(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayGraph.SerializableGraph
// 0x00B8 (0x00B8 - 0x0000)
struct FSerializableGraph
{
public:
	struct FGraphProperties                       Properties;                                        // 0x0000(0x0001)(SaveGame, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FGraphVertexHandle>             Vertices;                                          // 0x0008(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGraphEdgeHandle, struct FSerializedEdgeData> Edges;                                 // 0x0018(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGraphIslandHandle, struct FSerializedIslandData> Islands;                           // 0x0068(0x0050)(SaveGame, NativeAccessSpecifierPublic)
};

}

