#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GoalsRewards_Quest

#include "Basic.hpp"


namespace SDK::Params
{

// Function GoalsRewards_Quest.GoalsRewards_Quest_C.UpdateCosmeticGateWarning
// 0x0038 (0x0038 - 0x0000)
struct GoalsRewards_Quest_C_UpdateCosmeticGateWarning final
{
public:
	class UFortItemDefinition*                    Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICosmeticItemGatingInterface> CallFunc_HasRatingRestrictions_CosmeticItemGatingInterface_CastInput; // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasRatingRestrictions_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GoalsRewards_Quest.GoalsRewards_Quest_C.ExecuteUbergraph_GoalsRewards_Quest
// 0x0010 (0x0010 - 0x0000)
struct GoalsRewards_Quest_C_ExecuteUbergraph_GoalsRewards_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	const class UFortItemDefinition*              K2Node_Event_Item;                                 // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function GoalsRewards_Quest.GoalsRewards_Quest_C.BP_OnItemPresented
// 0x0008 (0x0008 - 0x0000)
struct GoalsRewards_Quest_C_BP_OnItemPresented final
{
public:
	const class UFortItemDefinition*              Item;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

