#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Grandma_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Grandma_AnimBP.Grandma_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Grandma_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Grandma_AnimBP.Grandma_AnimBP_C.ExecuteUbergraph_Grandma_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct Grandma_AnimBP_C_ExecuteUbergraph_Grandma_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Grandma_AnimBP.Grandma_AnimBP_C.Fauna Idle
// 0x0020 (0x0020 - 0x0000)
struct Grandma_AnimBP_C_Fauna_Idle final
{
public:
	struct FPoseLink                              InPose_Idle;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Fauna_Idle_0;                                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Grandma_AnimBP.Grandma_AnimBP_C.Fauna IdleTurn
// 0x0020 (0x0020 - 0x0000)
struct Grandma_AnimBP_C_Fauna_IdleTurn final
{
public:
	struct FPoseLink                              InPose_IdleTurn;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Fauna_IdleTurn_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Grandma_AnimBP.Grandma_AnimBP_C.Fauna Jump
// 0x0010 (0x0010 - 0x0000)
struct Grandma_AnimBP_C_Fauna_Jump final
{
public:
	struct FPoseLink                              Fauna_Jump_0;                                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

}

