#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GravityOverrideParamsStruct

#include "Basic.hpp"

#include "GravityOverrideSettingStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct GravityOverrideParamsStruct.GravityOverrideParamsStruct
// 0x07B8 (0x07B8 - 0x0000)
struct FGravityOverrideParamsStruct final
{
public:
	struct FGravityOverrideSettingStruct          Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0000(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F; // 0x0068(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457; // 0x00D0(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F; // 0x0138(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x01A0(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254; // 0x0208(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          EmoteOrMelee_34_CFCF66B5492987CBD638EC98EB34D572;  // 0x0270(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Swimming_35_33CE87CE4D4F712B1384E29115845962;      // 0x02D8(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Front_End_36_C7A4562A48E9BC9B4CD34D963CFC6490;     // 0x0340(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          DBNO_40_83703B55467F014D644D02B56709A2E6;          // 0x03A8(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          DBNO_Carried_41_2C3D52AF4B7EB85DBA7C108948E58B3A;  // 0x0410(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          OnGround_Falling_45_DC16623B41084152717ACBAF5DCE8A91; // 0x0478(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Ziplining_46_0F05199D45821770F22E0B957551FEB7;     // 0x04E0(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Skydive_Surfing_49_5869AA5846BEE7C351769C951D56A34F; // 0x0548(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Riding_Standing_54_C62E341C48CF5BA85ACB799EE3C7653E; // 0x05B0(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Riding_Moving_55_86CD46C94E5B465A175A6B939DB193BD; // 0x0618(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Riding_Moving_Targeting_58_38650D3547535FB293E61CBCF1B753BF; // 0x0680(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Tactical_Sprint_57_7B4700A94AF4B34179554C8EC4EB52E0; // 0x06E8(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Rail_Grinding_61_97CB95534C5559BAF29FE49C016359FA; // 0x0750(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

