#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GrindingExtensionLogic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GrindRailRuntime_structs.hpp"
#include "GrindRailRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GrindingExtensionLogic.GrindingExtensionLogic_C
// 0x0238 (0x0E38 - 0x0C00)
class UGrindingExtensionLogic_C final : public UFortMovementMode_ExtLogicGrinding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABGA_GrindRail_C*                       CurrentRail;                                       // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawn;                                        // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          StartedGrindFromLand;                              // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C19[0x7];                                      // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         LandingSpeedBoost;                                 // 0x0C20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           RemoveIsGrindingTimer;                             // 0x0C48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimLayerActive;                                   // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C51[0x7];                                      // 0x0C51(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                CameraLocationOnStartedGrinding;                   // 0x0C58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BPGrinding;                                        // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x3];                                      // 0x0C71(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Start_Grinding_Event_Tag;                          // 0x0C74(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StopGrindingEventTag;                              // 0x0C80(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C84[0x4];                                      // 0x0C84(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SF_RemoveGASmashAfterDelay;                        // 0x0C88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCameraModifier_Grinding_C*             CameraModifier;                                    // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SF_MinJumpOffSpeed;                                // 0x0CB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_JumpDistanceMultiplier;                         // 0x0CE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DrawAnchorDebug;                                   // 0x0D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D09[0x7];                                      // 0x0D09(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SF_InfluenceOfMomentumOnAnchorJump;                // 0x0D10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_JumpHeight;                                     // 0x0D38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_SameRailAnchoring_MaxForwardDistanceMultiplier; // 0x0D60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_SameRailAnchoring_MaxAngle;                     // 0x0D88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_NoAnchorJumpDistanceMultiplier;                 // 0x0DB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTacticalSprintEnergyComponent_C*       SprintComponent;                                   // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SF_Sprinting_EnergyToUsePerSecond;                 // 0x0DE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SF_Sprinting_EnergyToUsePerSecond_Creative;        // 0x0E08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Start_Sprinting_Event_Tag;                         // 0x0E30(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddCameraModifier();
	void ADSPressed();
	void ADSReleased();
	void Anchor_Forward_Jump(const struct FVector& Planned_Velocity_Without_Jump, const struct FVector& AnchoredJumpDir, struct FVector* NewVelocity, bool* Anchored);
	void AnchorJump(struct FVector* New_Velocity, bool* Anchored);
	void BoosterModeChangedDelegate_Event(EGrindRailBoosterMode PreviousBoosterMode);
	void BP_OnExtensionActivate();
	void BP_OnExtensionDeactivate();
	void CacheGrindRailActor();
	void Change_Sprint_State(bool New);
	void CheckForTryingToJumpStraight(const struct FVector& PotentialAnchorPoint, const struct FVector& JumpTravelVector, bool* CancelAnchor);
	void ExecuteUbergraph_GrindingExtensionLogic(int32 EntryPoint);
	struct FVector GetLeanVectorInWorldSpace();
	void HandleGrindingBegun();
	void HandleGrindingEnded();
	void HandleJumpOffEnd();
	void HandleRailJump();
	void HandleSprintInput(bool bPressed);
	void Jumpoff(const struct FVector& Jump_Velocity);
	void JumpOffEnd();
	void LinkAnimLayer();
	void OnEnergyCompletelyDrained_Event(class UFortComponent_Energy* EnergyComponent);
	void RailJump();
	void RemoveCameraModifier();
	void RemoveIsGrindingAfterDelay();
	void Send_Gameplay_Event_Tag_To_Actor_Func(const struct FGameplayTag& EventTag);
	void SprintingStateChangedDelegate_Event(bool bNewIsSprinting);
	void StopSprinting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GrindingExtensionLogic_C">();
	}
	static class UGrindingExtensionLogic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrindingExtensionLogic_C>();
	}
};

}

