#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Habanero_PanelColors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Habanero_PanelColors.Habanero_PanelColors
// 0x0050 (0x0050 - 0x0000)
struct FHabanero_PanelColors final
{
public:
	struct FLinearColor                           Glow_19_83A6FFCF4D2B83AD498EFBBE9D4FF0F7;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Flare_ColorA_14_970759BF47086E2A6C5447AB4180B9DE;  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Flare_ColorB_15_A9BFEA664DD6359AA4CE06B21114CE6E;  // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FlareBG_ColorA_16_51581E30465EEBC099E0D08E07C0CEBF; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FlareBG_ColorB_17_93C76A66483AA75A2B7EEB8315E8BCE3; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

