#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HarmonixStems

#include "Basic.hpp"

#include "HarmonixStems_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HarmonixStems.StemConfiguration
// 0x0010 (0x0038 - 0x0028)
class UStemConfiguration final : public UObject
{
public:
	TArray<struct FStemConfigurationAudioBus>     Stems;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StemConfiguration">();
	}
	static class UStemConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStemConfiguration>();
	}
};

// Class HarmonixStems.StemmedMusicAsset
// 0x0018 (0x0040 - 0x0028)
class UStemmedMusicAsset : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UMidiFile*                              MidiFile;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStemConfiguration*                     StemConfiguration;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StemmedMusicAsset">();
	}
	static class UStemmedMusicAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStemmedMusicAsset>();
	}
};

// Class HarmonixStems.StemmedWavesAsset
// 0x0018 (0x0058 - 0x0040)
class UStemmedWavesAsset final : public UStemmedMusicAsset
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FWavesAssetStem>                WavesStems;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StemmedWavesAsset">();
	}
	static class UStemmedWavesAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStemmedWavesAsset>();
	}
};

// Class HarmonixStems.StemmedMediaStreamAsset
// 0x0018 (0x0058 - 0x0040)
class UStemmedMediaStreamAsset final : public UStemmedMusicAsset
{
public:
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMediaStreamAssetStem>          StreamStems;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StemmedMediaStreamAsset">();
	}
	static class UStemmedMediaStreamAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStemmedMediaStreamAsset>();
	}
};

}

