#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HoagieRuntime

#include "Basic.hpp"

#include "HoagieRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HoagieRuntime.FortHoagieAudioController.CacheAudioComponents
// 0x0010 (0x0010 - 0x0000)
struct FortHoagieAudioController_CacheAudioComponents final
{
public:
	class UFortLayeredAudioComponent*             InEngine;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortLayeredAudioComponent*             InRotor;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieAudioController.CacheHoagieVehicle
// 0x0008 (0x0008 - 0x0000)
struct FortHoagieAudioController_CacheHoagieVehicle final
{
public:
	class AFortHoagieVehicle*                     InVehicle;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.HoagieOnDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct FortHoagieVehicle_HoagieOnDisabledChanged final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.MulticastRotorImpulse
// 0x00E8 (0x00E8 - 0x0000)
struct FortHoagieVehicle_MulticastRotorImpulse final
{
public:
	struct FHitResult                             RotorHit;                                          // 0x0000(0x00E8)(ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.OnCritRotor
// 0x0038 (0x0038 - 0x0000)
struct FortHoagieVehicle_OnCritRotor final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ImpactLocation;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            DamageInstigator;                                  // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMainRotor;                                        // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HoagieRuntime.FortHoagieVehicle.OnImpactOtherHoagie
// 0x0030 (0x0030 - 0x0000)
struct FortHoagieVehicle_OnImpactOtherHoagie final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.OnRotorDamageDealt
// 0x00F0 (0x00F0 - 0x0000)
struct FortHoagieVehicle_OnRotorDamageDealt final
{
public:
	struct FHitResult                             Impact;                                            // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bInner;                                            // 0x00E8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HoagieRuntime.FortHoagieVehicle.OnRotorDamageDealtInner
// 0x00E8 (0x00E8 - 0x0000)
struct FortHoagieVehicle_OnRotorDamageDealtInner final
{
public:
	struct FHitResult                             Impact;                                            // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.OnRotorDamageDealtOuter
// 0x00E8 (0x00E8 - 0x0000)
struct FortHoagieVehicle_OnRotorDamageDealtOuter final
{
public:
	struct FHitResult                             Impact;                                            // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.OnRotorDamagePlayer
// 0x00E8 (0x00E8 - 0x0000)
struct FortHoagieVehicle_OnRotorDamagePlayer final
{
public:
	struct FHitResult                             Impact;                                            // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.OnTickRotors
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_OnTickRotors final
{
public:
	float                                         RotorAngleDegrees;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.ServerUpdateControlState
// 0x0030 (0x0030 - 0x0000)
struct FortHoagieVehicle_ServerUpdateControlState final
{
public:
	struct FReplicatedHeliControlState            InControlState;                                    // 0x0000(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.SetMainRotorRotation
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_SetMainRotorRotation final
{
public:
	float                                         Degrees;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.SetRotorWashActive
// 0x0001 (0x0001 - 0x0000)
struct FortHoagieVehicle_SetRotorWashActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.SetTailRotorRotation
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_SetTailRotorRotation final
{
public:
	float                                         Degrees;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.ShowCooldownCue
// 0x0010 (0x0010 - 0x0000)
struct FortHoagieVehicle_ShowCooldownCue final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HoagieRuntime.FortHoagieVehicle.UpdateDamageStateNative
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_UpdateDamageStateNative final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetAltitude
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetAltitude final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetBoostCooldown
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetBoostCooldown final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetBoostDirection
// 0x0018 (0x0018 - 0x0000)
struct FortHoagieVehicle_GetBoostDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetBoostDuration
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetBoostDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetBoostTimeLeft
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetBoostTimeLeft final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetDistanceToGround
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetDistanceToGround final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetForwardAlpha
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetForwardAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetIsEngineOn
// 0x0001 (0x0001 - 0x0000)
struct FortHoagieVehicle_GetIsEngineOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetLiftAlpha
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetLiftAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetMaxAltitude
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetMaxAltitude final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetMaxBoostCooldown
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetMaxBoostCooldown final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetRotorAngleDegrees
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetRotorAngleDegrees final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetRotorCenterPosition
// 0x0018 (0x0018 - 0x0000)
struct FortHoagieVehicle_GetRotorCenterPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetRotorSpeed
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetRotorSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetRotorSpeedPercent
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetRotorSpeedPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetShutdownTimeLeft
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetShutdownTimeLeft final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetSteerAlpha
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetSteerAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetStrafeAlpha
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetStrafeAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetThrustDirection
// 0x0020 (0x0020 - 0x0000)
struct FortHoagieVehicle_GetThrustDirection final
{
public:
	bool                                          bWorldSpace;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.GetVerticalSpeedKmh
// 0x0004 (0x0004 - 0x0000)
struct FortHoagieVehicle_GetVerticalSpeedKmh final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.IsScrapingBottom
// 0x0001 (0x0001 - 0x0000)
struct FortHoagieVehicle_IsScrapingBottom final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.IsShuttingDown
// 0x0001 (0x0001 - 0x0000)
struct FortHoagieVehicle_IsShuttingDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoagieRuntime.FortHoagieVehicle.IsStartingUp
// 0x0001 (0x0001 - 0x0000)
struct FortHoagieVehicle_IsStartingUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

