#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HoagieRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Enum HoagieRuntime.EHoagieBoostState
// NumValues: 0x0006
enum class EHoagieBoostState : uint8
{
	Unknown                                  = 0,
	Ready                                    = 1,
	Started                                  = 2,
	Finished                                 = 3,
	Failed                                   = 4,
	EHoagieBoostState_MAX                    = 5,
};

// Enum HoagieRuntime.EHoagieState
// NumValues: 0x000B
enum class EHoagieState : uint32
{
	STARTUP                                  = 0,
	STARTUP_LIFT                             = 1,
	FLIGHT                                   = 2,
	AUTO_LANDING                             = 3,
	SPIN_CRASHING                            = 4,
	CRASHING_NO_SPIN                         = 5,
	CRASH_LANDED                             = 6,
	LANDED                                   = 7,
	EXPLODING                                = 8,
	NONE                                     = 9,
	EHoagieState_MAX                         = 10,
};

// ScriptStruct HoagieRuntime.FortHeliFlightModel
// 0x01E8 (0x01E8 - 0x0000)
struct FFortHeliFlightModel final
{
public:
	uint8                                         Pad_0[0x1E0];                                      // 0x0000(0x01E0)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortHoagieVehicleConfigs*              Configs;                                           // 0x01E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct HoagieRuntime.RotorHit
// 0x0028 (0x0028 - 0x0000)
struct FRotorHit final
{
public:
	struct FActorInstanceHandle                   HitObjectHandle;                                   // 0x0000(0x0020)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastHitTimer;                                      // 0x0020(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct HoagieRuntime.CachedSeatCollision
// 0x0008 (0x0008 - 0x0000)
struct FCachedSeatCollision final
{
public:
	int32                                         SeatIndex;                                         // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOccupied;                                         // 0x0004(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct HoagieRuntime.ReplicatedHeliControlState
// 0x0030 (0x0030 - 0x0000)
struct FReplicatedHeliControlState final
{
public:
	struct FVector_NetQuantizeNormal              Up;                                                // 0x0000(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              Forward;                                           // 0x0018(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct HoagieRuntime.HoagieCmd
// 0x0078 (0x0078 - 0x0000)
struct alignas(0x08) FHoagieCmd final
{
public:
	uint8                                         Pad_0[0x78];                                       // 0x0000(0x0078)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct HoagieRuntime.HoagieInPersistent
// 0x0040 (0x01D0 - 0x0190)
struct FHoagieInPersistent final : public FFortVehicleInPersistent
{
public:
	class UFortHoagieVehicleConfigs*              FortHoagieVehicleConfigs;                          // 0x0190(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoagieState                                  CurrentHoagieState;                                // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastRotorImpulseTime;                              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RotorHitLinearImpulse;                             // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RotorHitAngularImpulse;                            // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct HoagieRuntime.HoagieInternal
// 0x01F0 (0x0270 - 0x0080)
struct FHoagieInternal final : public FFortVehicleInternalPersistent
{
public:
	struct FFortHeliFlightModel                   FlightModel;                                       // 0x0080(0x01E8)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct HoagieRuntime.HoagieOutContinuous
// 0x0000 (0x0038 - 0x0038)
struct FHoagieOutContinuous final : public FFortVehicleOutContinuous
{
};

// ScriptStruct HoagieRuntime.HoagieOutPersistent
// 0x0000 (0x0028 - 0x0028)
struct FHoagieOutPersistent final : public FFortVehicleOutPersistent
{
};

// ScriptStruct HoagieRuntime.HoagieDeathEffectInfo
// 0x0150 (0x0150 - 0x0000)
struct FHoagieDeathEffectInfo final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AFortPawn*                              InstigatedBy;                                      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0130(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0138(0x0018)(NativeAccessSpecifierPublic)
};

}

