#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ImagePlate

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ImagePlate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ImagePlate.ImagePlate
// 0x0008 (0x0298 - 0x0290)
class AImagePlate final : public AActor
{
public:
	class UImagePlateComponent*                   ImagePlate;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlate">();
	}
	static class AImagePlate* GetDefaultObj()
	{
		return GetDefaultObjImpl<AImagePlate>();
	}
};

// Class ImagePlate.ImagePlateComponent
// 0x0150 (0x06D0 - 0x0580)
class UImagePlateComponent final : public UPrimitiveComponent
{
public:
	struct FImagePlateParameters                  Plate;                                             // 0x0578(0x0040)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x118];                                    // 0x05B8(0x0118)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRenderTextureChanged();
	void SetImagePlate(const struct FImagePlateParameters& Plate_0);

	struct FImagePlateParameters GetPlate() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateComponent">();
	}
	static class UImagePlateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateComponent>();
	}
};

// Class ImagePlate.ImagePlateSettings
// 0x0010 (0x0038 - 0x0028)
class UImagePlateSettings final : public UObject
{
public:
	class FString                                 ProxyName;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateSettings">();
	}
	static class UImagePlateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateSettings>();
	}
};

// Class ImagePlate.ImagePlateFileSequence
// 0x0028 (0x0050 - 0x0028)
class UImagePlateFileSequence final : public UObject
{
public:
	struct FDirectoryPath                         SequencePath;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileWildcard;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrameRate;                                         // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateFileSequence">();
	}
	static class UImagePlateFileSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateFileSequence>();
	}
};

// Class ImagePlate.ImagePlateFrustumComponent
// 0x0000 (0x0580 - 0x0580)
class UImagePlateFrustumComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateFrustumComponent">();
	}
	static class UImagePlateFrustumComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateFrustumComponent>();
	}
};

}

