#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemizationCoreRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK
{

// Enum ItemizationCoreRuntime.EEquipItemLimitHitBehaviour
// NumValues: 0x0003
enum class EEquipItemLimitHitBehaviour : uint8
{
	UnequipLeastRecentlyUsed                 = 0,
	Block                                    = 1,
	EEquipItemLimitHitBehaviour_MAX          = 2,
};

// Enum ItemizationCoreRuntime.EItemState
// NumValues: 0x0005
enum class EItemState : uint8
{
	NotInInventory                           = 0,
	InInventory                              = 1,
	Equipped                                 = 2,
	NumStates                                = 3,
	EItemState_MAX                           = 4,
};

// Enum ItemizationCoreRuntime.EVkInventoryMoveResult
// NumValues: 0x0005
enum class EVkInventoryMoveResult : uint8
{
	Success                                  = 0,
	Failed                                   = 1,
	InvalidRequest                           = 2,
	NoChange                                 = 3,
	EVkInventoryMoveResult_MAX               = 4,
};

// Enum ItemizationCoreRuntime.EVkInventoryMoveBehaviour
// NumValues: 0x0003
enum class EVkInventoryMoveBehaviour : uint8
{
	SwapSlotNumber                           = 0,
	EmplaceSlotNumber                        = 1,
	EVkInventoryMoveBehaviour_MAX            = 2,
};

// Enum ItemizationCoreRuntime.EAttributeCombineLogic_Math
// NumValues: 0x0007
enum class EAttributeCombineLogic_Math : uint8
{
	MustMatch                                = 0,
	UseTarget                                = 1,
	Combine                                  = 2,
	Average                                  = 3,
	Highest                                  = 4,
	Lowest                                   = 5,
	EAttributeCombineLogic_MAX               = 6,
};

// Enum ItemizationCoreRuntime.EAttributeBasicCalculateLogic
// NumValues: 0x0004
enum class EAttributeBasicCalculateLogic : uint8
{
	ReturnFirstFound                         = 0,
	AddAllFound                              = 1,
	MultiplyAllFound                         = 2,
	EAttributeBasicCalculateLogic_MAX        = 3,
};

// Enum ItemizationCoreRuntime.EAttributeBasicFirstFoundLogic
// NumValues: 0x0003
enum class EAttributeBasicFirstFoundLogic : uint8
{
	PrioritizeItemEntry                      = 0,
	PrioritizeComponent                      = 1,
	EAttributeBasicFirstFoundLogic_MAX       = 2,
};

// Enum ItemizationCoreRuntime.EAttributeBasicNotFoundResult
// NumValues: 0x0003
enum class EAttributeBasicNotFoundResult : uint8
{
	ReturnInitial                            = 0,
	ReturnZero                               = 1,
	EAttributeBasicNotFoundResult_MAX        = 2,
};

// Enum ItemizationCoreRuntime.EAttributeApplicationRule
// NumValues: 0x0004
enum class EAttributeApplicationRule : uint8
{
	ItemEntryOnly                            = 0,
	ComponentOnly                            = 1,
	Anywhere                                 = 2,
	EAttributeApplicationRule_MAX            = 3,
};

// Enum ItemizationCoreRuntime.EItemStateFilter
// NumValues: 0x0004
enum class EItemStateFilter : uint32
{
	Always                                   = 0,
	Active                                   = 1,
	Inactive                                 = 2,
	EItemStateFilter_MAX                     = 3,
};

// ScriptStruct ItemizationCoreRuntime.EquipItemFilter
// 0x0018 (0x0018 - 0x0000)
struct FEquipItemFilter
{
public:
	bool                                          bAppliesToAllItems;                                // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TSoftObjectPtr<class UItemDefinitionBase>> ItemDefinitions;                               // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
};

// ScriptStruct ItemizationCoreRuntime.EquipItemRestriction
// 0x0010 (0x0028 - 0x0018)
struct FEquipItemRestriction final : public FEquipItemFilter
{
public:
	int64                                         ActiveLimit;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEquipItemLimitHitBehaviour                   LimitHitBehaviour;                                 // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ItemizationCoreRuntime.EquipItemCondition
// 0x0000 (0x0018 - 0x0018)
struct FEquipItemCondition final : public FEquipItemFilter
{
};

// ScriptStruct ItemizationCoreRuntime.ItemAggregatedData
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x08) FItemAggregatedData final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ItemizationCoreRuntime.VkAttributeValue
// 0x0028 (0x0028 - 0x0000)
struct FVkAttributeValue final
{
public:
	TSubclassOf<class UItemAttribute>             Attribute;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Data;                                              // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ItemizationCoreRuntime.VkAttributeEntry
// 0x0044 (0x0050 - 0x000C)
struct FVkAttributeEntry final : public FFastArraySerializerItem
{
public:
	struct FGuid                                  ItemEntryID;                                       // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVkAttributeValue                      AttributeValue;                                    // 0x0020(0x0028)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ItemizationCoreRuntime.VkAttributeList
// 0x01B8 (0x02C0 - 0x0108)
struct FVkAttributeList final : public FFastArraySerializer
{
public:
	TArray<struct FVkAttributeEntry>              AttributeList;                                     // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AInventoryCollection>    OwningInventoryCollection;                         // 0x0118(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UInventory>              OwningInventory;                                   // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x198];                                    // 0x0128(0x0198)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ItemizationCoreRuntime.ItemEntryStorageMap
// 0x0050 (0x0050 - 0x0000)
struct FItemEntryStorageMap final
{
public:
	TMap<struct FGuid, class UItemComponentLocalStorage*> ItemToStorageMap;                          // 0x0000(0x0050)(Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct ItemizationCoreRuntime.ItemComponentContainer
// 0x0010 (0x0010 - 0x0000)
struct FItemComponentContainer final
{
public:
	TArray<class UItemComponentBase*>             Components;                                        // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct ItemizationCoreRuntime.ItemEntry
// 0x002C (0x0038 - 0x000C)
struct FItemEntry final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UItemDefinitionBase*                    ItemDefinition;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  ItemEntryID;                                       // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SlotNumber;                                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0xC];                                       // 0x002C(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ItemizationCoreRuntime.ItemEntryList
// 0x01F0 (0x02F8 - 0x0108)
struct FItemEntryList final : public FFastArraySerializer
{
public:
	TArray<struct FItemEntry>                     ItemList;                                          // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x1E0];                                    // 0x0118(0x01E0)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ItemizationCoreRuntime.VkRarityEntry
// 0x0040 (0x0040 - 0x0000)
struct FVkRarityEntry final
{
public:
	class FText                                   Name;                                              // 0x0000(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0018(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ItemizationCoreRuntime.OverriddenRecord
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FOverriddenRecord final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

