#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemizationCoreRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ItemizationCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function ItemizationCoreRuntime.InventoryCheatManager.InventoryAddToItem
// 0x000C (0x000C - 0x0000)
struct InventoryCheatManager_InventoryAddToItem final
{
public:
	int32                                         InventoryIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountToAdd;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCheatManager.InventoryMoveItem
// 0x000C (0x000C - 0x0000)
struct InventoryCheatManager_InventoryMoveItem final
{
public:
	int32                                         SourceInventoryIndex;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetInventoryIndex;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCheatManager.InventoryRemoveFromItem
// 0x000C (0x000C - 0x0000)
struct InventoryCheatManager_InventoryRemoveFromItem final
{
public:
	int32                                         InventoryIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountToRemove;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.EquipItem
// 0x0014 (0x0014 - 0x0000)
struct InventoryCollection_EquipItem final
{
public:
	struct FGuid                                  ItemEntryID;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.InventoryCollection.UnequipItem
// 0x0014 (0x0014 - 0x0000)
struct InventoryCollection_UnequipItem final
{
public:
	struct FGuid                                  ItemEntryID;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.InventoryCollection.GetAllInventoriesInCollection
// 0x0018 (0x0018 - 0x0000)
struct InventoryCollection_GetAllInventoriesInCollection final
{
public:
	TArray<struct FGuid>                          OutInventoryIDList;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.InventoryCollection.GetAllItemsInInventory
// 0x0028 (0x0028 - 0x0000)
struct InventoryCollection_GetAllItemsInInventory final
{
public:
	struct FGuid                                  TargetInventoryID;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          OutItemEntryIDList;                                // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.InventoryCollection.GetInventoriesWithInventoryDefinition
// 0x0018 (0x0018 - 0x0000)
struct InventoryCollection_GetInventoriesWithInventoryDefinition final
{
public:
	const class UInventoryDefinition*             InventoryDefinition;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.GetInventoryDefinition
// 0x0018 (0x0018 - 0x0000)
struct InventoryCollection_GetInventoryDefinition final
{
public:
	struct FGuid                                  TargetInventoryID;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInventoryDefinition*             ReturnValue;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.GetInventoryName
// 0x0028 (0x0028 - 0x0000)
struct InventoryCollection_GetInventoryName final
{
public:
	struct FGuid                                  TargetInventoryID;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.GetItemAmount
// 0x0010 (0x0010 - 0x0000)
struct InventoryCollection_GetItemAmount final
{
public:
	const class UItemDefinitionBase*              ItemDefinition;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.GetItemAmountFromInventory
// 0x0020 (0x0020 - 0x0000)
struct InventoryCollection_GetItemAmountFromInventory final
{
public:
	const class UItemDefinitionBase*              ItemDefinition;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  TargetInventoryID;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.GetItemDefinition
// 0x0028 (0x0028 - 0x0000)
struct InventoryCollection_GetItemDefinition final
{
public:
	struct FGuid                                  TargetInventoryID;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ItemEntryID;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.GetItemIntAttribute
// 0x0030 (0x0030 - 0x0000)
struct InventoryCollection_GetItemIntAttribute final
{
public:
	struct FGuid                                  TargetInventoryID;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ItemEntryID;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemAttribute_Int>         Attribute;                                         // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.GetItemSlotNumber
// 0x0024 (0x0024 - 0x0000)
struct InventoryCollection_GetItemSlotNumber final
{
public:
	struct FGuid                                  TargetInventoryID;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ItemEntryID;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryCollection.IsItemEquipped
// 0x0014 (0x0014 - 0x0000)
struct InventoryCollection_IsItemEquipped final
{
public:
	struct FGuid                                  ItemEntryID;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.ItemAttribute.GetAttributeDescription
// 0x0018 (0x0018 - 0x0000)
struct ItemAttribute_GetAttributeDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemAttribute.GetAttributeName
// 0x0018 (0x0018 - 0x0000)
struct ItemAttribute_GetAttributeName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_Core.GetItemRarityTable
// 0x0008 (0x0008 - 0x0000)
struct ItemComponent_Core_GetItemRarityTable final
{
public:
	class UItemRarityTable*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_Core.GetItemType
// 0x0008 (0x0008 - 0x0000)
struct ItemComponent_Core_GetItemType final
{
public:
	class UItemType*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_DisplayUI.GetItemDescription
// 0x0018 (0x0018 - 0x0000)
struct ItemComponent_DisplayUI_GetItemDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_DisplayUI.GetItemIcon
// 0x0020 (0x0020 - 0x0000)
struct ItemComponent_DisplayUI_GetItemIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_DisplayUI.GetItemMaterial
// 0x0020 (0x0020 - 0x0000)
struct ItemComponent_DisplayUI_GetItemMaterial final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_DisplayUI.GetItemName
// 0x0018 (0x0018 - 0x0000)
struct ItemComponent_DisplayUI_GetItemName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_DisplayUI.GetMaterialTextureParameter
// 0x0004 (0x0004 - 0x0000)
struct ItemComponent_DisplayUI_GetMaterialTextureParameter final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemComponent_DisplayUI.GetSmallItemIcon
// 0x0020 (0x0020 - 0x0000)
struct ItemComponent_DisplayUI_GetSmallItemIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemDefinitionBase.GetItemComponentByClass
// 0x0010 (0x0010 - 0x0000)
struct ItemDefinitionBase_GetItemComponentByClass final
{
public:
	TSubclassOf<class UItemComponentBase>         ItemComponentClass;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UItemComponentBase*               ReturnValue;                                       // 0x0008(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.DescribeInventoryID
// 0x0020 (0x0020 - 0x0000)
struct ItemizationFunctionLibrary_DescribeInventoryID final
{
public:
	struct FGuid                                  InventoryID;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.DescribeItemEntryID
// 0x0020 (0x0020 - 0x0000)
struct ItemizationFunctionLibrary_DescribeItemEntryID final
{
public:
	struct FGuid                                  ItemEntryID;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataAttributeList
// 0x0080 (0x0080 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataAttributeList final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UItemAttribute>>     ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataBoolAttributeValue
// 0x0080 (0x0080 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataBoolAttributeValue final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemAttribute_Bool>        AttributeClass;                                    // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataDecimalAttributeValue
// 0x0080 (0x0080 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataDecimalAttributeValue final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemAttribute_Decimal>     AttributeClass;                                    // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataDefinition
// 0x0078 (0x0078 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataDefinition final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0070(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataIntAttributeValue
// 0x0080 (0x0080 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataIntAttributeValue final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemAttribute_Int>         AttributeClass;                                    // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataItemEntryID
// 0x0080 (0x0080 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataItemEntryID final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataSlot
// 0x0078 (0x0078 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataSlot final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.ItemizationFunctionLibrary.GetItemDataStringAttributeValue
// 0x0088 (0x0088 - 0x0000)
struct ItemizationFunctionLibrary_GetItemDataStringAttributeValue final
{
public:
	struct FItemAggregatedData                    ItemData;                                          // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemAttribute_String>      AttributeClass;                                    // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0078(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.ItemizationPickupFunctionLibrary.SpawnItemPickupInWorld
// 0x0038 (0x0038 - 0x0000)
struct ItemizationPickupFunctionLibrary_SpawnItemPickupInWorld final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AItemPickup>                ItemPickupClass;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UItemDefinitionBase*                    ItemDefinition;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InPosition;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AItemPickup*                            ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryComponent.AddItem
// 0x0010 (0x0010 - 0x0000)
struct InventoryComponent_AddItem final
{
public:
	class UItemDefinitionBase*                    ItemDefinition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ItemizationCoreRuntime.InventoryComponent.AddOrResetInventory
// 0x0008 (0x0008 - 0x0000)
struct InventoryComponent_AddOrResetInventory final
{
public:
	class UInventoryDefinition*                   NewInventoryDefinition;                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreRuntime.InventoryComponent.GetInventoryCollection
// 0x0008 (0x0008 - 0x0000)
struct InventoryComponent_GetInventoryCollection final
{
public:
	class AInventoryCollection*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

