#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FortniteAI_classes.hpp"
#include "WorldConditions_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "GameplayGraph_structs.hpp"
#include "GameplayEventRouter_structs.hpp"


namespace SDK
{

// Class JunoGameNative.JunoAlterationCraftingComponent
// 0x0028 (0x00C8 - 0x00A0)
class UJunoAlterationCraftingComponent final : public UGameFrameworkComponent
{
public:
	TWeakObjectPtr<class UCraftingObjectComponent> CachedCraftingObjectComponent;                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              WeaponEssenceDataTable;                            // 0x00A8(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCraftingStateChanged(const struct FCraftingObjectStateChangedEvent& Event);
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAlterationCraftingComponent">();
	}
	static class UJunoAlterationCraftingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAlterationCraftingComponent>();
	}
};

// Class JunoGameNative.JunoAsyncAction_WaitForEventRouter
// 0x0030 (0x0060 - 0x0030)
class UJunoAsyncAction_WaitForEventRouter final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UGameplayEventRouterComponent* EventRouter)> OnGameplayEventRouterAvailable; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UJunoAsyncAction_WaitForEventRouter* WaitForEventRouter(class AActor* ContextActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAsyncAction_WaitForEventRouter">();
	}
	static class UJunoAsyncAction_WaitForEventRouter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAsyncAction_WaitForEventRouter>();
	}
};

// Class JunoGameNative.JunoBuilderToolSelectedActorInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoBuilderToolSelectedActorInterface final
{
public:
	void ReceiveSelectionSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior, const struct FJunoBuilderToolSelectionSpawnParams& SelectionSpawnParameters);
	void ReceiveSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuilderToolSelectedActorInterface">();
	}
	static class IJunoBuilderToolSelectedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoBuilderToolSelectedActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class JunoGameNative.JunoBuildingConnectivityBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoBuildingConnectivityBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DebugDrawConnectionLocations(const class UObject* WorldContextObject, const struct FJunoBuildingConnection& Connection);
	static void DebugDrawConnections(const class UObject* WorldContextObject, const struct FJunoBuildingConnectionPointsResult& Candidates, const struct FJunoBuildingConnectionPointsResult& Targets, const struct FJunoBuildingConnection& ChosenConnection, const TArray<struct FJunoBuildingConnection>& Connections);
	static TArray<class UAtomModelAssetUserData*> GetAtomModelAssetUserData(const class UObject* Object);
	static TArray<struct FJunoBuildingConnectionPoint> GetKnobs(const struct FJunoBuildingConnectionPointsResult& Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingConnectivityBlueprintLibrary">();
	}
	static class UJunoBuildingConnectivityBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingConnectivityBlueprintLibrary>();
	}
};

// Class JunoGameNative.JunoCampActor
// 0x00A0 (0x0330 - 0x0290)
class AJunoCampActor final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnCampCenterAssigned;                              // 0x0298(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCampCenterRemoved;                               // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x58];                                     // 0x02B8(0x0058)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x0310(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UOverlapComponent*                      BoundsComponent;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCampActor">();
	}
	static class AJunoCampActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoCampActor>();
	}
};

// Class JunoGameNative.JunoCampCenterComponent
// 0x0078 (0x0118 - 0x00A0)
class UJunoCampCenterComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(const struct FJunoAwesomeLevelChangeData& ChangeData)> OnJunoCampAwesomeLevelChangedDelegate; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FJunoAwesomePointModificationData& ModificationData)> OnJunoCampAwesomePointModificationDelegate; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x30];                                      // 0x00C8(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class AJunoCampActor>             CampActorClassToSpawn;                             // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CampCenterDestructionDeathReasonTag;               // 0x0100(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AJunoCampActor*                         CampActor;                                         // 0x0108(0x0008)(Net, ZeroConstructor, SaveGame, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleSmartObjectEvent(const struct FSmartObjectEventData& SmartObjectEventData, const class AActor* Actor);
	void NotifyOwnerPlacedByBuilderTool();
	void OnCampAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& ChangeData);
	void OnCampAwesomePointModification(const struct FJunoAwesomePointModificationData& ModificationData);
	void OnPersistentPlayspaceDataLoadEnd(class AJunoPersistentPlayspace* PersistentPlayspace, const bool bSuccess);
	void OnRep_CampActor();

	class AJunoCampActor* GetCampActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCampCenterComponent">();
	}
	static class UJunoCampCenterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCampCenterComponent>();
	}
};

// Class JunoGameNative.JunoCampMembershipActorComponent
// 0x0090 (0x0170 - 0x00E0)
class UJunoCampMembershipActorComponent final : public UFortAthenaTrackableAIObjectComponent
{
public:
	TMulticastInlineDelegate<void(class AJunoCampActor* NewlyBoundCamp)> OnJunoCampMembershipChanged; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class AJunoCampActor>          BoundCamp;                                         // 0x0108(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x38];                                     // 0x0110(0x0038)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         ToleranceForMovementUpdates;                       // 0x0148(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UActorComponent* FindBindableLocalCampAtLocationAndReturnComponent(TSubclassOf<class UActorComponent> ComponentClass, const class UObject* WorldContextObject, const struct FVector& Location);
	static class AJunoCampActor* FindBindableLocalCampForActor(const class AActor* Actor);
	static class UActorComponent* FindBindableLocalCampForActorAndReturnComponent(TSubclassOf<class UActorComponent> ComponentClass, const class AActor* Actor);
	static class AJunoCampActor* FindBindableLocalCampForArea(const class AActor* Actor, const struct FBox& AreaBox);
	static class AJunoCampActor* FindBindableLocalCampForLocation(const class UObject* WorldContextObject, const struct FVector& Location);
	static class UJunoCampMembershipActorComponent* FindCampMembershipActorComponentOnActor(const class AActor* Owner);
	static class UActorComponent* FindCampMembershipComponentAndReturnComponent(TSubclassOf<class UActorComponent> ComponentClass, const class AActor* Owner);
	static class UJunoCampMembershipActorComponent* FindOrCreateCampMembershipActorComponentOnActor(const class AActor* Owner);
	static class UActorComponent* FindOrCreateCampMembershipComponentAndReturnComponent(TSubclassOf<class UActorComponent> ComponentClass, const class AActor* Owner);
	static bool HasCampAtBounds(const class UObject* WorldContextObject, const struct FBox& Bounds);
	static bool HasCampAtLocation(const class UObject* WorldContextObject, const struct FVector& Location);

	void AttemptToBindToCamp();
	void HandleAddedIntoClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);
	void HandleBoundCampEndPlayEvent(class AActor* InOwner, EEndPlayReason EndPlayReason);
	void HandleRemovedFromClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);
	void OnRep_BoundCamp();

	class AJunoCampActor* GetBoundCamp() const;
	class UActorComponent* GetBoundComponent(TSubclassOf<class UActorComponent> ComponentClass) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCampMembershipActorComponent">();
	}
	static class UJunoCampMembershipActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCampMembershipActorComponent>();
	}
};

// Class JunoGameNative.JunoCampRecruitmentObjectComponent
// 0x00B0 (0x0150 - 0x00A0)
class UJunoCampRecruitmentObjectComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(const struct FJunoRecruitmentObjectAssignedData& AssignedData)> OnJunoRecruitmentObjectAssignedChangedDelegate; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(bool bEnabled)> OnJunoRecruitmentObjectEnableChangeDelegate;       // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	bool                                          bIsEnabled;                                        // 0x00E0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoRecruitmentObjectAssignedData     AssignedData;                                      // 0x00E8(0x0050)(Net, SaveGame, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x18];                                     // 0x0138(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AssignToPlayer(const class AFortPlayerController* PlayerController, const bool bCheckForDuplicateRecruitmentObjects);
	void HandleOnEmptyRecrutmentObjectInteracted(class AFortPlayerController* InteractingController);
	void OnRep_AssignedData();
	void OnRep_bIsEnabled();

	bool CostlyFindAssignableNPCs(TArray<struct FGameplayTag>* OutAssignableNPCs) const;
	const struct FJunoRecruitmentObjectAssignedData GetAssignedData() const;
	bool IsAssignedToAI() const;
	bool IsAssignedToPlayer() const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCampRecruitmentObjectComponent">();
	}
	static class UJunoCampRecruitmentObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCampRecruitmentObjectComponent>();
	}
};

// Class JunoGameNative.JunoEventLimiterInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoEventLimiterInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoEventLimiterInterface">();
	}
	static class IJunoEventLimiterInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoEventLimiterInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class JunoGameNative.JunoEventRouterLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoEventRouterLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UGameplayEventRouterComponent* GetGameplayEventRouter(class AActor* ContextActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoEventRouterLibrary">();
	}
	static class UJunoEventRouterLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoEventRouterLibrary>();
	}
};

// Class JunoGameNative.JunoGameStateWeatherComponent
// 0x0020 (0x00C0 - 0x00A0)
class UJunoGameStateWeatherComponent final : public UGameStateComponent
{
public:
	class UDataTable*                             SeasonTable;                                       // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UJunoWeatherStateComponent> LocalizedWeatherStateSubclass;                     // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UJunoPlayspacePersistenceFeatureHelper* WeatherPersistenceFeatureHelper;                   // 0x00B8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UJunoWeatherStateComponent* FindWeatherState(const struct FJunoWeatherLocation& Location);
	void ForceWeatherState(class FName NewWeatherType, class FName OptionalLocation);
	void HandleWeatherStatesSetup(const TArray<class UJunoWeatherStateComponent*>& WeatherStates);
	void SetAutoTransitioning(bool bAutoTransitionWeather);
	void TransitionWeatherNow(class FName OptionalLocation);
	void TransitionWeatherNowTo(const struct FJunoWeatherPhase& NewWeatherPhase, const struct FJunoWeatherPhase& NewNextWeatherPhase, const struct FJunoWeatherLocation& OptionalLocation);

	TArray<class UJunoWeatherStateComponent*> GetWeatherStates() const;
	bool IsAutoTransitioning() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoGameStateWeatherComponent">();
	}
	static class UJunoGameStateWeatherComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoGameStateWeatherComponent>();
	}
};

// Class JunoGameNative.JunoGeometryCollectionAssemblerComponent
// 0x0158 (0x01F8 - 0x00A0)
class UJunoGeometryCollectionAssemblerComponent final : public UActorComponent
{
public:
	float                                         AssemblyRatioInterpSpeed;                          // 0x00A0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         TimeToAssemble;                                    // 0x00A8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SingleGeometryTimeToAssemble;                      // 0x00D0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DisassembledZDistance;                             // 0x00F8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DisassembledZDistanceRandomRatio;                  // 0x0120(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DisassembledRotationAmount;                        // 0x0148(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bFreeMemoryWhenNotAnimating;                       // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class UGeometryCollectionComponent*, struct FJunoGeometryCollectionAssemblerGCInfo> GeometryCollectionInfos; // 0x0178(0x0050)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnAssemblyStart;                                   // 0x01C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnAssemblyEnd;                                     // 0x01D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	float                                         CurrentAssemblyRatio;                              // 0x01E8(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1EC[0xC];                                      // 0x01EC(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_CurrentAssemblyRatio();
	void SetFreeMemoryWhenNotAnimating(bool bValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoGeometryCollectionAssemblerComponent">();
	}
	static class UJunoGeometryCollectionAssemblerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoGeometryCollectionAssemblerComponent>();
	}
};

// Class JunoGameNative.JunoMapManagerComponent
// 0x0178 (0x0270 - 0x00F8)
class UJunoMapManagerComponent final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ExploredRadius;                                    // 0x0100(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     MapMaterial;                                       // 0x0108(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>       MapMaterialMID;                                    // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMapExplorationData                    MapExplorationData;                                // 0x0128(0x0118)(Net, RepNotify, NativeAccessSpecifierPrivate)
	TArray<int32>                                 CurrentExploredTiles;                              // 0x0240(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FJunoTileInfo>                  LoadedTiles;                                       // 0x0250(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UTexture2D*                             ClearedFogMask;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMaterialInstanceDynamic* GetMapMaterialMID(const int32 TileIdx);
	void OnRep_MapExplorationData();

	class UTexture2D* GetFOWForTile(const int32 TileId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMapManagerComponent">();
	}
	static class UJunoMapManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMapManagerComponent>();
	}
};

// Class JunoGameNative.JunoPassiveCraftingComponent
// 0x0048 (0x00E8 - 0x00A0)
class UJunoPassiveCraftingComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class AActor* PassiveCraftingObject, const class FName& FormulaRowName, EPassiveCraftingDoneReason Reason)> OnPassiveCraftingDone; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UJunoInventoryComponent> CachedInventoryComponent;                          // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UCraftingObjectComponent> CachedCraftingObjectComponent;                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsAutoCrafting;                                   // 0x00C8(0x0001)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   AutoCraftingFormulaRow;                            // 0x00CC(0x0004)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDateTime                              AutoCraftingStartDateTime;                         // 0x00D8(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void DisableAutoCrafting();
	void EnableAutoCrafting();
	void HandleCraftingStateChanged(const struct FCraftingObjectStateChangedEvent& Event);
	void HandleInventoryDataRestored();
	void MulticastFireCraftingDone(EPassiveCraftingDoneReason Reason);
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);
	void SetAutoCraftRecipe(class FName FormulaRow);

	int32 CalculateNumRemainingAutoCraft(class FName OptionalFormulaRow) const;
	class FName GetAutoCraftingFormulaRow() const;
	bool IsAutoCrafting() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPassiveCraftingComponent">();
	}
	static class UJunoPassiveCraftingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPassiveCraftingComponent>();
	}
};

// Class JunoGameNative.JunoPassiveResourcesGatheringWorldConditionSchema
// 0x0010 (0x0048 - 0x0038)
class UJunoPassiveResourcesGatheringWorldConditionSchema final : public UWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPassiveResourcesGatheringWorldConditionSchema">();
	}
	static class UJunoPassiveResourcesGatheringWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPassiveResourcesGatheringWorldConditionSchema>();
	}
};

// Class JunoGameNative.JunoPassiveResourcesGatheringComponent
// 0x00D8 (0x0178 - 0x00A0)
class UJunoPassiveResourcesGatheringComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPassiveResourcesGatheringRowRuntime> ActiveGatheringRows;                         // 0x00C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class AActor* GeneratingActor, int32 GeneratedItemsCount, bool bIsRuntime)> OnPassiveResourceGeneratedDelegate; // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x28];                                      // 0x00E8(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagQuery                      MatchingRolesQuery;                                // 0x0110(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FDataTableRowHandle>            GatheringRows;                                     // 0x0158(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    SimulationConfigurationRow;                        // 0x0168(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	bool OverrideGatheringRow(const struct FDataTableRowHandle& GatheringRow);
	void RemoveGatheringRowOverride();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPassiveResourcesGatheringComponent">();
	}
	static class UJunoPassiveResourcesGatheringComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPassiveResourcesGatheringComponent>();
	}
};

// Class JunoGameNative.JunoPersistenceFeatureData
// 0x0000 (0x0000 - 0x0000)
class IJunoPersistenceFeatureData final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceFeatureData">();
	}
	static class IJunoPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoPersistenceFeatureData>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class JunoGameNative.JunoPlayerBuildingComponent
// 0x03B8 (0x0460 - 0x00A8)
class UJunoPlayerBuildingComponent final : public UFortControllerComponent
{
public:
	struct FJunoSelectedSlot                      ReplicatedSelectedSlot;                            // 0x00A8(0x000C)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x14];                                      // 0x00B4(0x0014)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoBuildingSlotDataArray             BuildBars[0x2];                                    // 0x00C8(0x0138)(Net, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AJunoGuidedBuildingActor> LastGuidedBuildingActor;                          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AJunoGuidedBuildingActor> ReplicatedLastGuidedBuildingActor;                // 0x0340(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReplicateLastGuidedActorTime;                      // 0x0348(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputPrio;                                         // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortInputMappingContext*               InputMappingContext;                               // 0x0350(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           NextSlot;                                          // 0x0358(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           PrevSlot;                                          // 0x0360(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           ExitBuildMode;                                     // 0x0368(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           PinItem;                                           // 0x0370(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInputAction*>                   BuildBarBindings;                                  // 0x0378(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FDataTableRowHandle>            DefaultRecipes;                                    // 0x0388(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxRecentRecipes;                                  // 0x0398(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39C[0xBC];                                     // 0x039C(0x00BC)(Fixing Size After Last Property [ Dumper-8 ])
	class UJunoAsyncAction_WaitForEventRouter*    WaitForEventRouterAction;                          // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EnterBuildingModeAndSelectIndex(int32 Index_0, EJunoBuildModeType InType);
	void EnterGuidedBuilding(class AJunoGuidedBuildingActor* InLastGuidedBuildingActor);
	void OnGuidedBuildDone(const struct FGuidedBuildingUpdate& StageUpdate);
	void OnGuidedBuildingStageChanged(const struct FGuidedBuildingUpdate& StageUpdate);
	void OnRep_ReplicatedLastGuidedBuildingActor();
	void OnRep_ReplicatedSelectedSlot();
	void OnRep_ReplicateLastGuidedActorTime();
	void ServerSelectSlot(const struct FJunoSelectedSlot& NewSlot);
	void ServerSetLastGuidedBuildingActor(class AJunoGuidedBuildingActor* InLastActor);
	void ServerSetRecipeAtIndex(const struct FJunoSlotIndex& NewSlot, class FName RecipeName);
	void SetLastGuidedBuildingActor(class AJunoGuidedBuildingActor* InLastGuidedBuildingActor);
	void SetRecipeAtIndex(int32 InIndex, class FName RecipeName, const EJunoBuildModeType ModeType);

	EJunoBuildModeType GetBuildModeType() const;
	class FName GetCurrentRecipe() const;
	class FName GetForcedRecipe() const;
	bool GetIsInBuildMode() const;
	class FName GetLastFocusedRecipe() const;
	const class AJunoGuidedBuildingActor* GetLastGuidedBuildingActor() const;
	class FName GetLastLoadedRecipe() const;
	const struct FJunoLastLoadedRecipeData GetLastLoadedRecipeData() const;
	int32 GetSelectedSlotIndex(EJunoBuildModeType InType) const;
	struct FJunoBuildingSlotData GetSlotData(int32 Index_0, EJunoBuildModeType InType) const;
	bool IsBuildModeEnabled() const;
	bool IsRecipePinned(class FName Recipe) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerBuildingComponent">();
	}
	static class UJunoPlayerBuildingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerBuildingComponent>();
	}
};

// Class JunoGameNative.JunoPlayerCampPawnComponent
// 0x0020 (0x00C0 - 0x00A0)
class UJunoPlayerCampPawnComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& ChangeData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerCampPawnComponent">();
	}
	static class UJunoPlayerCampPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerCampPawnComponent>();
	}
};

// Class JunoGameNative.JunoPlayspacePersistenceFeatureHelper
// 0x0028 (0x0050 - 0x0028)
class UJunoPlayspacePersistenceFeatureHelper final : public UObject
{
public:
	TSubclassOf<class UObject>                    PersistenceFeatureDataClass;                       // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IJunoPersistenceFeatureData> PersistenceFeatureData;                      // 0x0030(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayspacePersistenceFeatureHelper">();
	}
	static class UJunoPlayspacePersistenceFeatureHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayspacePersistenceFeatureHelper>();
	}
};

// Class JunoGameNative.JunoSmartObjectComponent
// 0x0010 (0x0380 - 0x0370)
class UJunoSmartObjectComponent final : public UFortSmartObjectComponent
{
public:
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            LootTierPercentageToSlotPickingModifier;           // 0x0378(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleAddedIntoClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);
	void HandleRemovedFromClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSmartObjectComponent">();
	}
	static class UJunoSmartObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSmartObjectComponent>();
	}
};

// Class JunoGameNative.JunoSyncTimeOfDayComponent
// 0x0008 (0x00A8 - 0x00A0)
class UJunoSyncTimeOfDayComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTimeOfDaySyncEnabled(bool bNewTimeOfDaySyncEnabled);

	bool GetTimeOfDaySyncEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSyncTimeOfDayComponent">();
	}
	static class UJunoSyncTimeOfDayComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSyncTimeOfDayComponent>();
	}
};

// Class JunoGameNative.JunoTeamStart
// 0x0000 (0x02C0 - 0x02C0)
class AJunoTeamStart final : public APlayerStart
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTeamStart">();
	}
	static class AJunoTeamStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoTeamStart>();
	}
};

// Class JunoGameNative.JunoTemperatureAttributeSet
// 0x00C0 (0x00F0 - 0x0030)
class UJunoTemperatureAttributeSet final : public UFortAttributeSet
{
public:
	struct FFortGameplayAttributeData             Temperature;                                       // 0x0030(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FFortGameplayAttributeData             ColdResistance;                                    // 0x0058(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FFortGameplayAttributeData             HeatResistance;                                    // 0x0080(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           CurrentTemperature;                                // 0x00A8(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FTemperatureRange>              TemperatureRanges;                                 // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FJunoTemperatureChangedEvent& TemperatureChangedEventPayload)> OnTemperatureChanged; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FJunoTemperatureRangesChangedEvent& TemperatureRangesChangedEventPayload)> OnTemperatureRangesChanged; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bAddTemperatureTagToActor;                         // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           ForcedTemperature;                                 // 0x00E4(0x0004)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ForceTemperature(const struct FGameplayTag& TemperatureToForce);
	void HandleWeatherTemperatureChanged(const struct FJunoEvent_TemperatureChanged& Payload);
	void OnRep_ColdResistance(const struct FFortGameplayAttributeData& OldValue);
	void OnRep_CurrentTemperature(const struct FGameplayTag& OldTemperature);
	void OnRep_HeatResistance(const struct FFortGameplayAttributeData& OldValue);
	void OnRep_Temperature(const struct FFortGameplayAttributeData& OldValue);
	void OnRep_TemperatureRanges();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTemperatureAttributeSet">();
	}
	static class UJunoTemperatureAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTemperatureAttributeSet>();
	}
};

// Class JunoGameNative.JunoWeaponAbility
// 0x0000 (0x0B60 - 0x0B60)
class UJunoWeaponAbility final : public UFortGameplayAbility
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWeaponAbility">();
	}
	static class UJunoWeaponAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWeaponAbility>();
	}
};

// Class JunoGameNative.JunoWeatherLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoWeatherLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FJunoWeatherLocation CalculateLocation(class AActor* Actor);
	static class FString DescribeLocation(const struct FJunoWeatherLocation& WeatherLocation);
	static class FString DescribePhase(const struct FJunoWeatherPhase& WeatherPhase);
	static bool EqualEqual_JunoWeatherLocation(const struct FJunoWeatherLocation& A, const struct FJunoWeatherLocation& B);
	static class UJunoGameStateWeatherComponent* FindGameStateWeatherComponent(const class UObject* WorldContextObject);
	static bool IsJunoWeatherLocationValid(const struct FJunoWeatherLocation& JunoWeatherLocation);
	static bool NotEqual_JunoWeatherLocation(const struct FJunoWeatherLocation& A, const struct FJunoWeatherLocation& B);
	static struct FJunoWeatherPhase RollWeatherFromForecast(const struct FJunoWeatherPhaseForecast& Forecast);
	static struct FJunoWeatherPhase RollWeatherFromSeason(const struct FJunoWeatherSeasonRow& Season, const struct FJunoWeatherLocation& Location, const struct FGameplayTag& OptionalWeatherType);
	static struct FJunoWeatherLocation StringToLocation(class FName LocationName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWeatherLibrary">();
	}
	static class UJunoWeatherLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWeatherLibrary>();
	}
};

// Class JunoGameNative.JunoWeatherLocationComponent
// 0x0018 (0x00B8 - 0x00A0)
class UJunoWeatherLocationComponent : public UGameFrameworkComponent
{
public:
	TMulticastInlineDelegate<void(const struct FJunoWeatherLocationChangedEvent& Event)> OnLocationChanged; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   Location;                                          // 0x00B0(0x0001)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleLocationChanged();
	void OnRep_Location(const struct FJunoWeatherLocation& OldLocation);

	struct FJunoWeatherLocation BP_CalculateLocation() const;
	const struct FJunoWeatherLocation GetLocation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWeatherLocationComponent">();
	}
	static class UJunoWeatherLocationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWeatherLocationComponent>();
	}
};

// Class JunoGameNative.JunoWeatherReactionComponent
// 0x0028 (0x00C8 - 0x00A0)
class UJunoWeatherReactionComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const struct FJunoEvent_WeatherPhaseChanged& Payload)> OnWeatherPhaseChanged; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FJunoEvent_TemperatureChanged& Payload)> OnTemperatureChanged; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleWeatherLocationChanged(const struct FJunoWeatherLocationChangedEvent& Payload);
	void ReceiveOnTemperatureChanged(const struct FJunoEvent_TemperatureChanged& Payload);
	void ReceiveOnWeatherPhaseChanged(const struct FJunoEvent_WeatherPhaseChanged& Payload);

	class UJunoWeatherStateComponent* FindWeatherState() const;
	struct FGameplayTag GetCurrentTemperature() const;
	float GetCurrentTemperatureFloat() const;
	struct FJunoWeatherPhase GetCurrentWeatherPhase() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWeatherReactionComponent">();
	}
	static class UJunoWeatherReactionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWeatherReactionComponent>();
	}
};

// Class JunoGameNative.JunoWeatherStateComponent
// 0x00B8 (0x0158 - 0x00A0)
class UJunoWeatherStateComponent final : public UGameFrameworkComponent
{
public:
	struct FJunoWeatherLocation                   Location;                                          // 0x00A0(0x0001)(Edit, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDataTable*                             SeasonTable;                                       // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoWeatherPhase                      CurrentWeatherPhase;                               // 0x00B8(0x0038)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct FJunoWeatherPhase                      NextWeatherPhase;                                  // 0x00F0(0x0038)(Net, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FJunoWeatherPhase>              NextWeatherQueue;                                  // 0x0128(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x20];                                     // 0x0138(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ClearNextWeatherQueue();
	void ForceNextWeatherTo(const struct FJunoWeatherPhase& NewNextWeatherPhase);
	void OnRep_CurrentWeatherPhase();
	void QueueNextWeather(const struct FJunoWeatherPhase& QueuedWeather);
	void ReceiveTemperatureChanged(const struct FJunoEvent_TemperatureChanged& Payload);
	void ReceiveWeatherPhaseChanged(const struct FJunoEvent_WeatherPhaseChanged& Payload);
	void RerollNextWeatherWith(const struct FGameplayTag& WeatherTypeName);
	void SetAutoTransitioning(bool bAutoTransitionWeather);
	void TransitionWeatherNow();
	void TransitionWeatherNowTo(const struct FJunoWeatherPhase& NewWeatherPhase, const struct FJunoWeatherPhase& NewNextWeatherPhase);

	struct FGameplayTag GetCurrentSeason() const;
	struct FGameplayTag GetCurrentTemperature() const;
	float GetCurrentTemperatureFloat() const;
	const struct FJunoWeatherPhase GetCurrentWeatherPhase() const;
	const struct FJunoWeatherLocation GetLocation() const;
	const struct FJunoWeatherPhase GetNextWeatherPhase() const;
	TArray<struct FJunoWeatherPhase> GetNextWeatherQueue() const;
	float GetTransitionInAlpha() const;
	float GetTransitionOutAlpha() const;
	bool IsAutoTransitioning() const;
	struct FJunoWeatherPhase RollWeatherPhase() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWeatherStateComponent">();
	}
	static class UJunoWeatherStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWeatherStateComponent>();
	}
};

// Class JunoGameNative.JunoAINavInvokerComponent
// 0x0000 (0x00B0 - 0x00B0)
class UJunoAINavInvokerComponent final : public UNavigationInvokerComponent
{
public:
	void OnNPCPossessed(class APawn* Pawn);
	void OnPlayerPossessed(class APawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAINavInvokerComponent">();
	}
	static class UJunoAINavInvokerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAINavInvokerComponent>();
	}
};

// Class JunoGameNative.JunoNavSystemConfig
// 0x0000 (0x00B8 - 0x00B8)
class UJunoNavSystemConfig final : public UAthenaNavSystemConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoNavSystemConfig">();
	}
	static class UJunoNavSystemConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoNavSystemConfig>();
	}
};

// Class JunoGameNative.JunoAnimInstance
// 0x0010 (0x0450 - 0x0440)
#pragma pack(push, 0x1)
class alignas(0x10) UJunoAnimInstance : public UFortBaseAnimInstance
{
public:
	uint8                                         Pad_438[0x10];                                     // 0x0438(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimInstance">();
	}
	static class UJunoAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimInstance>();
	}
};
#pragma pack(pop)

// Class JunoGameNative.JunoGliderAnimInstance
// 0x0000 (0x0810 - 0x0810)
class UJunoGliderAnimInstance final : public UFortGliderAnimInstance
{
public:
	uint8                                         bIsSkydiving : 1;                                  // 0x0808(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsParachuteOpen : 1;                              // 0x0808(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_809[0x7];                                      // 0x0809(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoGliderAnimInstance">();
	}
	static class UJunoGliderAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoGliderAnimInstance>();
	}
};

// Class JunoGameNative.JunoPawnAnimInstance
// 0x00B0 (0x0500 - 0x0450)
#pragma pack(push, 0x1)
class alignas(0x10) UJunoPawnAnimInstance : public UJunoAnimInstance
{
public:
	bool                                          bIsFalling;                                        // 0x0448(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumping;                                        // 0x0449(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         PawnSpeed2D;                                       // 0x044C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PawnVelocity;                                      // 0x0450(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PawnRotationRate;                                  // 0x0468(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bPawnIsFalling : 1;                                // 0x0480(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPawnIsJumping : 1;                                // 0x0480(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPawnHasAcceleration : 1;                          // 0x0480(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPawnHasVelocity : 1;                              // 0x0480(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                PawnAcceleration;                                  // 0x0488(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnAccelerationDirection;                         // 0x04A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRotator                               PawnRotation;                                      // 0x04A8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               PawnRotationRateNormalized;                        // 0x04C0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PawnVelocityDirection;                             // 0x04D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                PawnPreviousVelocity;                              // 0x04E0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPawnAnimInstance">();
	}
	static class UJunoPawnAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPawnAnimInstance>();
	}
};
#pragma pack(pop)

// Class JunoGameNative.JunoPlayerAnimInstance
// 0x00C0 (0x05C0 - 0x0500)
class UJunoPlayerAnimInstance final : public UJunoPawnAnimInstance
{
public:
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsAccelerating2D : 1;                             // 0x0500(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsMoving2D : 1;                                   // 0x0500(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWasMoving2D : 1;                                  // 0x0500(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsOnGround : 1;                                   // 0x0500(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsSurfaceSwimming : 1;                            // 0x0500(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsMovingAndInMotionEmote : 1;                     // 0x0500(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
