#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AtomRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "NetCore_structs.hpp"
#include "WorldConditions_structs.hpp"


namespace SDK
{

// Enum JunoGameNative.EJunoBuildingBehaviorState
// NumValues: 0x0006
enum class EJunoBuildingBehaviorState : uint8
{
	Uninitialized                            = 0,
	Pending                                  = 1,
	Ready                                    = 2,
	Invalid                                  = 3,
	Disabled                                 = 4,
	MAX                                      = 5,
};

// Enum JunoGameNative.EJunoBiome
// NumValues: 0x0009
enum class EJunoBiome : uint8
{
	Unknown                                  = 0,
	Grasslands                               = 1,
	DarkForest                               = 2,
	Desert                                   = 3,
	Tropical                                 = 4,
	Alpine                                   = 5,
	Water                                    = 6,
	Reserved                                 = 7,
	Max                                      = 8,
};

// Enum JunoGameNative.EJunoAwesomePointModificationContext
// NumValues: 0x0006
enum class EJunoAwesomePointModificationContext : uint8
{
	Cheat                                    = 0,
	Interaction                              = 1,
	ActorPlacement                           = 2,
	ActorRemoval                             = 3,
	QuestCompletion                          = 4,
	EJunoAwesomePointModificationContext_MAX = 5,
};

// Enum JunoGameNative.EJunoPawnEmotionalState
// NumValues: 0x0004
enum class EJunoPawnEmotionalState : uint8
{
	Default                                  = 0,
	Happy                                    = 1,
	Sad                                      = 2,
	MAX                                      = 3,
};

// Enum JunoGameNative.EPassiveCraftingDoneReason
// NumValues: 0x0005
enum class EPassiveCraftingDoneReason : uint8
{
	UnexpectedError                          = 0,
	PlayerStopped                            = 1,
	NoOutputSpace                            = 2,
	MissingIngredients                       = 3,
	EPassiveCraftingDoneReason_MAX           = 4,
};

// Enum JunoGameNative.EJunoCaveType
// NumValues: 0x000A
enum class EJunoCaveType : uint8
{
	Unknown                                  = 0,
	Surface                                  = 1,
	Lava                                     = 2,
	Rift                                     = 3,
	Ruins                                    = 4,
	SurfaceMines                             = 5,
	Pirate                                   = 6,
	Bear                                     = 7,
	Treasure                                 = 8,
	Max                                      = 9,
};

// Enum JunoGameNative.EJunoBiomeHabitat
// NumValues: 0x0010
enum class EJunoBiomeHabitat : uint8
{
	Unknown                                  = 0,
	POI                                      = 1,
	Cave                                     = 2,
	Stone                                    = 3,
	Asphalt                                  = 4,
	Snow                                     = 5,
	Dirt                                     = 6,
	Sand                                     = 7,
	Grass                                    = 8,
	Flowers                                  = 9,
	Heather                                  = 10,
	Moss                                     = 11,
	Ocean                                    = 12,
	Lake                                     = 13,
	River                                    = 14,
	Max                                      = 15,
};

// Enum JunoGameNative.EJunoKnowledgeState
// NumValues: 0x0004
enum class EJunoKnowledgeState : uint8
{
	Hidden                                   = 0,
	Revealed                                 = 1,
	Acquired                                 = 2,
	EJunoKnowledgeState_MAX                  = 3,
};

// Enum JunoGameNative.EJunoPersistenceFeatureDataCheckOutMode
// NumValues: 0x0004
enum class EJunoPersistenceFeatureDataCheckOutMode : uint8
{
	None                                     = 0,
	OnPersistentPlayspaceDataCheckOutRequested = 1,
	OnPersistenceMainLevelDataCheckedOut     = 2,
	EJunoPersistenceFeatureDataCheckOutMode_MAX = 3,
};

// Enum JunoGameNative.EJunoPersistenceFeatureDataRestoredFlags
// NumValues: 0x0004
enum class EJunoPersistenceFeatureDataRestoredFlags : uint8
{
	None                                     = 0,
	NewlyCreated                             = 1,
	LoadedFromPersistentData                 = 2,
	EJunoPersistenceFeatureDataRestoredFlags_MAX = 3,
};

// Enum JunoGameNative.EJunoBuildModeType
// NumValues: 0x0005
enum class EJunoBuildModeType : uint8
{
	BuildMode                                = 0,
	GuidedBuildingMode                       = 1,
	NumOfBuildModes                          = 2,
	ActionMode                               = 3,
	EJunoBuildModeType_MAX                   = 4,
};

// Enum JunoGameNative.EJunoResourceScale
// NumValues: 0x0007
enum class EJunoResourceScale : uint8
{
	Invalid                                  = 0,
	Small                                    = 1,
	Medium                                   = 2,
	Large                                    = 3,
	VerySmall                                = 4,
	VeryLarge                                = 5,
	EJunoResourceScale_MAX                   = 6,
};

// Enum JunoGameNative.EJunoItemChangeType
// NumValues: 0x0006
enum class EJunoItemChangeType : uint8
{
	Added                                    = 0,
	Removed                                  = 1,
	ItemChanged                              = 2,
	SlotChanged                              = 3,
	Swapped                                  = 4,
	EJunoItemChangeType_MAX                  = 5,
};

// Enum JunoGameNative.EJunoInventoryAcquisitionResult
// NumValues: 0x0005
enum class EJunoInventoryAcquisitionResult : uint8
{
	Failure                                  = 0,
	SystemNotReady                           = 1,
	InventoryCreated                         = 2,
	InventoryRestored                        = 3,
	EJunoInventoryAcquisitionResult_MAX      = 4,
};

// Enum JunoGameNative.EJunoBuildingActorOverlapActionType
// NumValues: 0x0005
enum class EJunoBuildingActorOverlapActionType : uint8
{
	AllowOverlap                             = 0,
	DestroyComponent                         = 1,
	CropComponent                            = 2,
	Custom                                   = 3,
	EJunoBuildingActorOverlapActionType_MAX  = 4,
};

// Enum JunoGameNative.EJunoBuildingPlacementType
// NumValues: 0x0005
enum class EJunoBuildingPlacementType : uint8
{
	GuidedSnapping                           = 0,
	Connectivity                             = 1,
	SnapPlacement                            = 2,
	NoTarget                                 = 3,
	MAX                                      = 4,
};

// Enum JunoGameNative.EJunoBuildingSnapEntryState
// NumValues: 0x0006
enum class EJunoBuildingSnapEntryState : uint8
{
	Incompatible                             = 0,
	Compatible                               = 1,
	InRangeRejected                          = 2,
	InRangeValid                             = 3,
	Connected                                = 4,
	EJunoBuildingSnapEntryState_MAX          = 5,
};

// Enum JunoGameNative.EOnPlacementAction
// NumValues: 0x0003
enum class EOnPlacementAction : uint8
{
	IgnoreOnly                               = 0,
	IgnoreAndDestroy                         = 1,
	EOnPlacementAction_MAX                   = 2,
};

// Enum JunoGameNative.EJunoGuidedBuildingState
// NumValues: 0x0005
enum class EJunoGuidedBuildingState : uint8
{
	Default                                  = 0,
	Hidden                                   = 1,
	Unfilled                                 = 2,
	Filled                                   = 3,
	EJunoGuidedBuildingState_MAX             = 4,
};

// Enum JunoGameNative.EJunoAutomaticConnectionMethod
// NumValues: 0x0003
enum class EJunoAutomaticConnectionMethod : uint8
{
	Full                                     = 0,
	Below                                    = 1,
	EJunoAutomaticConnectionMethod_MAX       = 2,
};

// Enum JunoGameNative.EJunoPersistentPlayspaceDataComponent
// NumValues: 0x0004
enum class EJunoPersistentPlayspaceDataComponent : uint8
{
	MainPersistenceLevel                     = 0,
	PersistenceFeatures                      = 1,
	Count                                    = 2,
	EJunoPersistentPlayspaceDataComponent_MAX = 3,
};

// Enum JunoGameNative.EJunoPersistentPlayspaceDataCheckoutState
// NumValues: 0x0006
enum class EJunoPersistentPlayspaceDataCheckoutState : uint32
{
	Uninitialized                            = 0,
	CheckingOut                              = 1,
	CheckedOut                               = 2,
	CheckingIn                               = 3,
	CheckedIn                                = 4,
	EJunoPersistentPlayspaceDataCheckoutState_MAX = 5,
};

// Enum JunoGameNative.EJunoPersistentPlayspaceDataOperationResult
// NumValues: 0x0003
enum class EJunoPersistentPlayspaceDataOperationResult : uint8
{
	Success                                  = 0,
	Error                                    = 1,
	EJunoPersistentPlayspaceDataOperationResult_MAX = 2,
};

// Enum JunoGameNative.EJunoPawnEmotionalStateMappingTest
// NumValues: 0x0003
enum class EJunoPawnEmotionalStateMappingTest : uint32
{
	LessOrEqual                              = 0,
	GreaterOrEqual                           = 1,
	EJunoPawnEmotionalStateMappingTest_MAX   = 2,
};

// ScriptStruct JunoGameNative.JunoInventoryHandle
// 0x0018 (0x0018 - 0x0000)
struct FJunoInventoryHandle final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AJunoInventory>          Inventory;                                         // 0x0004(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C[0xC];                                        // 0x000C(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoKnowledgeItemStateEntry
// 0x0058 (0x0058 - 0x0000)
struct FJunoKnowledgeItemStateEntry final
{
public:
	struct FDateTime                              DateFound;                                         // 0x0000(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<struct FUniqueNetIdRepl>                 ViewedPlayerIds;                                   // 0x0008(0x0050)(SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoKnowledgeRecipeStateEntry
// 0x0058 (0x0058 - 0x0000)
struct FJunoKnowledgeRecipeStateEntry final
{
public:
	EJunoKnowledgeState                           KnowledgeState;                                    // 0x0000(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSet<struct FUniqueNetIdRepl>                 ViewedPlayerIds;                                   // 0x0008(0x0050)(SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoKnowledgeSaveRecord
// 0x00C0 (0x00C0 - 0x0000)
struct FJunoKnowledgeSaveRecord final
{
public:
	struct FGameplayTagContainer                  CraftingObjectTags;                                // 0x0000(0x0020)(SaveGame, Protected, NativeAccessSpecifierProtected)
	TMap<class UFortItemDefinition*, struct FJunoKnowledgeItemStateEntry> ItemStates;                // 0x0020(0x0050)(SaveGame, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FJunoKnowledgeRecipeStateEntry> RecipeStates;                           // 0x0070(0x0050)(SaveGame, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct JunoGameNative.JunoPlayerStats
// 0x0008 (0x0008 - 0x0000)
struct FJunoPlayerStats final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hunger;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoPlayerCheckpoint
// 0x0030 (0x0030 - 0x0000)
struct FJunoPlayerCheckpoint final
{
public:
	struct FGuid                                  CheckpointGUID;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CheckpointLocation;                                // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCheckpointActor;                               // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoPlayerSaveData
// 0x0190 (0x0190 - 0x0000)
struct FJunoPlayerSaveData final
{
public:
	struct FVector                                SpawnPosition;                                     // 0x0000(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OriginalSpawnPosition;                             // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0030(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoInventoryHandle                   InventoryHandle;                                   // 0x0048(0x0018)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoKnowledgeSaveRecord               KnowledgeRecord;                                   // 0x0060(0x00C0)(SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   CompletedFirstTimeConversationNPCIdentifiers;      // 0x0120(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	int32                                         WorldVisitCount;                                   // 0x0130(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoPlayerStats                       PlayerStats;                                       // 0x0134(0x0008)(BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoPlayerCheckpoint                  CheckpointInfo;                                    // 0x0140(0x0030)(BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CampCreatedCount;                                  // 0x0170(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                LastCaveTeleporterLocation;                        // 0x0178(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoTemperatureChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct FJunoTemperatureChangedEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           OldTemperature;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewTemperature;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_EnableBuildModeWithRecipe
// 0x000C (0x000C - 0x0000)
struct FJunoEvent_EnableBuildModeWithRecipe final
{
public:
	EJunoBuildModeType                            BuildModeType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   RecipeName;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromRecents;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoWeatherPhase
// 0x0038 (0x0038 - 0x0000)
struct FJunoWeatherPhase final
{
public:
	struct FGameplayTag                           WeatherTypeName;                                   // 0x0000(0x0004)(BlueprintVisible, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionIn;                                      // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionOut;                                     // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindDirectionDegree;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeatherIntensity;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindSpeed;                                         // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        GameTimeWeatherEnds;                               // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           MorningTemperature;                                // 0x0028(0x0004)(BlueprintVisible, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DayTemperature;                                    // 0x002C(0x0004)(BlueprintVisible, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EveningTemperature;                                // 0x0030(0x0004)(BlueprintVisible, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NightTemperature;                                  // 0x0034(0x0004)(BlueprintVisible, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.PassiveResourcesGatheringSimulationConfigurationRow
// 0x0008 (0x0010 - 0x0008)
struct FPassiveResourcesGatheringSimulationConfigurationRow final : public FTableRowBase
{
public:
	float                                         Weight;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverridenMultiplierForSimulatedGeneration;         // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_OnCheckPointDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FJunoEvent_OnCheckPointDestroyed final
{
public:
	class ABuildingActor*                         CheckpointActor;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.TemperatureRange
// 0x0014 (0x0014 - 0x0000)
struct FTemperatureRange final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            Range;                                             // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoTemperatureRangesChangedEvent
// 0x0018 (0x0018 - 0x0000)
struct FJunoTemperatureRangesChangedEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTemperatureRange>              NewTemperatureRanges;                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_BuildingSlotUpdate
// 0x0010 (0x0010 - 0x0000)
struct FJunoEvent_BuildingSlotUpdate final
{
public:
	class UJunoPlayerBuildingComponent*           BuildingComp;                                      // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBuildModeType                            BuildModeType;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         UpdatedSlot;                                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoGeometryCollectionAssemblerGCInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FJunoGeometryCollectionAssemblerGCInfo final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoWeatherLocation
// 0x0001 (0x0001 - 0x0000)
struct FJunoWeatherLocation final
{
public:
	EJunoBiome                                    Biome;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_TemperatureChanged
// 0x000C (0x000C - 0x0000)
struct FJunoEvent_TemperatureChanged final
{
public:
	struct FJunoWeatherLocation                   Location;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           NewTemperature;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewFloatTemperature;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoMarkerCustomizationOptionsRow
// 0x0020 (0x0028 - 0x0008)
struct FJunoMarkerCustomizationOptionsRow final : public FTableRowBase
{
public:
	TArray<TSoftObjectPtr<class UTexture>>        Icons;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   Colors;                                            // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_WeatherPhaseChanged
// 0x0078 (0x0078 - 0x0000)
struct FJunoEvent_WeatherPhaseChanged final
{
public:
	struct FJunoWeatherLocation                   Location;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoWeatherPhase                      NewWeatherPhase;                                   // 0x0008(0x0038)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoWeatherPhase                      NextWeatherPhase;                                  // 0x0040(0x0038)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoGuidedBuildingStateEntry
// 0x0014 (0x0020 - 0x000C)
struct FJunoGuidedBuildingStateEntry final : public FFastArraySerializerItem
{
public:
	EJunoGuidedBuildingState                      CurrentState;                                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class AActor>                  FilledActor;                                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuildingDataIndex;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoGuidedBuildingStateArray
// 0x0018 (0x0120 - 0x0108)
struct FJunoGuidedBuildingStateArray final : public FFastArraySerializer
{
public:
	TArray<struct FJunoGuidedBuildingStateEntry>  Entries;                                           // 0x0108(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class AJunoGuidedBuildingActor*               Parent;                                            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoAwesomeLevelChangeData
// 0x0018 (0x0018 - 0x0000)
struct FJunoAwesomeLevelChangeData final
{
public:
	int32                                         NewAwesomeLevel;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldAwesomeLevel;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentAwesomePoints;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AJunoCampActor*                         OwningCamp;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoSelectedSlotData
// 0x000C (0x000C - 0x0000)
struct FJunoSelectedSlotData final
{
public:
	struct FGameplayTag                           GroupTag;                                          // 0x0000(0x0004)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RowIndex;                                          // 0x0004(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColumnIndex;                                       // 0x0008(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoAwesomePointModificationData
// 0x0028 (0x0028 - 0x0000)
struct FJunoAwesomePointModificationData final
{
public:
	int32                                         AwesomePointAmount;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwesomePointsPostModification;                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SourceActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoAwesomePointModificationContext          ModificationContext;                               // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AJunoCampActor*                         OwningCamp;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_InventoryItemSelected
// 0x001C (0x001C - 0x0000)
struct FJunoEvent_InventoryItemSelected final
{
public:
	struct FGuid                                  ItemSelected;                                      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0xC];                                       // 0x0010(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoItemSlot
// 0x0044 (0x0050 - 0x000C)
struct FJunoItemSlot final : public FFastArraySerializerItem
{
public:
	struct FGameplayTag                           GroupTag;                                          // 0x000C(0x0004)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SlotTags;                                          // 0x0010(0x0020)(NativeAccessSpecifierPublic)
	int32                                         RowIndex;                                          // 0x0030(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColumnIndex;                                       // 0x0034(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ItemGuid;                                          // 0x0038(0x0010)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              Item;                                              // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoGameNative.JunoItemTransferRequest
// 0x00B8 (0x00B8 - 0x0000)
struct FJunoItemTransferRequest final
{
public:
	struct FJunoItemSlot                          SourceItemSlot;                                    // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	struct FJunoItemSlot                          DestinationItemSlot;                               // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	class UJunoInventoryComponent*                SourceInventoryComponent;                          // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoInventoryComponent*                DestinationInventoryComponent;                     // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTopOffExistingStacks;                             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoRecruitmentObjectAssignedData
// 0x0050 (0x0050 - 0x0000)
struct FJunoRecruitmentObjectAssignedData final
{
public:
	struct FGameplayTag                           UniqueAIIdentifier;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayText;                                       // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoBuildingConnectionPoint
// 0x00E0 (0x00E0 - 0x0000)
struct FJunoBuildingConnectionPoint final
{
public:
	struct FTransform                             FieldToObject;                                     // 0x0000(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             PointToObject;                                     // 0x0060(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FieldSize;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         Component;                                         // 0x00D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ObjectId;                                          // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionPointType                          PointType;                                         // 0x00DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAvailable;                                        // 0x00DD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoBuildingConnectionPoints
// 0x0010 (0x0010 - 0x0000)
struct FJunoBuildingConnectionPoints final
{
public:
	TArray<struct FJunoBuildingConnectionPoint>   Value;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoWeatherLocationChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct FJunoWeatherLocationChangedEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   OldLocation;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   NewLocation;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoEvent_InventoryMenuOpen
// 0x0008 (0x0008 - 0x0000)
struct FJunoEvent_InventoryMenuOpen final
{
public:
	class AActor*                                 InventoryObject;                                   // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.GuidedBuildingMessageBase
// 0x0008 (0x0008 - 0x0000)
struct FGuidedBuildingMessageBase
{
public:
	TWeakObjectPtr<class AJunoGuidedBuildingActor> GuidedBuildingActor;                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoReplicatedItemSlotList
// 0x0020 (0x0128 - 0x0108)
struct FJunoReplicatedItemSlotList final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FJunoItemSlot>                  ItemSlots;                                         // 0x0118(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoGameNative.JunoStageKey
// 0x0008 (0x0008 - 0x0000)
struct FJunoStageKey final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StageIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.GuidedBuildingUpdate
// 0x0038 (0x0040 - 0x0008)
struct FGuidedBuildingUpdate final : public FGuidedBuildingMessageBase
{
public:
	struct FJunoStageKey                          StageKey;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoStageKey                          CurrentStageKey;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         TotalNumberOfStagesInSection;                      // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalNumberOfSections;                             // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentStageInSet;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalNumberOfStagesInSet;                          // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentNumberOfSnapsInStage;                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalNumberOfSnapsInStage;                         // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentNumberOfSnapsInSection;                     // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalNumberOfSnapsInSection;                       // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentNumberOfSnapsInSet;                         // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalNumberOfSnapsInSet;                           // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.AutoCompleteData
// 0x0020 (0x0020 - 0x0000)
struct FAutoCompleteData final
{
public:
	int32                                         BuildingDataIndex;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APawn*                                  Instigator;                                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ServerSpawnTime;                                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.GuidedBuildingRegistrationEvent
// 0x0014 (0x0014 - 0x0000)
struct FGuidedBuildingRegistrationEvent final
{
public:
	TWeakObjectPtr<class AJunoGuidedBuildingActor> GuidedBuild;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortPlayerState>        PlayerState;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRegistering;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoGuidedBuildingRegisteredPlayer
// 0x0008 (0x0014 - 0x000C)
struct FJunoGuidedBuildingRegisteredPlayer final : public FFastArraySerializerItem
{
public:
	TWeakObjectPtr<class AFortPlayerState>        PlayerState;                                       // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoGuidedBuildingRegisteredPlayerArray
// 0x0040 (0x0148 - 0x0108)
struct FJunoGuidedBuildingRegisteredPlayerArray final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x30];                                     // 0x0108(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FJunoGuidedBuildingRegisteredPlayer> Entries;                                      // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoBuildingConnectivityComponentEntry
// 0x0058 (0x0058 - 0x0000)
struct FJunoBuildingConnectivityComponentEntry final
{
public:
	TWeakObjectPtr<class USceneComponent>         Component;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<int32>                                   Ids;                                               // 0x0008(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoBiomeInfoQueryResult
// 0x0010 (0x0010 - 0x0000)
struct FJunoBiomeInfoQueryResult final
{
public:
	EJunoBiome                                    PrimaryBiome;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiome                                    SecondaryBiome;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiomeHabitat                             PrimaryHabitat;                                    // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiomeHabitat                             SecondaryHabitat;                                  // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoCaveType                                 CaveType;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BiomeMix;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HabitatMix;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_BuildingModeChanged
// 0x0018 (0x0018 - 0x0000)
struct FJunoEvent_BuildingModeChanged final
{
public:
	class UJunoPlayerBuildingComponent*           BuildingComp;                                      // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBuildModeType                            BuildModeType;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SelectedSlot;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurrentRecipe;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInBuildMode;                                    // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoTileExploredInfo
// 0x0044 (0x0050 - 0x000C)
struct FJunoTileExploredInfo final : public FFastArraySerializerItem
{
public:
	int32                                         TileId;                                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 PackedTileMask;                                    // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIntPoint>                      TileMaskPixel;                                     // 0x0020(0x0010)(ZeroConstructor, Transient, RepSkip, NativeAccessSpecifierPublic)
	TArray<uint8>                                 TileMask;                                          // 0x0030(0x0010)(ZeroConstructor, Transient, RepSkip, NativeAccessSpecifierPublic)
	class UTexture2D*                             FogMask;                                           // 0x0040(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedTextureUpdate;                                // 0x0048(0x0001)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoBuildingConnection
// 0x01D0 (0x01D0 - 0x0000)
struct FJunoBuildingConnection final
{
public:
	struct FJunoBuildingConnectionPoint           Candidate;                                         // 0x0000(0x00E0)(BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPoint           Target;                                            // 0x00E0(0x00E0)(BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Locations;                                         // 0x01C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoItemSlotGroup
// 0x0018 (0x0018 - 0x0000)
struct FJunoItemSlotGroup final
{
public:
	struct FGameplayTag                           GroupType;                                         // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FJunoItemSlot>                  SlotList;                                          // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoGameNative.PassiveResourcesGatheringRow
// 0x0020 (0x0028 - 0x0008)
struct FPassiveResourcesGatheringRow final : public FTableRowBase
{
public:
	class FName                                   LootTierGroup;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWorldConditionQueryDefinition         SelectionPreconditions;                            // 0x0010(0x0018)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoInventoryGroupConfig
// 0x0060 (0x0060 - 0x0000)
struct FJunoInventoryGroupConfig final
{
public:
	struct FGameplayTag                           GroupType;                                         // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumItemRows;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumItemColumns;                                    // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<int32, struct FGameplayTagContainer>     SlotTagMap;                                        // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoInventoryConfig
// 0x0018 (0x0018 - 0x0000)
struct FJunoInventoryConfig final
{
public:
	TArray<struct FJunoInventoryGroupConfig>      InventoryGroupConfigs;                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GameplayTag;                                       // 0x0010(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPersistent;                                     // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct JunoGameNative.JunoWeaponEssenceData
// 0x0028 (0x0030 - 0x0008)
struct FJunoWeaponEssenceData final : public FTableRowBase
{
public:
