#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "Engine_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function JunoGameNative.JunoAlterationCraftingComponent.HandleCraftingStateChanged
// 0x0028 (0x0028 - 0x0000)
struct JunoAlterationCraftingComponent_HandleCraftingStateChanged final
{
public:
	struct FCraftingObjectStateChangedEvent       Event;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAlterationCraftingComponent.OnCraftingSuccess
// 0x0020 (0x0020 - 0x0000)
struct JunoAlterationCraftingComponent_OnCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAsyncAction_WaitForEventRouter.WaitForEventRouter
// 0x0010 (0x0010 - 0x0000)
struct JunoAsyncAction_WaitForEventRouter_WaitForEventRouter final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoAsyncAction_WaitForEventRouter*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSelectionSpawnedByBuilderTool
// 0x00E0 (0x00E0 - 0x0000)
struct JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool final
{
public:
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoBuilderToolInteractionBehavior*    Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuilderToolSelectionSpawnParams   SelectionSpawnParameters;                          // 0x0010(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSpawnedByBuilderTool
// 0x0010 (0x0010 - 0x0000)
struct JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool final
{
public:
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoBuilderToolInteractionBehavior*    Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnectionLocations
// 0x01E0 (0x01E0 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoBuildingConnection                Connection;                                        // 0x0010(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnections
// 0x0290 (0x0290 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Candidates;                                        // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Targets;                                           // 0x0058(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoBuildingConnection                ChosenConnection;                                  // 0x00B0(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnection>        Connections;                                       // 0x0280(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetAtomModelAssetUserData
// 0x0018 (0x0018 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAtomModelAssetUserData*>        ReturnValue;                                       // 0x0008(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetKnobs
// 0x0060 (0x0060 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetKnobs final
{
public:
	struct FJunoBuildingConnectionPointsResult    Result;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnectionPoint>   ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.HandleSmartObjectEvent
// 0x0038 (0x0038 - 0x0000)
struct JunoCampCenterComponent_HandleSmartObjectEvent final
{
public:
	struct FSmartObjectEventData                  SmartObjectEventData;                              // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.OnCampAwesomeLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoCampCenterComponent_OnCampAwesomeLevelChanged final
{
public:
	struct FJunoAwesomeLevelChangeData            ChangeData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.OnCampAwesomePointModification
// 0x0028 (0x0028 - 0x0000)
struct JunoCampCenterComponent_OnCampAwesomePointModification final
{
public:
	struct FJunoAwesomePointModificationData      ModificationData;                                  // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.OnPersistentPlayspaceDataLoadEnd
// 0x0010 (0x0010 - 0x0000)
struct JunoCampCenterComponent_OnPersistentPlayspaceDataLoadEnd final
{
public:
	class AJunoPersistentPlayspace*               PersistentPlayspace;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoCampCenterComponent.GetCampActor
// 0x0008 (0x0008 - 0x0000)
struct JunoCampCenterComponent_GetCampActor final
{
public:
	class AJunoCampActor*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampAtLocationAndReturnComponent
// 0x0030 (0x0030 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          WorldContextObject;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActorAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForArea
// 0x0048 (0x0048 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForArea final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   AreaBox;                                           // 0x0008(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForLocation
// 0x0028 (0x0028 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipActorComponentOnActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoCampMembershipActorComponent*      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipComponentAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Owner;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindOrCreateCampMembershipActorComponentOnActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoCampMembershipActorComponent*      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindOrCreateCampMembershipComponentAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Owner;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.HasCampAtBounds
// 0x0048 (0x0048 - 0x0000)
struct JunoCampMembershipActorComponent_HasCampAtBounds final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0008(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoCampMembershipActorComponent.HasCampAtLocation
// 0x0028 (0x0028 - 0x0000)
struct JunoCampMembershipActorComponent_HasCampAtLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoCampMembershipActorComponent.HandleAddedIntoClusterUnion
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_HandleAddedIntoClusterUnion final
{
public:
	class UClusterUnionComponent*                 ClusterUnion;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.HandleBoundCampEndPlayEvent
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_HandleBoundCampEndPlayEvent final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoCampMembershipActorComponent.HandleRemovedFromClusterUnion
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_HandleRemovedFromClusterUnion final
{
public:
	class UClusterUnionComponent*                 ClusterUnion;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.GetBoundCamp
// 0x0008 (0x0008 - 0x0000)
struct JunoCampMembershipActorComponent_GetBoundCamp final
{
public:
	class AJunoCampActor*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.GetBoundComponent
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_GetBoundComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampRecruitmentObjectComponent.AssignToPlayer
// 0x0010 (0x0010 - 0x0000)
struct JunoCampRecruitmentObjectComponent_AssignToPlayer final
{
public:
	const class AFortPlayerController*            PlayerController;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckForDuplicateRecruitmentObjects;              // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoCampRecruitmentObjectComponent.HandleOnEmptyRecrutmentObjectInteracted
// 0x0008 (0x0008 - 0x0000)
struct JunoCampRecruitmentObjectComponent_HandleOnEmptyRecrutmentObjectInteracted final
{
public:
	class AFortPlayerController*                  InteractingController;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampRecruitmentObjectComponent.CostlyFindAssignableNPCs
// 0x0018 (0x0018 - 0x0000)
struct JunoCampRecruitmentObjectComponent_CostlyFindAssignableNPCs final
{
public:
	TArray<struct FGameplayTag>                   OutAssignableNPCs;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoCampRecruitmentObjectComponent.GetAssignedData
// 0x0050 (0x0050 - 0x0000)
struct JunoCampRecruitmentObjectComponent_GetAssignedData final
{
public:
	struct FJunoRecruitmentObjectAssignedData     ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampRecruitmentObjectComponent.IsAssignedToAI
// 0x0001 (0x0001 - 0x0000)
struct JunoCampRecruitmentObjectComponent_IsAssignedToAI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampRecruitmentObjectComponent.IsAssignedToPlayer
// 0x0001 (0x0001 - 0x0000)
struct JunoCampRecruitmentObjectComponent_IsAssignedToPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampRecruitmentObjectComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoCampRecruitmentObjectComponent_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoEventRouterLibrary.GetGameplayEventRouter
// 0x0010 (0x0010 - 0x0000)
struct JunoEventRouterLibrary_GetGameplayEventRouter final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayEventRouterComponent*          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGameStateWeatherComponent.FindWeatherState
// 0x0010 (0x0010 - 0x0000)
struct JunoGameStateWeatherComponent_FindWeatherState final
{
public:
	struct FJunoWeatherLocation                   Location;                                          // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UJunoWeatherStateComponent*             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGameStateWeatherComponent.ForceWeatherState
// 0x0008 (0x0008 - 0x0000)
struct JunoGameStateWeatherComponent_ForceWeatherState final
{
public:
	class FName                                   NewWeatherType;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OptionalLocation;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGameStateWeatherComponent.HandleWeatherStatesSetup
// 0x0010 (0x0010 - 0x0000)
struct JunoGameStateWeatherComponent_HandleWeatherStatesSetup final
{
public:
	TArray<class UJunoWeatherStateComponent*>     WeatherStates;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGameStateWeatherComponent.SetAutoTransitioning
// 0x0001 (0x0001 - 0x0000)
struct JunoGameStateWeatherComponent_SetAutoTransitioning final
{
public:
	bool                                          bAutoTransitionWeather;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGameStateWeatherComponent.TransitionWeatherNow
// 0x0004 (0x0004 - 0x0000)
struct JunoGameStateWeatherComponent_TransitionWeatherNow final
{
public:
	class FName                                   OptionalLocation;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGameStateWeatherComponent.TransitionWeatherNowTo
// 0x0078 (0x0078 - 0x0000)
struct JunoGameStateWeatherComponent_TransitionWeatherNowTo final
{
public:
	struct FJunoWeatherPhase                      NewWeatherPhase;                                   // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoWeatherPhase                      NewNextWeatherPhase;                               // 0x0038(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   OptionalLocation;                                  // 0x0070(0x0001)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoGameStateWeatherComponent.GetWeatherStates
// 0x0010 (0x0010 - 0x0000)
struct JunoGameStateWeatherComponent_GetWeatherStates final
{
public:
	TArray<class UJunoWeatherStateComponent*>     ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGameStateWeatherComponent.IsAutoTransitioning
// 0x0001 (0x0001 - 0x0000)
struct JunoGameStateWeatherComponent_IsAutoTransitioning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGeometryCollectionAssemblerComponent.SetFreeMemoryWhenNotAnimating
// 0x0001 (0x0001 - 0x0000)
struct JunoGeometryCollectionAssemblerComponent_SetFreeMemoryWhenNotAnimating final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoMapManagerComponent.GetMapMaterialMID
// 0x0010 (0x0010 - 0x0000)
struct JunoMapManagerComponent_GetMapMaterialMID final
{
public:
	int32                                         TileIdx;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoMapManagerComponent.GetFOWForTile
// 0x0010 (0x0010 - 0x0000)
struct JunoMapManagerComponent_GetFOWForTile final
{
public:
	int32                                         TileId;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveCraftingComponent.HandleCraftingStateChanged
// 0x0028 (0x0028 - 0x0000)
struct JunoPassiveCraftingComponent_HandleCraftingStateChanged final
{
public:
	struct FCraftingObjectStateChangedEvent       Event;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveCraftingComponent.MulticastFireCraftingDone
// 0x0001 (0x0001 - 0x0000)
struct JunoPassiveCraftingComponent_MulticastFireCraftingDone final
{
public:
	EPassiveCraftingDoneReason                    Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveCraftingComponent.OnCraftingSuccess
// 0x0020 (0x0020 - 0x0000)
struct JunoPassiveCraftingComponent_OnCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveCraftingComponent.SetAutoCraftRecipe
// 0x0004 (0x0004 - 0x0000)
struct JunoPassiveCraftingComponent_SetAutoCraftRecipe final
{
public:
	class FName                                   FormulaRow;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveCraftingComponent.CalculateNumRemainingAutoCraft
// 0x0008 (0x0008 - 0x0000)
struct JunoPassiveCraftingComponent_CalculateNumRemainingAutoCraft final
{
public:
	class FName                                   OptionalFormulaRow;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveCraftingComponent.GetAutoCraftingFormulaRow
// 0x0004 (0x0004 - 0x0000)
struct JunoPassiveCraftingComponent_GetAutoCraftingFormulaRow final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveCraftingComponent.IsAutoCrafting
// 0x0001 (0x0001 - 0x0000)
struct JunoPassiveCraftingComponent_IsAutoCrafting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveResourcesGatheringComponent.OverrideGatheringRow
// 0x0018 (0x0018 - 0x0000)
struct JunoPassiveResourcesGatheringComponent_OverrideGatheringRow final
{
public:
	struct FDataTableRowHandle                    GatheringRow;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoPlayerBuildingComponent.EnterBuildingModeAndSelectIndex
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_EnterBuildingModeAndSelectIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBuildModeType                            InType;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoPlayerBuildingComponent.EnterGuidedBuilding
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_EnterGuidedBuilding final
{
public:
	class AJunoGuidedBuildingActor*               InLastGuidedBuildingActor;                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.OnGuidedBuildDone
// 0x0040 (0x0040 - 0x0000)
struct JunoPlayerBuildingComponent_OnGuidedBuildDone final
{
public:
	struct FGuidedBuildingUpdate                  StageUpdate;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.OnGuidedBuildingStageChanged
// 0x0040 (0x0040 - 0x0000)
struct JunoPlayerBuildingComponent_OnGuidedBuildingStageChanged final
{
public:
	struct FGuidedBuildingUpdate                  StageUpdate;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.ServerSelectSlot
// 0x000C (0x000C - 0x0000)
struct JunoPlayerBuildingComponent_ServerSelectSlot final
{
public:
	struct FJunoSelectedSlot                      NewSlot;                                           // 0x0000(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.ServerSetLastGuidedBuildingActor
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_ServerSetLastGuidedBuildingActor final
{
public:
	class AJunoGuidedBuildingActor*               InLastActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.ServerSetRecipeAtIndex
// 0x000C (0x000C - 0x0000)
struct JunoPlayerBuildingComponent_ServerSetRecipeAtIndex final
{
public:
	struct FJunoSlotIndex                         NewSlot;                                           // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   RecipeName;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.SetLastGuidedBuildingActor
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_SetLastGuidedBuildingActor final
{
public:
	class AJunoGuidedBuildingActor*               InLastGuidedBuildingActor;                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.SetRecipeAtIndex
// 0x000C (0x000C - 0x0000)
struct JunoPlayerBuildingComponent_SetRecipeAtIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RecipeName;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBuildModeType                            ModeType;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetBuildModeType
// 0x0001 (0x0001 - 0x0000)
struct JunoPlayerBuildingComponent_GetBuildModeType final
{
public:
	EJunoBuildModeType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetCurrentRecipe
// 0x0004 (0x0004 - 0x0000)
struct JunoPlayerBuildingComponent_GetCurrentRecipe final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetForcedRecipe
// 0x0004 (0x0004 - 0x0000)
struct JunoPlayerBuildingComponent_GetForcedRecipe final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetIsInBuildMode
// 0x0001 (0x0001 - 0x0000)
struct JunoPlayerBuildingComponent_GetIsInBuildMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetLastFocusedRecipe
// 0x0004 (0x0004 - 0x0000)
struct JunoPlayerBuildingComponent_GetLastFocusedRecipe final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetLastGuidedBuildingActor
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_GetLastGuidedBuildingActor final
{
public:
	const class AJunoGuidedBuildingActor*         ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetLastLoadedRecipe
// 0x0004 (0x0004 - 0x0000)
struct JunoPlayerBuildingComponent_GetLastLoadedRecipe final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetLastLoadedRecipeData
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_GetLastLoadedRecipeData final
{
public:
	struct FJunoLastLoadedRecipeData              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetSelectedSlotIndex
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_GetSelectedSlotIndex final
{
public:
	EJunoBuildModeType                            InType;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.GetSlotData
// 0x0048 (0x0048 - 0x0000)
struct JunoPlayerBuildingComponent_GetSlotData final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBuildModeType                            InType;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoBuildingSlotData                  ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.IsBuildModeEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoPlayerBuildingComponent_IsBuildModeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerBuildingComponent.IsRecipePinned
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerBuildingComponent_IsRecipePinned final
{
public:
	class FName                                   Recipe;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoPlayerCampPawnComponent.HandleAwesomeLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged final
{
public:
	struct FJunoAwesomeLevelChangeData            ChangeData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoSmartObjectComponent.HandleAddedIntoClusterUnion
// 0x0010 (0x0010 - 0x0000)
struct JunoSmartObjectComponent_HandleAddedIntoClusterUnion final
{
public:
	class UClusterUnionComponent*                 ClusterUnion;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoSmartObjectComponent.HandleRemovedFromClusterUnion
// 0x0010 (0x0010 - 0x0000)
struct JunoSmartObjectComponent_HandleRemovedFromClusterUnion final
{
public:
	class UClusterUnionComponent*                 ClusterUnion;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoSyncTimeOfDayComponent.SetTimeOfDaySyncEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled final
{
public:
	bool                                          bNewTimeOfDaySyncEnabled;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoSyncTimeOfDayComponent.GetTimeOfDaySyncEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoTemperatureAttributeSet.ForceTemperature
// 0x0004 (0x0004 - 0x0000)
struct JunoTemperatureAttributeSet_ForceTemperature final
{
public:
	struct FGameplayTag                           TemperatureToForce;                                // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoTemperatureAttributeSet.HandleWeatherTemperatureChanged
// 0x000C (0x000C - 0x0000)
struct JunoTemperatureAttributeSet_HandleWeatherTemperatureChanged final
{
public:
	struct FJunoEvent_TemperatureChanged          Payload;                                           // 0x0000(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoTemperatureAttributeSet.OnRep_ColdResistance
// 0x0028 (0x0028 - 0x0000)
struct JunoTemperatureAttributeSet_OnRep_ColdResistance final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoTemperatureAttributeSet.OnRep_CurrentTemperature
// 0x0004 (0x0004 - 0x0000)
struct JunoTemperatureAttributeSet_OnRep_CurrentTemperature final
{
public:
	struct FGameplayTag                           OldTemperature;                                    // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoTemperatureAttributeSet.OnRep_HeatResistance
// 0x0028 (0x0028 - 0x0000)
struct JunoTemperatureAttributeSet_OnRep_HeatResistance final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoTemperatureAttributeSet.OnRep_Temperature
// 0x0028 (0x0028 - 0x0000)
struct JunoTemperatureAttributeSet_OnRep_Temperature final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.CalculateLocation
// 0x0010 (0x0010 - 0x0000)
struct JunoWeatherLibrary_CalculateLocation final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function JunoGameNative.JunoWeatherLibrary.DescribeLocation
// 0x0018 (0x0018 - 0x0000)
struct JunoWeatherLibrary_DescribeLocation final
{
public:
	struct FJunoWeatherLocation                   WeatherLocation;                                   // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.DescribePhase
// 0x0048 (0x0048 - 0x0000)
struct JunoWeatherLibrary_DescribePhase final
{
public:
	struct FJunoWeatherPhase                      WeatherPhase;                                      // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.EqualEqual_JunoWeatherLocation
// 0x0003 (0x0003 - 0x0000)
struct JunoWeatherLibrary_EqualEqual_JunoWeatherLocation final
{
public:
	struct FJunoWeatherLocation                   A;                                                 // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   B;                                                 // 0x0001(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.FindGameStateWeatherComponent
// 0x0010 (0x0010 - 0x0000)
struct JunoWeatherLibrary_FindGameStateWeatherComponent final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoGameStateWeatherComponent*         ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.IsJunoWeatherLocationValid
// 0x0002 (0x0002 - 0x0000)
struct JunoWeatherLibrary_IsJunoWeatherLocationValid final
{
public:
	struct FJunoWeatherLocation                   JunoWeatherLocation;                               // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.NotEqual_JunoWeatherLocation
// 0x0003 (0x0003 - 0x0000)
struct JunoWeatherLibrary_NotEqual_JunoWeatherLocation final
{
public:
	struct FJunoWeatherLocation                   A;                                                 // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   B;                                                 // 0x0001(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.RollWeatherFromForecast
// 0x00A0 (0x00A0 - 0x0000)
struct JunoWeatherLibrary_RollWeatherFromForecast final
{
public:
	struct FJunoWeatherPhaseForecast              Forecast;                                          // 0x0000(0x0064)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FJunoWeatherPhase                      ReturnValue;                                       // 0x0068(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.RollWeatherFromSeason
// 0x0060 (0x0060 - 0x0000)
struct JunoWeatherLibrary_RollWeatherFromSeason final
{
public:
	struct FJunoWeatherSeasonRow                  Season;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FJunoWeatherLocation                   Location;                                          // 0x0020(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           OptionalWeatherType;                               // 0x0024(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWeatherPhase                      ReturnValue;                                       // 0x0028(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoWeatherLibrary.StringToLocation
// 0x0008 (0x0008 - 0x0000)
struct JunoWeatherLibrary_StringToLocation final
{
public:
