#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LandscapePatch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LandscapePatch_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LandscapePatch.LandscapePatchComponent.RequestLandscapeUpdate
// 0x0001 (0x0001 - 0x0000)
struct LandscapePatchComponent_RequestLandscapeUpdate final
{
public:
	bool                                          bInUserTriggeredUpdate;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapePatchComponent.SetIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct LandscapePatchComponent_SetIsEnabled final
{
public:
	bool                                          bEnabledIn;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapePatchComponent.SetLandscape
// 0x0008 (0x0008 - 0x0000)
struct LandscapePatchComponent_SetLandscape final
{
public:
	class ALandscape*                             NewLandscape;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapePatchComponent.SetPatchManager
// 0x0008 (0x0008 - 0x0000)
struct LandscapePatchComponent_SetPatchManager final
{
public:
	class ALandscapePatchManager*                 NewPatchManager;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapePatchComponent.GetLandscapeHeightmapCoordsToWorld
// 0x0060 (0x0060 - 0x0000)
struct LandscapePatchComponent_GetLandscapeHeightmapCoordsToWorld final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapePatchComponent.GetPatchManager
// 0x0008 (0x0008 - 0x0000)
struct LandscapePatchComponent_GetPatchManager final
{
public:
	class ALandscapePatchManager*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapePatchComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct LandscapePatchComponent_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.AddWeightPatch
// 0x0008 (0x0008 - 0x0000)
struct LandscapeTexturePatch_AddWeightPatch final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELandscapeTexturePatchSourceMode              SourceMode;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAlphaChannel;                                  // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LandscapePatch.LandscapeTexturePatch.ClearWeightPatchBlendModeOverride
// 0x0004 (0x0004 - 0x0000)
struct LandscapeTexturePatch_ClearWeightPatchBlendModeOverride final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetAllWeightPatchLayerNames
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_GetAllWeightPatchLayerNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetHeightRenderTarget
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_GetHeightRenderTarget final
{
public:
	bool                                          bMarkDirty;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetWeightPatchRenderTarget
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_GetWeightPatchRenderTarget final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetWeightPatchSourceMode
// 0x0008 (0x0008 - 0x0000)
struct LandscapeTexturePatch_GetWeightPatchSourceMode final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELandscapeTexturePatchSourceMode              ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LandscapePatch.LandscapeTexturePatch.RemoveWeightPatch
// 0x0004 (0x0004 - 0x0000)
struct LandscapeTexturePatch_RemoveWeightPatch final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.ResetHeightEncodingMode
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_ResetHeightEncodingMode final
{
public:
	ELandscapeTextureHeightPatchEncoding          EncodingMode;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetBlendMode
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_SetBlendMode final
{
public:
	ELandscapeTexturePatchBlendMode               BlendModeIn;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetEditVisibilityLayer
// 0x0008 (0x0008 - 0x0000)
struct LandscapeTexturePatch_SetEditVisibilityLayer final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEditVisibilityLayer;                              // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LandscapePatch.LandscapeTexturePatch.SetFalloff
// 0x0004 (0x0004 - 0x0000)
struct LandscapeTexturePatch_SetFalloff final
{
public:
	float                                         FalloffIn;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetHeightEncodingMode
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_SetHeightEncodingMode final
{
public:
	ELandscapeTextureHeightPatchEncoding          EncodingMode;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetHeightEncodingSettings
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_SetHeightEncodingSettings final
{
public:
	struct FLandscapeTexturePatchEncodingSettings Settings;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetHeightRenderTargetFormat
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_SetHeightRenderTargetFormat final
{
public:
	ETextureRenderTargetFormat                    Format;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetHeightSourceMode
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_SetHeightSourceMode final
{
public:
	ELandscapeTexturePatchSourceMode              NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetHeightTextureAsset
// 0x0008 (0x0008 - 0x0000)
struct LandscapeTexturePatch_SetHeightTextureAsset final
{
public:
	class UTexture*                               TextureIn;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetResolution
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_SetResolution final
{
public:
	struct FVector2D                              ResolutionIn;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetUnscaledCoverage
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_SetUnscaledCoverage final
{
public:
	struct FVector2D                              Coverage;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetUseAlphaChannelForHeight
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_SetUseAlphaChannelForHeight final
{
public:
	bool                                          bUse;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetUseAlphaChannelForWeightPatch
// 0x0008 (0x0008 - 0x0000)
struct LandscapeTexturePatch_SetUseAlphaChannelForWeightPatch final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAlphaChannel;                                  // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LandscapePatch.LandscapeTexturePatch.SetWeightPatchBlendModeOverride
// 0x0008 (0x0008 - 0x0000)
struct LandscapeTexturePatch_SetWeightPatchBlendModeOverride final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELandscapeTexturePatchBlendMode               BlendMode_0;                                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LandscapePatch.LandscapeTexturePatch.SetWeightPatchSourceMode
// 0x0008 (0x0008 - 0x0000)
struct LandscapeTexturePatch_SetWeightPatchSourceMode final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELandscapeTexturePatchSourceMode              NewMode;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LandscapePatch.LandscapeTexturePatch.SetWeightPatchTextureAsset
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_SetWeightPatchTextureAsset final
{
public:
	class FName                                   InWeightmapLayerName;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture*                               TextureIn;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.SetZeroHeightMeaning
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_SetZeroHeightMeaning final
{
public:
	ELandscapeTextureHeightPatchZeroHeightMeaning ZeroHeightMeaningIn;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetFullUnscaledWorldSize
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_GetFullUnscaledWorldSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetHeightSourceMode
// 0x0001 (0x0001 - 0x0000)
struct LandscapeTexturePatch_GetHeightSourceMode final
{
public:
	ELandscapeTexturePatchSourceMode              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetInitResolutionFromLandscape
// 0x0020 (0x0020 - 0x0000)
struct LandscapeTexturePatch_GetInitResolutionFromLandscape final
{
public:
	float                                         ResolutionMultiplier_0;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector2D                              ResolutionOut;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LandscapePatch.LandscapeTexturePatch.GetPatchToWorldTransform
// 0x0060 (0x0060 - 0x0000)
struct LandscapeTexturePatch_GetPatchToWorldTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetResolution
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_GetResolution final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LandscapePatch.LandscapeTexturePatch.GetUnscaledCoverage
// 0x0010 (0x0010 - 0x0000)
struct LandscapeTexturePatch_GetUnscaledCoverage final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

