#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LandscapePatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Landscape_classes.hpp"
#include "LandscapePatch_structs.hpp"


namespace SDK
{

// Class LandscapePatch.LandscapePatchComponent
// 0x0070 (0x0310 - 0x02A0)
#pragma pack(push, 0x1)
class alignas(0x10) ULandscapePatchComponent : public USceneComponent
{
public:
	TSoftObjectPtr<class ALandscape>              Landscape;                                         // 0x02A0(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class ALandscapePatchManager>  PatchManager;                                      // 0x02C0(0x0020)(Edit, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnabled;                                        // 0x02E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E1[0x2];                                      // 0x02E1(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bPropertiesCopiedIndicator;                        // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class ALandscapePatchManager>  PreviousPatchManager;                              // 0x02E8(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void MoveToTop();
	void RequestLandscapeUpdate(bool bInUserTriggeredUpdate);
	void SetIsEnabled(bool bEnabledIn);
	void SetLandscape(class ALandscape* NewLandscape);
	void SetPatchManager(class ALandscapePatchManager* NewPatchManager);

	struct FTransform GetLandscapeHeightmapCoordsToWorld() const;
	class ALandscapePatchManager* GetPatchManager() const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapePatchComponent">();
	}
	static class ULandscapePatchComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapePatchComponent>();
	}
};
#pragma pack(pop)

// Class LandscapePatch.LandscapeCircleHeightPatch
// 0x0010 (0x0320 - 0x0310)
class ULandscapeCircleHeightPatch final : public ULandscapePatchComponent
{
public:
	float                                         Radius;                                            // 0x0308(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Falloff;                                           // 0x030C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEditVisibility;                                   // 0x0310(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExclusiveRadius;                                  // 0x0311(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_312[0xE];                                      // 0x0312(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeCircleHeightPatch">();
	}
	static class ULandscapeCircleHeightPatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeCircleHeightPatch>();
	}
};

// Class LandscapePatch.LandscapePatchManager
// 0x0070 (0x0300 - 0x0290)
class ALandscapePatchManager final : public ALandscapeBlueprintBrushBase
{
public:
	TArray<TSoftObjectPtr<class ULandscapePatchComponent>> PatchComponents;                          // 0x0290(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FTransform                             HeightmapCoordsToWorld;                            // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapePatchManager">();
	}
	static class ALandscapePatchManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapePatchManager>();
	}
};

// Class LandscapePatch.LandscapeTextureBackedRenderTargetBase
// 0x0028 (0x0050 - 0x0028)
class ULandscapeTextureBackedRenderTargetBase : public UObject
{
public:
	class UTextureRenderTarget2D*                 PostLoadRT;                                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             InternalTexture;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SizeX;                                             // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SizeY;                                             // 0x0044(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseInternalTextureOnly;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeTextureBackedRenderTargetBase">();
	}
	static class ULandscapeTextureBackedRenderTargetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeTextureBackedRenderTargetBase>();
	}
};

// Class LandscapePatch.LandscapeWeightTextureBackedRenderTarget
// 0x0008 (0x0058 - 0x0050)
class ULandscapeWeightTextureBackedRenderTarget final : public ULandscapeTextureBackedRenderTargetBase
{
public:
	bool                                          bUseAlphaChannel;                                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeWeightTextureBackedRenderTarget">();
	}
	static class ULandscapeWeightTextureBackedRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeWeightTextureBackedRenderTarget>();
	}
};

// Class LandscapePatch.LandscapeHeightTextureBackedRenderTarget
// 0x0010 (0x0060 - 0x0050)
class ULandscapeHeightTextureBackedRenderTarget final : public ULandscapeTextureBackedRenderTargetBase
{
public:
	struct FLandscapeHeightPatchConvertToNativeParams ConversionParams;                              // 0x0050(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    RenderTargetFormat;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeHeightTextureBackedRenderTarget">();
	}
	static class ULandscapeHeightTextureBackedRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeHeightTextureBackedRenderTarget>();
	}
};

// Class LandscapePatch.LandscapeWeightPatchTextureInfo
// 0x0030 (0x0058 - 0x0028)
class ULandscapeWeightPatchTextureInfo final : public UObject
{
public:
	class FName                                   WeightmapLayerName;                                // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEditVisibilityLayer;                              // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture*                               TextureAsset;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULandscapeWeightTextureBackedRenderTarget* InternalData;                                   // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, AdvancedDisplay, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              SourceMode;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              DetailPanelSourceMode;                             // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseAlphaChannel;                                  // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideBlendMode;                                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchBlendMode               OverrideBlendMode;                                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class ULandscapeTexturePatch>  OwningPatch;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeWeightPatchTextureInfo">();
	}
	static class ULandscapeWeightPatchTextureInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeWeightPatchTextureInfo>();
	}
};

// Class LandscapePatch.LandscapeTexturePatch
// 0x0080 (0x0390 - 0x0310)
class ULandscapeTexturePatch final : public ULandscapePatchComponent
{
public:
	int32                                         ResolutionX;                                       // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ResolutionY;                                       // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              UnscaledPatchCoverage;                             // 0x0310(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchBlendMode               BlendMode;                                         // 0x0320(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchFalloffMode             FalloffMode;                                       // 0x0321(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Falloff;                                           // 0x0324(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              HeightSourceMode;                                  // 0x0328(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              DetailPanelHeightSourceMode;                       // 0x0329(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class ULandscapeHeightTextureBackedRenderTarget* HeightInternalData;                             // 0x0330(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture*                               HeightTextureAsset;                                // 0x0338(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseTextureAlphaForHeight;                         // 0x0340(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTextureHeightPatchEncoding          HeightEncoding;                                    // 0x0341(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLandscapeTexturePatchEncodingSettings HeightEncodingSettings;                            // 0x0348(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ELandscapeTextureHeightPatchZeroHeightMeaning ZeroHeightMeaning;                                 // 0x0358(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyComponentZScale;                             // 0x0359(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class ULandscapeWeightPatchTextureInfo*> WeightPatches;                                   // 0x0360(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         NumWeightPatches;                                  // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_374[0x1];                                      // 0x0374(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bBaseResolutionOffLandscape;                       // 0x0375(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ResolutionMultiplier;                              // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InitTextureSizeX;                                  // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InitTextureSizeY;                                  // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextureRenderTargetFormat                    HeightRenderTargetFormat;                          // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_385[0xB];                                      // 0x0385(0x000B)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddWeightPatch(const class FName& InWeightmapLayerName, ELandscapeTexturePatchSourceMode SourceMode, bool bUseAlphaChannel);
	void ClearWeightPatchBlendModeOverride(const class FName& InWeightmapLayerName);
	void DisableAllWeightPatches();
	TArray<class FName> GetAllWeightPatchLayerNames();
	class UTextureRenderTarget2D* GetHeightRenderTarget(bool bMarkDirty);
	class UTextureRenderTarget2D* GetWeightPatchRenderTarget(const class FName& InWeightmapLayerName);
	ELandscapeTexturePatchSourceMode GetWeightPatchSourceMode(const class FName& InWeightmapLayerName);
	void ReinitializeHeight();
	void ReinitializeWeights();
	void RemoveAllWeightPatches();
	void RemoveWeightPatch(const class FName& InWeightmapLayerName);
	void ResetHeightEncodingMode(ELandscapeTextureHeightPatchEncoding EncodingMode);
	void SetBlendMode(ELandscapeTexturePatchBlendMode BlendModeIn);
	void SetEditVisibilityLayer(const class FName& InWeightmapLayerName, const bool bEditVisibilityLayer);
	void SetFalloff(float FalloffIn);
	void SetHeightEncodingMode(ELandscapeTextureHeightPatchEncoding EncodingMode);
	void SetHeightEncodingSettings(const struct FLandscapeTexturePatchEncodingSettings& Settings);
	void SetHeightRenderTargetFormat(ETextureRenderTargetFormat Format);
	void SetHeightSourceMode(ELandscapeTexturePatchSourceMode NewMode);
	void SetHeightTextureAsset(class UTexture* TextureIn);
	void SetResolution(const struct FVector2D& ResolutionIn);
	void SetUnscaledCoverage(const struct FVector2D& Coverage);
	void SetUseAlphaChannelForHeight(bool bUse);
	void SetUseAlphaChannelForWeightPatch(const class FName& InWeightmapLayerName, bool bUseAlphaChannel);
	void SetWeightPatchBlendModeOverride(const class FName& InWeightmapLayerName, ELandscapeTexturePatchBlendMode BlendMode_0);
	void SetWeightPatchSourceMode(const class FName& InWeightmapLayerName, ELandscapeTexturePatchSourceMode NewMode);
	void SetWeightPatchTextureAsset(const class FName& InWeightmapLayerName, class UTexture* TextureIn);
	void SetZeroHeightMeaning(ELandscapeTextureHeightPatchZeroHeightMeaning ZeroHeightMeaningIn);
	void SnapToLandscape();

	struct FVector2D GetFullUnscaledWorldSize() const;
	ELandscapeTexturePatchSourceMode GetHeightSourceMode() const;
	bool GetInitResolutionFromLandscape(float ResolutionMultiplier_0, struct FVector2D* ResolutionOut) const;
	struct FTransform GetPatchToWorldTransform() const;
	struct FVector2D GetResolution() const;
	struct FVector2D GetUnscaledCoverage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeTexturePatch">();
	}
	static class ULandscapeTexturePatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeTexturePatch>();
	}
};

}

