#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LaserGameplayRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "LaserGameplayRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class LaserGameplayRuntime.LaserCapsuleComponent
// 0x0010 (0x05B0 - 0x05A0)
class ULaserCapsuleComponent final : public UCapsuleComponent
{
public:
	ECollisionEnabled                             CollisionWhenEnabled;                              // 0x05A0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionEnabled                             CollisionWhenDisabled;                             // 0x05A1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A2[0xE];                                      // 0x05A2(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LaserCapsuleComponent">();
	}
	static class ULaserCapsuleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULaserCapsuleComponent>();
	}
};

// Class LaserGameplayRuntime.LaserGridEditorComponent
// 0x0008 (0x00A8 - 0x00A0)
class ULaserGridEditorComponent final : public UActorComponent
{
public:
	int32                                         VisualizeLaserGridPatternIndex;                    // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVisualizeOutletIndex;                             // 0x00A4(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LaserGridEditorComponent">();
	}
	static class ULaserGridEditorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULaserGridEditorComponent>();
	}
};

// Class LaserGameplayRuntime.BuildingGameplayActorLaserGrid
// 0x0418 (0x0D90 - 0x0978)
class ABuildingGameplayActorLaserGrid final : public ABuildingGameplayActor
{
public:
	TMulticastInlineDelegate<void(class ABuildingGameplayActorLaserGrid* LaserGrid, const struct FLaserGridConnectionEntry& LaserConnectionData, class AActor* TriggeringActor)> OnLaserGridTriggered; // 0x0978(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ABuildingGameplayActorLaserGrid* LaserGrid)> OnLaserGridOutletDestroyed; // 0x0988(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FLaserGridPattern>              LaserGridPatterns;                                 // 0x0998(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         LaserPatternChangeWarningTime;                     // 0x09A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<int32, class ABuildingActor*>            LaserOutletToBuildingAttachmentMap;                // 0x09B0(0x0050)(Edit, DisableEditOnTemplate, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  IgnoreActorTags;                                   // 0x0A00(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ULaserCapsuleComponent>     LaserCapsuleComponentClass;                        // 0x0A20(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               LaserCapsuleCollisionRotationOffset;               // 0x0A28(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         LaserCustomDataIndexForRandomizedVisuals;          // 0x0A40(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A44[0x4];                                      // 0x0A44(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLaserGridConnectionArray              LaserGridConnections;                              // 0x0A48(0x0118)(Net, Transient, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FLaserGridConnectionEntry>      LocalLaserGridConnections;                         // 0x0B60(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FTransform                             LaserConnectionOffset;                             // 0x0B70(0x0060)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LaserOutletConnectionOffset;                       // 0x0BD0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             SoundOutletTransitionOn;                           // 0x0BE8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             SoundLaserTransitionPrimaryOutlet;                 // 0x0BF0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             SoundLaserTransitionSecondaryOutlet;               // 0x0BF8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             SoundLaserTransition;                              // 0x0C00(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutletMaterialCustomDataIndex_EmissiveEnabled;     // 0x0C08(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutletMaterialCustomDataIndex_DisableEmissivePulse; // 0x0C0C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutletMaterialCustomDataIndex_AnimTimestamp;       // 0x0C10(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutletMaterialCustomDataIndex_AnimTimestampDuration; // 0x0C14(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaterialCosineWavePeriod;                          // 0x0C18(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1C[0x4];                                      // 0x0C1C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector2D                              OutletMaterialTransitionOffTimestampOffset;        // 0x0C20(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LaserMaterialCustomDataIndex_PulseEnabled;         // 0x0C30(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LaserMaterialCustomDataIndex_RandomFlickeringSpeed; // 0x0C34(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LaserMaterialCustomDataIndex_AnimTimestamp;        // 0x0C38(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LaserMaterialCustomDataIndex_PulseTimeOffset;      // 0x0C3C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              LaserMaterialRandomFlickeringSpeed;                // 0x0C40(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLaserGridOutletArray                  LaserGridOutlets;                                  // 0x0C50(0x0120)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	class UHierarchicalInstancedStaticMeshComponent* HISMComponentOutlet;                            // 0x0D70(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHierarchicalInstancedStaticMeshComponent* HISMComponentLaser;                             // 0x0D78(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0D80(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D81[0x3];                                      // 0x0D81(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         LaserGridPatternIndex;                             // 0x0D84(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           LaserPatternTimerHandle;                           // 0x0D88(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CosmeticDestroyOutletInstance(const struct FLaserGridOutletEntry& OutletEntry);
	void HandleAttachedBuildingActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& Momentum);
	void HandleLaserCollisionOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void HandlePatternTimerComplete_PostTransition();
	void HandlePatternTimerComplete_PreTransition();
	void LaserGridStateUpdated(bool bLaserGridEnabled);
	void LaserGridTriggered(const struct FLaserGridConnectionEntry& LaserConnectionData, class AActor* TriggeringActor);
	void OnRep_bEnabled();
	void OnRep_LaserGridConnections();
	void SetLaserGridEnable(const bool bEnable);

	bool CanActorTriggerLaserGrid(const class AActor* TriggeringActor) const;
	void GetActiveLaserGridConnections(TArray<struct FLaserGridConnectionEntry>* OutActiveLaserGridConnections) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingGameplayActorLaserGrid">();
	}
	static class ABuildingGameplayActorLaserGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuildingGameplayActorLaserGrid>();
	}
};

}

