#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LaserGameplayRuntime

#include "Basic.hpp"

#include "NetCore_structs.hpp"


namespace SDK
{

// Enum LaserGameplayRuntime.ELaserConnectionState
// NumValues: 0x0005
enum class ELaserConnectionState : uint8
{
	Off                                      = 0,
	TransitionOn                             = 1,
	On                                       = 2,
	TransitionOff                            = 3,
	ELaserConnectionState_MAX                = 4,
};

// ScriptStruct LaserGameplayRuntime.LaserOutletConnection
// 0x0002 (0x0002 - 0x0000)
struct FLaserOutletConnection final
{
public:
	uint8                                         PrimaryOutletIndex;                                // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         SecondaryOutletIndex;                              // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct LaserGameplayRuntime.LaserGridConnectionEntry
// 0x000C (0x0018 - 0x000C)
struct FLaserGridConnectionEntry final : public FFastArraySerializerItem
{
public:
	struct FLaserOutletConnection                 OutletConnection;                                  // 0x000C(0x0002)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ELaserConnectionState                         State;                                             // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	class ULaserCapsuleComponent*                 LaserCapsuleComponent;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, RepSkip, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct LaserGameplayRuntime.LaserGridConnectionArray
// 0x0010 (0x0118 - 0x0108)
struct FLaserGridConnectionArray final : public FFastArraySerializer
{
public:
	TArray<struct FLaserGridConnectionEntry>      Entries;                                           // 0x0108(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct LaserGameplayRuntime.LaserGridOutletEntry
// 0x0004 (0x0010 - 0x000C)
struct FLaserGridOutletEntry final : public FFastArraySerializerItem
{
public:
	uint8                                         InstanceIndex;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELaserConnectionState                         State;                                             // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct LaserGameplayRuntime.LaserGridOutletArray
// 0x0018 (0x0120 - 0x0108)
struct FLaserGridOutletArray final : public FFastArraySerializer
{
public:
	TArray<struct FLaserGridOutletEntry>          Entries;                                           // 0x0108(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct LaserGameplayRuntime.LaserGridPattern
// 0x0018 (0x0018 - 0x0000)
struct FLaserGridPattern final
{
public:
	TArray<struct FLaserOutletConnection>         OutletConnections;                                 // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

