#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LauncherSocialDefaults

#include "Basic.hpp"

#include "LauncherSocialTypes_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class LauncherSocialDefaults.ChatColorSchemeDataAsset
// 0x0120 (0x0150 - 0x0030)
class UChatColorSchemeDataAsset final : public UDataAsset
{
public:
	struct FChatColorScheme                       ChatColorData;                                     // 0x0030(0x0120)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatColorSchemeDataAsset">();
	}
	static class UChatColorSchemeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatColorSchemeDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialActionButtonStyleDataAsset
// 0x03B0 (0x03E0 - 0x0030)
class USocialActionButtonStyleDataAsset final : public UDataAsset
{
public:
	struct FButtonStyle                           style;                                             // 0x0030(0x03B0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialActionButtonStyleDataAsset">();
	}
	static class USocialActionButtonStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialActionButtonStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatChromeColorSchemeDataAsset
// 0x0050 (0x0080 - 0x0030)
class USocialChatChromeColorSchemeDataAsset final : public UDataAsset
{
public:
	struct FChatChromeColorScheme                 style;                                             // 0x0030(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChromeColorSchemeDataAsset">();
	}
	static class USocialChatChromeColorSchemeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeColorSchemeDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatChromeMarginsDataAsset
// 0x0068 (0x0098 - 0x0030)
class USocialChatChromeMarginsDataAsset final : public UDataAsset
{
public:
	struct FChatChromeMargins                     style;                                             // 0x0030(0x0064)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChromeMarginsDataAsset">();
	}
	static class USocialChatChromeMarginsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeMarginsDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatChromeStyleDataAsset
// 0x0B50 (0x0B80 - 0x0030)
class USocialChatChromeStyleDataAsset final : public UDataAsset
{
public:
	struct FChatChromeStyle                       style;                                             // 0x0030(0x0B50)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChromeStyleDataAsset">();
	}
	static class USocialChatChromeStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatMarkupStyleDataAsset
// 0x08B0 (0x08E0 - 0x0030)
class USocialChatMarkupStyleDataAsset final : public UDataAsset
{
public:
	struct FChatMarkupStyle                       style;                                             // 0x0030(0x08B0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMarkupStyleDataAsset">();
	}
	static class USocialChatMarkupStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMarkupStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatStyleDataAsset
// 0x2000 (0x2030 - 0x0030)
class USocialChatStyleDataAsset final : public UDataAsset
{
public:
	struct FChatStyle                             style;                                             // 0x0030(0x2000)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatStyleDataAsset">();
	}
	static class USocialChatStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialCheckBoxStyleDataAsset
// 0x0A10 (0x0A40 - 0x0030)
class USocialCheckBoxStyleDataAsset final : public UDataAsset
{
public:
	struct FCheckBoxStyle                         style;                                             // 0x0030(0x0A10)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialCheckBoxStyleDataAsset">();
	}
	static class USocialCheckBoxStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialCheckBoxStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialFontStyleDataAsset
// 0x0240 (0x0270 - 0x0030)
class USocialFontStyleDataAsset final : public UDataAsset
{
public:
	struct FSocialFontStyle                       style;                                             // 0x0030(0x0240)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialFontStyleDataAsset">();
	}
	static class USocialFontStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFontStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialListMarginsDataAsset
// 0x0210 (0x0240 - 0x0030)
class USocialListMarginsDataAsset final : public UDataAsset
{
public:
	struct FSocialListMargins                     style;                                             // 0x0030(0x0210)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListMarginsDataAsset">();
	}
	static class USocialListMarginsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListMarginsDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialListStyleDataAsset
// 0x3A60 (0x3A90 - 0x0030)
class USocialListStyleDataAsset final : public UDataAsset
{
public:
	struct FSocialListStyle                       style;                                             // 0x0030(0x3A60)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListStyleDataAsset">();
	}
	static class USocialListStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialProfanityDataAsset
// 0x0010 (0x0040 - 0x0030)
class USocialProfanityDataAsset final : public UDataAsset
{
public:
	TArray<struct FProfanityData>                 ProfanityData;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialProfanityDataAsset">();
	}
	static class USocialProfanityDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialProfanityDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialRadioBoxStyleDataAsset
// 0x0A10 (0x0A40 - 0x0030)
class USocialRadioBoxStyleDataAsset final : public UDataAsset
{
public:
	struct FCheckBoxStyle                         style;                                             // 0x0030(0x0A10)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialRadioBoxStyleDataAsset">();
	}
	static class USocialRadioBoxStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialRadioBoxStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialScrollBarStyleDataAsset
// 0x06E0 (0x0710 - 0x0030)
class USocialScrollBarStyleDataAsset final : public UDataAsset
{
public:
	struct FScrollBarStyle                        style;                                             // 0x0030(0x06E0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialScrollBarStyleDataAsset">();
	}
	static class USocialScrollBarStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialScrollBarStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialSoundSchemaDataAsset
// 0x0048 (0x0078 - 0x0030)
class USocialSoundSchemaDataAsset final : public UDataAsset
{
public:
	struct FSocialSoundSchema                     SoundSchema;                                       // 0x0030(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialSoundSchemaDataAsset">();
	}
	static class USocialSoundSchemaDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialSoundSchemaDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialStyleDataAsset
// 0x9AE0 (0x9B10 - 0x0030)
class alignas(0x10) USocialStyleDataAsset final : public UDataAsset
{
public:
	class USocialFontStyleDataAsset*              SmallFontStyle;                                    // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              NormalFontStyle;                                   // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              LargeFontStyle;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              ChatFontStyle;                                     // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialListStyleDataAsset*              SocialListStyle;                                   // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialListMarginsDataAsset*            SocialListMargins;                                 // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatStyleDataAsset*              ChatStyle;                                         // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeStyleDataAsset*        ChatChromeStyle;                                   // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeMarginsDataAsset*      ChatChromeMargins;                                 // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeColorSchemeDataAsset*  ChatChromeColorScheme;                             // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatColorSchemeDataAsset*              ChatColorScheme;                                   // 0x0080(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialSoundSchemaDataAsset*            SoundSchema;                                       // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialActionButtonStyleDataAsset*      ActionButtonStyle;                                 // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialCheckBoxStyleDataAsset*          CheckBoxStyle;                                     // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialRadioBoxStyleDataAsset*          RadioBoxStyle;                                     // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialScrollBarStyleDataAsset*         ScrollBoxStyle;                                    // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatMarkupStyleDataAsset*        MarkupStyle;                                       // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialProfanityDataAsset*              ProfanityDataAsset;                                // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x9A50];                                    // 0x00C0(0x9A50)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialStyleDataAsset">();
	}
	static class USocialStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialStyleDataAsset>();
	}
};

}

