#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LearningAgentsTraining

#include "Basic.hpp"

#include "LearningAgentsTraining_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LearningAgentsTraining.ConditionalCompletion.AddConditionalCompletion
// 0x0018 (0x0018 - 0x0000)
struct ConditionalCompletion_AddConditionalCompletion final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELearningAgentsCompletion                     InCompletionMode;                                  // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UConditionalCompletion*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.ConditionalCompletion.SetConditionalCompletion
// 0x0008 (0x0008 - 0x0000)
struct ConditionalCompletion_SetConditionalCompletion final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCompleted;                                      // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.TimeElapsedCompletion.AddTimeElapsedCompletion
// 0x0020 (0x0020 - 0x0000)
struct TimeElapsedCompletion_AddTimeElapsedCompletion final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELearningAgentsCompletion                     InCompletionMode;                                  // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimeElapsedCompletion*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.TimeElapsedCompletion.SetTimeElapsedCompletion
// 0x0008 (0x0008 - 0x0000)
struct TimeElapsedCompletion_SetTimeElapsedCompletion final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PlanarPositionDifferenceCompletion.AddPlanarPositionDifferenceCompletion
// 0x0050 (0x0050 - 0x0000)
struct PlanarPositionDifferenceCompletion_AddPlanarPositionDifferenceCompletion final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELearningAgentsCompletion                     InCompletionMode;                                  // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Axis0;                                             // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Axis1;                                             // 0x0030(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlanarPositionDifferenceCompletion*    ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PlanarPositionDifferenceCompletion.SetPlanarPositionDifferenceCompletion
// 0x0038 (0x0038 - 0x0000)
struct PlanarPositionDifferenceCompletion_SetPlanarPositionDifferenceCompletion final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Position0;                                         // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position1;                                         // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PlanarPositionSimilarityCompletion.AddPlanarPositionSimilarityCompletion
// 0x0050 (0x0050 - 0x0000)
struct PlanarPositionSimilarityCompletion_AddPlanarPositionSimilarityCompletion final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELearningAgentsCompletion                     InCompletionMode;                                  // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Axis0;                                             // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Axis1;                                             // 0x0030(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlanarPositionSimilarityCompletion*    ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PlanarPositionSimilarityCompletion.SetPlanarPositionSimilarityCompletion
// 0x0038 (0x0038 - 0x0000)
struct PlanarPositionSimilarityCompletion_SetPlanarPositionSimilarityCompletion final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Position0;                                         // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position1;                                         // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsImitationTrainer.BeginTraining
// 0x0068 (0x0068 - 0x0000)
struct LearningAgentsImitationTrainer_BeginTraining final
{
public:
	class ULearningAgentsPolicy*                  InPolicy;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULearningAgentsRecording*         Recording;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsImitationTrainerSettings ImitationTrainerSettings;                         // 0x0010(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsImitationTrainerTrainingSettings ImitationTrainerTrainingSettings;         // 0x0014(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsTrainerPathSettings     ImitationTrainerPathSettings;                      // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bReinitializePolicyNetwork;                        // 0x0060(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.LearningAgentsImitationTrainer.RunTraining
// 0x0068 (0x0068 - 0x0000)
struct LearningAgentsImitationTrainer_RunTraining final
{
public:
	class ULearningAgentsPolicy*                  InPolicy;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULearningAgentsRecording*         Recording;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsImitationTrainerSettings ImitationTrainerSettings;                         // 0x0010(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsImitationTrainerTrainingSettings ImitationTrainerTrainingSettings;         // 0x0014(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsTrainerPathSettings     ImitationTrainerPathSettings;                      // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bReinitializePolicyNetwork;                        // 0x0060(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.LearningAgentsImitationTrainer.HasTrainingFailed
// 0x0001 (0x0001 - 0x0000)
struct LearningAgentsImitationTrainer_HasTrainingFailed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsImitationTrainer.IsTraining
// 0x0001 (0x0001 - 0x0000)
struct LearningAgentsImitationTrainer_IsTraining final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.AppendRecordingFromFile
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsRecorder_AppendRecordingFromFile final
{
public:
	struct FFilePath                              File;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.AppendRecordingToAsset
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecorder_AppendRecordingToAsset final
{
public:
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.BeginRecording
// 0x0001 (0x0001 - 0x0000)
struct LearningAgentsRecorder_BeginRecording final
{
public:
	bool                                          bReinitializeRecording;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.LoadRecordingFromAsset
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecorder_LoadRecordingFromAsset final
{
public:
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.LoadRecordingFromFile
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsRecorder_LoadRecordingFromFile final
{
public:
	struct FFilePath                              File;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.SaveRecordingToAsset
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecorder_SaveRecordingToAsset final
{
public:
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.SetupRecorder
// 0x0030 (0x0030 - 0x0000)
struct LearningAgentsRecorder_SetupRecorder final
{
public:
	class ULearningAgentsInteractor*              InInteractor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsRecorderPathSettings    RecorderPathSettings;                              // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.UseRecordingAsset
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecorder_UseRecordingAsset final
{
public:
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.GetCurrentRecording
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecorder_GetCurrentRecording final
{
public:
	const class ULearningAgentsRecording*         ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.IsRecording
// 0x0001 (0x0001 - 0x0000)
struct LearningAgentsRecorder_IsRecording final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecorder.SaveRecordingToFile
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsRecorder_SaveRecordingToFile final
{
public:
	struct FFilePath                              File;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecording.AppendRecordingFromFile
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsRecording_AppendRecordingFromFile final
{
public:
	struct FFilePath                              File;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecording.AppendRecordingToAsset
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecording_AppendRecordingToAsset final
{
public:
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecording.LoadRecordingFromAsset
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecording_LoadRecordingFromAsset final
{
public:
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecording.LoadRecordingFromFile
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsRecording_LoadRecordingFromFile final
{
public:
	struct FFilePath                              File;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecording.SaveRecordingToAsset
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsRecording_SaveRecordingToAsset final
{
public:
	class ULearningAgentsRecording*               RecordingAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsRecording.SaveRecordingToFile
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsRecording_SaveRecordingToFile final
{
public:
	struct FFilePath                              File;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.FloatReward.AddFloatReward
// 0x0018 (0x0018 - 0x0000)
struct FloatReward_AddFloatReward final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFloatReward*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.FloatReward.SetFloatReward
// 0x0008 (0x0008 - 0x0000)
struct FloatReward_SetFloatReward final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Reward;                                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.ConditionalReward.AddConditionalReward
// 0x0018 (0x0018 - 0x0000)
struct ConditionalReward_AddConditionalReward final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConditionalReward*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.ConditionalReward.SetConditionalReward
// 0x0008 (0x0008 - 0x0000)
struct ConditionalReward_SetConditionalReward final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCondition;                                        // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.ScalarVelocityReward.AddScalarVelocityReward
// 0x0020 (0x0020 - 0x0000)
struct ScalarVelocityReward_AddScalarVelocityReward final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UScalarVelocityReward*                  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.ScalarVelocityReward.SetScalarVelocityReward
// 0x0008 (0x0008 - 0x0000)
struct ScalarVelocityReward_SetScalarVelocityReward final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Velocity;                                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LocalDirectionalVelocityReward.AddLocalDirectionalVelocityReward
// 0x0038 (0x0038 - 0x0000)
struct LocalDirectionalVelocityReward_AddLocalDirectionalVelocityReward final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Axis;                                              // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalDirectionalVelocityReward*        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LocalDirectionalVelocityReward.SetLocalDirectionalVelocityReward
// 0x0038 (0x0038 - 0x0000)
struct LocalDirectionalVelocityReward_SetLocalDirectionalVelocityReward final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Velocity;                                          // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation;                                  // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PlanarPositionDifferencePenalty.AddPlanarPositionDifferencePenalty
// 0x0050 (0x0050 - 0x0000)
struct PlanarPositionDifferencePenalty_AddPlanarPositionDifferencePenalty final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Axis0;                                             // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Axis1;                                             // 0x0030(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlanarPositionDifferencePenalty*       ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PlanarPositionDifferencePenalty.SetPlanarPositionDifferencePenalty
// 0x0038 (0x0038 - 0x0000)
struct PlanarPositionDifferencePenalty_SetPlanarPositionDifferencePenalty final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Position0;                                         // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position1;                                         // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PositionArraySimilarityReward.AddPositionArraySimilarityReward
// 0x0020 (0x0020 - 0x0000)
struct PositionArraySimilarityReward_AddPositionArraySimilarityReward final
{
public:
	class ULearningAgentsTrainer*                 InAgentTrainer;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PositionNum;                                       // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPositionArraySimilarityReward*         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.PositionArraySimilarityReward.SetPositionArraySimilarityReward
// 0x0088 (0x0088 - 0x0000)
struct PositionArraySimilarityReward_SetPositionArraySimilarityReward final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVector>                        Positions0;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Positions1;                                        // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                RelativePosition0;                                 // 0x0028(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RelativePosition1;                                 // 0x0040(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation0;                                 // 0x0058(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation1;                                 // 0x0070(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsTrainer.BeginTraining
// 0x0088 (0x0088 - 0x0000)
struct LearningAgentsTrainer_BeginTraining final
{
public:
	struct FLearningAgentsTrainerTrainingSettings TrainerTrainingSettings;                           // 0x0000(0x0044)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsTrainerGameSettings     TrainerGameSettings;                               // 0x0044(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsTrainerPathSettings     TrainerPathSettings;                               // 0x0050(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bReinitializePolicyNetwork;                        // 0x0080(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReinitializeCriticNetwork;                        // 0x0081(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetAgentsOnBegin;                               // 0x0082(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.LearningAgentsTrainer.ResetEpisodes
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsTrainer_ResetEpisodes final
{
public:
	TArray<int32>                                 AgentIds;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsTrainer.RunTraining
// 0x0088 (0x0088 - 0x0000)
struct LearningAgentsTrainer_RunTraining final
{
public:
	struct FLearningAgentsTrainerTrainingSettings TrainerTrainingSettings;                           // 0x0000(0x0044)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsTrainerGameSettings     TrainerGameSettings;                               // 0x0044(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLearningAgentsTrainerPathSettings     TrainerPathSettings;                               // 0x0050(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bReinitializePolicyNetwork;                        // 0x0080(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReinitializeCriticNetwork;                        // 0x0081(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetAgentsOnBegin;                               // 0x0082(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.LearningAgentsTrainer.SetCompletions
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsTrainer_SetCompletions final
{
public:
	TArray<int32>                                 AgentIds;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsTrainer.SetRewards
// 0x0010 (0x0010 - 0x0000)
struct LearningAgentsTrainer_SetRewards final
{
public:
	TArray<int32>                                 AgentIds;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsTrainer.SetupTrainer
// 0x0030 (0x0030 - 0x0000)
struct LearningAgentsTrainer_SetupTrainer final
{
public:
	class ULearningAgentsInteractor*              InInteractor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULearningAgentsPolicy*                  InPolicy;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULearningAgentsCritic*                  InCritic;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsTrainerSettings         TrainerSettings;                                   // 0x0018(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.LearningAgentsTrainer.GetReward
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsTrainer_GetReward final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsTrainer.HasTrainingFailed
// 0x0001 (0x0001 - 0x0000)
struct LearningAgentsTrainer_HasTrainingFailed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LearningAgentsTraining.LearningAgentsTrainer.IsCompleted
// 0x0008 (0x0008 - 0x0000)
struct LearningAgentsTrainer_IsCompleted final
{
public:
	int32                                         AgentId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELearningAgentsCompletion                     OutCompletion;                                     // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LearningAgentsTraining.LearningAgentsTrainer.IsTraining
// 0x0001 (0x0001 - 0x0000)
struct LearningAgentsTrainer_IsTraining final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

