#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LocalizableMessage

#include "Basic.hpp"

#include "StructUtils_structs.hpp"


namespace SDK
{

// ScriptStruct LocalizableMessage.LocalizableMessageParameterEntry
// 0x0020 (0x0020 - 0x0000)
struct FLocalizableMessageParameterEntry final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       Value;                                             // 0x0010(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct LocalizableMessage.LocalizableMessage
// 0x0030 (0x0030 - 0x0000)
struct FLocalizableMessage final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultText;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLocalizableMessageParameterEntry> Substitutions;                                  // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct LocalizableMessage.LocalizableMessageParameterInt
// 0x0008 (0x0008 - 0x0000)
struct FLocalizableMessageParameterInt final
{
public:
	int64                                         Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LocalizableMessage.LocalizableMessageParameterFloat
// 0x0008 (0x0008 - 0x0000)
struct FLocalizableMessageParameterFloat final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LocalizableMessage.LocalizableMessageParameterString
// 0x0010 (0x0010 - 0x0000)
struct FLocalizableMessageParameterString final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LocalizableMessage.LocalizableMessageParameterMessage
// 0x0030 (0x0030 - 0x0000)
struct FLocalizableMessageParameterMessage final
{
public:
	struct FLocalizableMessage                    Value;                                             // 0x0000(0x0030)(NativeAccessSpecifierPublic)
};

}

