#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MannequinRuntime

#include "Basic.hpp"

#include "MannequinRuntime_structs.hpp"


namespace SDK::Params
{

// Function MannequinRuntime.MannequinAnalyticsComponent.FireMannequinAnalytics_Interact
// 0x0020 (0x0020 - 0x0000)
struct MannequinAnalyticsComponent_FireMannequinAnalytics_Interact final
{
public:
	class AFortPlayerController*                  Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECreativeMannequinAnalyticsInteractType       InteractType;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	const class UFortItemDefinition*              Character;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortItemDefinition*              BackBling;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

