#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MassReplication

#include "Basic.hpp"

#include "MassEntity_classes.hpp"
#include "Engine_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "MassReplication_structs.hpp"


namespace SDK
{

// Class MassReplication.MassClientBubbleInfoBase
// 0x0018 (0x02A8 - 0x0290)
class AMassClientBubbleInfoBase final : public AInfo
{
public:
	uint8                                         Pad_290[0x18];                                     // 0x0290(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassClientBubbleInfoBase">();
	}
	static class AMassClientBubbleInfoBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassClientBubbleInfoBase>();
	}
};

// Class MassReplication.MassNetworkIDFragmentInitializer
// 0x02A8 (0x0380 - 0x00D8)
class UMassNetworkIDFragmentInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassNetworkIDFragmentInitializer">();
	}
	static class UMassNetworkIDFragmentInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassNetworkIDFragmentInitializer>();
	}
};

// Class MassReplication.MassReplicationGridProcessor
// 0x07E0 (0x08A0 - 0x00C0)
class UMassReplicationGridProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x7E0];                                     // 0x00C0(0x07E0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationGridProcessor">();
	}
	static class UMassReplicationGridProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationGridProcessor>();
	}
};

// Class MassReplication.MassReplicationGridRemoverProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassReplicationGridRemoverProcessor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationGridRemoverProcessor">();
	}
	static class UMassReplicationGridRemoverProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationGridRemoverProcessor>();
	}
};

// Class MassReplication.MassReplicationProcessor
// 0x0D30 (0x0DF0 - 0x00C0)
class alignas(0x10) UMassReplicationProcessor final : public UMassProcessor
{
public:
	class UMassReplicationSubsystem*              ReplicationSubsystem;                              // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0xD28];                                     // 0x00C8(0x0D28)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationProcessor">();
	}
	static class UMassReplicationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationProcessor>();
	}
};

// Class MassReplication.MassReplicatorBase
// 0x0000 (0x0028 - 0x0028)
class UMassReplicatorBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicatorBase">();
	}
	static class UMassReplicatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicatorBase>();
	}
};

// Class MassReplication.MassReplicationSettings
// 0x0008 (0x0030 - 0x0028)
class UMassReplicationSettings final : public UMassModuleSettings
{
public:
	float                                         ReplicationGridCellSize;                           // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationSettings">();
	}
	static class UMassReplicationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationSettings>();
	}
};

// Class MassReplication.MassReplicationSubsystem
// 0x01B0 (0x01E0 - 0x0030)
class UMassReplicationSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FMassClientBubbleInfoData>      BubbleInfoArray;                                   // 0x0060(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class UWorld*                                 World;                                             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassLODSubsystem*                      MassLODSubsystem;                                  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x130];                                     // 0x00B0(0x0130)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationSubsystem">();
	}
	static class UMassReplicationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationSubsystem>();
	}
};

// Class MassReplication.MassReplicationTrait
// 0x0058 (0x0080 - 0x0028)
class UMassReplicationTrait final : public UMassEntityTraitBase
{
public:
	struct FMassReplicationParameters             Params_0;                                          // 0x0028(0x0058)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationTrait">();
	}
	static class UMassReplicationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationTrait>();
	}
};

}

