#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MassSimulation

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"


namespace SDK
{

// Class MassSimulation.MassSimulationSettings
// 0x0028 (0x0050 - 0x0028)
class UMassSimulationSettings final : public UMassModuleSettings
{
public:
	double                                        DesiredActorSpawningTimeSlicePerTick;              // 0x0028(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DesiredActorDestructionTimeSlicePerTick;           // 0x0030(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEntityCompactionEnabled;                          // 0x0038(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        DesiredEntityCompactionTimeSlicePerTick;           // 0x0040(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredActorFailedSpawningRetryTimeInterval;       // 0x0048(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredActorFailedSpawningRetryMoveDistance;       // 0x004C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationSettings">();
	}
	static class UMassSimulationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationSettings>();
	}
};

// Class MassSimulation.MassSimulationSubsystem
// 0x0478 (0x04A8 - 0x0030)
class UMassSimulationSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x460];                                     // 0x0030(0x0460)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMassRuntimePipeline                   RuntimePipeline;                                   // 0x0490(0x0010)(Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A0[0x8];                                      // 0x04A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationSubsystem">();
	}
	static class UMassSimulationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationSubsystem>();
	}
};

}

