#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MassSmartObjects

#include "Basic.hpp"

#include "ZoneGraphAnnotations_classes.hpp"
#include "MassEntity_classes.hpp"
#include "SmartObjectsModule_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "MassSmartObjects_structs.hpp"


namespace SDK
{

// Class MassSmartObjects.SmartObjectMassBehaviorDefinition
// 0x0008 (0x0030 - 0x0028)
class USmartObjectMassBehaviorDefinition final : public USmartObjectBehaviorDefinition
{
public:
	float                                         UseTime;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectMassBehaviorDefinition">();
	}
	static class USmartObjectMassBehaviorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectMassBehaviorDefinition>();
	}
};

// Class MassSmartObjects.MassSmartObjectCandidatesFinderProcessor
// 0x0550 (0x0610 - 0x00C0)
class UMassSmartObjectCandidatesFinderProcessor final : public UMassProcessor
{
public:
	float                                         SearchExtents;                                     // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C4[0x54C];                                     // 0x00C4(0x054C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectCandidatesFinderProcessor">();
	}
	static class UMassSmartObjectCandidatesFinderProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectCandidatesFinderProcessor>();
	}
};

// Class MassSmartObjects.MassSmartObjectTimedBehaviorProcessor
// 0x02A0 (0x0360 - 0x00C0)
class UMassSmartObjectTimedBehaviorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x2A0];                                     // 0x00C0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectTimedBehaviorProcessor">();
	}
	static class UMassSmartObjectTimedBehaviorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectTimedBehaviorProcessor>();
	}
};

// Class MassSmartObjects.MassSmartObjectUserFragmentDeinitializer
// 0x02A8 (0x0380 - 0x00D8)
class UMassSmartObjectUserFragmentDeinitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectUserFragmentDeinitializer">();
	}
	static class UMassSmartObjectUserFragmentDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserFragmentDeinitializer>();
	}
};

// Class MassSmartObjects.MassSmartObjectSettings
// 0x0008 (0x0030 - 0x0028)
class UMassSmartObjectSettings final : public UMassModuleSettings
{
public:
	struct FZoneGraphTag                          SmartObjectTag;                                    // 0x0028(0x0001)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SearchExtents;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectSettings">();
	}
	static class UMassSmartObjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectSettings>();
	}
};

// Class MassSmartObjects.MassSmartObjectUserTrait
// 0x0020 (0x0048 - 0x0028)
class UMassSmartObjectUserTrait final : public UMassEntityTraitBase
{
public:
	struct FGameplayTagContainer                  UserTags;                                          // 0x0028(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectUserTrait">();
	}
	static class UMassSmartObjectUserTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserTrait>();
	}
};

// Class MassSmartObjects.SmartObjectZoneAnnotations
// 0x0030 (0x0620 - 0x05F0)
class USmartObjectZoneAnnotations final : public UZoneGraphAnnotationComponent
{
public:
	struct FZoneGraphTagFilter                    AffectedLaneTags;                                  // 0x05E8(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FSmartObjectAnnotationData>     SmartObjectAnnotationDataArray;                    // 0x05F8(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          BehaviorTag;                                       // 0x0608(0x0001)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USmartObjectSubsystem*                  SmartObjectSubsystem;                              // 0x0610(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_618[0x8];                                      // 0x0618(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectZoneAnnotations">();
	}
	static class USmartObjectZoneAnnotations* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectZoneAnnotations>();
	}
};

}

