#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MassGameplayDebug

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassSpawner_classes.hpp"


namespace SDK
{

// Class MassGameplayDebug.AssignDebugVisProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UAssignDebugVisProcessor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssignDebugVisProcessor">();
	}
	static class UAssignDebugVisProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssignDebugVisProcessor>();
	}
};

// Class MassGameplayDebug.DebugVisLocationProcessor
// 0x02A0 (0x0360 - 0x00C0)
class UDebugVisLocationProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x2A0];                                     // 0x00C0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DebugVisLocationProcessor">();
	}
	static class UDebugVisLocationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugVisLocationProcessor>();
	}
};

// Class MassGameplayDebug.MassProcessor_UpdateDebugVis
// 0x02A0 (0x0360 - 0x00C0)
class UMassProcessor_UpdateDebugVis final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x2A0];                                     // 0x00C0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassProcessor_UpdateDebugVis">();
	}
	static class UMassProcessor_UpdateDebugVis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassProcessor_UpdateDebugVis>();
	}
};

// Class MassGameplayDebug.MassDebuggerSubsystem
// 0x0098 (0x00C8 - 0x0030)
class UMassDebuggerSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x80];                                      // 0x0030(0x0080)(Fixing Size After Last Property [ Dumper-8 ])
	class UMassDebugVisualizationComponent*       VisualizationComponent;                            // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AMassDebugVisualizer*                   DebugVisualizer;                                   // 0x00B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassDebuggerSubsystem">();
	}
	static class UMassDebuggerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDebuggerSubsystem>();
	}
};

// Class MassGameplayDebug.MassDebugVisualizationComponent
// 0x0000 (0x00A0 - 0x00A0)
class UMassDebugVisualizationComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassDebugVisualizationComponent">();
	}
	static class UMassDebugVisualizationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDebugVisualizationComponent>();
	}
};

// Class MassGameplayDebug.MassDebugVisualizationTrait
// 0x0000 (0x0028 - 0x0028)
class UMassDebugVisualizationTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassDebugVisualizationTrait">();
	}
	static class UMassDebugVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDebugVisualizationTrait>();
	}
};

// Class MassGameplayDebug.MassDebugVisualizer
// 0x0000 (0x0290 - 0x0290)
class AMassDebugVisualizer final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassDebugVisualizer">();
	}
	static class AMassDebugVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassDebugVisualizer>();
	}
};

}

