#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MassLOD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassLOD_structs.hpp"
#include "MassSpawner_classes.hpp"


namespace SDK
{

// Class MassLOD.MassLODCollectorProcessor
// 0x0A90 (0x0B50 - 0x00C0)
class UMassLODCollectorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0xA90];                                     // 0x00C0(0x0A90)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLODCollectorProcessor">();
	}
	static class UMassLODCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODCollectorProcessor>();
	}
};

// Class MassLOD.MassLODSubsystem
// 0x00B8 (0x00F8 - 0x0040)
class UMassLODSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         bGatherPlayerControllers : 1;                      // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGatherStreamingSources : 1;                       // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FViewerInfo>                    Viewers;                                           // 0x0048(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<uint32, struct FMassViewerHandle>        ViewerMap;                                         // 0x0058(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnPlayerControllerEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLODSubsystem">();
	}
	static class UMassLODSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODSubsystem>();
	}
};

// Class MassLOD.MassLODCollectorTrait
// 0x0000 (0x0028 - 0x0028)
class UMassLODCollectorTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLODCollectorTrait">();
	}
	static class UMassLODCollectorTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODCollectorTrait>();
	}
};

// Class MassLOD.MassSimulationLODTrait
// 0x0040 (0x0068 - 0x0028)
class UMassSimulationLODTrait final : public UMassEntityTraitBase
{
public:
	struct FMassSimulationLODParameters           Params_0;                                          // 0x0028(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bEnableVariableTicking;                            // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMassSimulationVariableTickParameters  VariableTickParams;                                // 0x0054(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationLODTrait">();
	}
	static class UMassSimulationLODTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationLODTrait>();
	}
};

// Class MassLOD.MassSimulationLODProcessor
// 0x0D30 (0x0DF0 - 0x00C0)
class UMassSimulationLODProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0xD20];                                     // 0x00C0(0x0D20)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bDoAdjustmentFromCount;                            // 0x0DE0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DE1[0xF];                                      // 0x0DE1(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationLODProcessor">();
	}
	static class UMassSimulationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationLODProcessor>();
	}
};

}

