#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MatchmakingPortalUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MatchmakingPortalUI.FortControllerComponent_CreativeMatchmaking.OnCreativeReadyCheckStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_CreativeMatchmaking_OnCreativeReadyCheckStatusChanged final
{
public:
	EInGameReadyCheckStatus                       InGameReadyCheckStatus;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortCreativeMatchmakingFeedback.BP_OnCreativeReadyCheckStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeMatchmakingFeedback_BP_OnCreativeReadyCheckStatusChanged final
{
public:
	EInGameReadyCheckStatus                       InGameReadyCheckStatus;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortCreativeMatchmakingFeedback.OnCreativeReadyCheckStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeMatchmakingFeedback_OnCreativeReadyCheckStatusChanged final
{
public:
	EInGameReadyCheckStatus                       InGameReadyCheckStatus;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortCreativeMatchmakingFeedback.OnLockStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeMatchmakingFeedback_OnLockStateChanged final
{
public:
	bool                                          bLockState;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortCreativeMatchmakingFeedback.CanCancelMatchmaking
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeMatchmakingFeedback_CanCancelMatchmaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortCreativeMatchmakingFeedback.GetTimeToDisplayMessageBeforeFadeOut
// 0x0004 (0x0004 - 0x0000)
struct FortCreativeMatchmakingFeedback_GetTimeToDisplayMessageBeforeFadeOut final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortCreativeMatchmakingFeedback.IsLocalPlayerReady
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeMatchmakingFeedback_IsLocalPlayerReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortCreativeMatchmakingFeedback.IsPartyLeader
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeMatchmakingFeedback_IsPartyLeader final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.GetIslandData
// 0x0070 (0x0070 - 0x0000)
struct FortMatchmakingPortalPopup_GetIslandData final
{
public:
	struct FMatchmakingPortalPopupData            OutIslandData;                                     // 0x0000(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UHeaderDescriptionHUDComponent*         HUDComponent;                                      // 0x0060(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleHUDShow
// 0x0002 (0x0002 - 0x0000)
struct FortMatchmakingPortalPopup_HandleHUDShow final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAnimate;                                    // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleLoadScreenChanged
// 0x0028 (0x0028 - 0x0000)
struct FortMatchmakingPortalPopup_HandleLoadScreenChanged final
{
public:
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadScreenEnabled;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   HUDReason;                                         // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleOnPortalDetailsVisibilityCheck
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalPopup_HandleOnPortalDetailsVisibilityCheck final
{
public:
	bool                                          bShowWidget;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleStartedRespawn
// 0x0008 (0x0008 - 0x0000)
struct FortMatchmakingPortalPopup_HandleStartedRespawn final
{
public:
	class AFortPlayerControllerZone*              PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.IsInteractingDeviceAMatchmakingPortal
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalPopup_IsInteractingDeviceAMatchmakingPortal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.OnPlayerCanInteractChanged
// 0x0020 (0x0020 - 0x0000)
struct FortMatchmakingPortalPopup_OnPlayerCanInteractChanged final
{
public:
	bool                                          bPlayerCanInteract;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Message;                                           // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.OnShowPortalPopup
// 0x0002 (0x0002 - 0x0000)
struct FortMatchmakingPortalPopup_OnShowPortalPopup final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimate;                                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.UpdateVisuals
// 0x0008 (0x0008 - 0x0000)
struct FortMatchmakingPortalPopup_UpdateVisuals final
{
public:
	const class UHeaderDescriptionHUDComponent*   HUDComponent;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.GetMatchmakingFeedbackWidget
// 0x0010 (0x0010 - 0x0000)
struct FortMatchmakingPortalPopup_GetMatchmakingFeedbackWidget final
{
public:
	const class UCommonActivatableWidget*         MatchmakingFeedbackContainer;                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAthenaCreativeMatchmakingWidget*   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HasActivityToShow
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalPopup_HasActivityToShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortModalBackground.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortModalBackground_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	const class UTexture*                         InTexture;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

