#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MediaPlate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MediaPlate.MediaPlateComponent.GetLetterboxAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct MediaPlateComponent_GetLetterboxAspectRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.GetLoop
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_GetLoop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.GetMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct MediaPlateComponent_GetMediaPlayer final
{
public:
	class UMediaPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.GetMediaTexture
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_GetMediaTexture final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMediaTexture*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.OnMediaOpened
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_OnMediaOpened final
{
public:
	class FString                                 DeviceUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.Rewind
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_Rewind final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.Seek
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_Seek final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function MediaPlate.MediaPlateComponent.SetIsAspectRatioAuto
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_SetIsAspectRatioAuto final
{
public:
	bool                                          bInIsAspectRatioAuto;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.SetLetterboxAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct MediaPlateComponent_SetLetterboxAspectRatio final
{
public:
	float                                         AspectRatio;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.SetLoop
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_SetLoop final
{
public:
	bool                                          bInLoop;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.SetMeshRange
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_SetMeshRange final
{
public:
	struct FVector2D                              InMeshRange;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.SetPlayOnlyWhenVisible
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_SetPlayOnlyWhenVisible final
{
public:
	bool                                          bInPlayOnlyWhenVisible;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.GetIsAspectRatioAuto
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_GetIsAspectRatioAuto final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.GetMeshRange
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_GetMeshRange final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MediaPlate.MediaPlateComponent.IsMediaPlatePlaying
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_IsMediaPlatePlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

