#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MemoryUsageQueries

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct MemoryUsageQueries.CollectionInfo
// 0x0038 (0x0038 - 0x0000)
struct FCollectionInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Includes;                                          // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Excludes;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BudgetMB;                                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

