#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MeshCosmetics

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// ScriptStruct MeshCosmetics.PartHandleControllers
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FPartHandleControllers final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.ApparelCustomizableItemReference
// 0x0020 (0x0020 - 0x0000)
struct FApparelCustomizableItemReference final
{
public:
	class FString                                 GroupName;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ValueName;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectSprayVariantFixedProperties
// 0x0068 (0x0068 - 0x0000)
struct FCustomizableObjectSprayVariantFixedProperties final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpDirection;                                       // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BaseScale;                                         // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseRotation;                                      // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CustomizableObjectSprayVariantSelectablePayload
// 0x0018 (0x00B8 - 0x00A0)
struct FCustomizableObjectSprayVariantSelectablePayload final : public FBaseVariantDef
{
public:
	struct FPrimaryAssetId                        TextureSource;                                     // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Saturation;                                        // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Wear;                                              // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Scale;                                             // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CustomizableObjectSprayVariantMCPPayload
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectSprayVariantMCPPayload final
{
public:
	struct FPrimaryAssetId                        TextureAssetID;                                    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        CompactSaturation;                                 // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        CompactWear;                                       // 0x000A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        CompactScale;                                      // 0x000C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CustomizableObjectSprayVariantPayloadClamps
// 0x0030 (0x0030 - 0x0000)
struct FCustomizableObjectSprayVariantPayloadClamps final
{
public:
	struct FFloatRange                            Saturation;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            Wear;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            Scale;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectSprayVariantSlotImageProperties
// 0x0040 (0x0040 - 0x0000)
struct FCustomizableObjectSprayVariantSlotImageProperties final
{
public:
	TSoftObjectPtr<class UTexture2D>              SprayNotAssignedImage;                             // 0x0000(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              SprayAssignedImage;                                // 0x0020(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectParamVariantBase
// 0x0020 (0x0020 - 0x0000)
struct FCustomizableObjectParamVariantBase
{
public:
	TSoftObjectPtr<class UCustomizableObject>     ObjectToModify;                                    // 0x0000(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectValueBase
// 0x0018 (0x0018 - 0x0000)
struct FCustomizableObjectValueBase
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CustomizableObjectIntValue
// 0x0018 (0x0030 - 0x0018)
struct FCustomizableObjectIntValue final : public FCustomizableObjectValueBase
{
public:
	int32                                         NumericValue;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 NamedValue;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectFloatValue
// 0x0008 (0x0020 - 0x0018)
struct FCustomizableObjectFloatValue final : public FCustomizableObjectValueBase
{
public:
	float                                         Value;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CustomizableObjectBoolValue
// 0x0008 (0x0020 - 0x0018)
struct FCustomizableObjectBoolValue final : public FCustomizableObjectValueBase
{
public:
	bool                                          Value;                                             // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CustomizableObjectVectorValue
// 0x0010 (0x0028 - 0x0018)
struct FCustomizableObjectVectorValue final : public FCustomizableObjectValueBase
{
public:
	struct FLinearColor                           Value;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectTextureValue
// 0x0008 (0x0020 - 0x0018)
struct FCustomizableObjectTextureValue final : public FCustomizableObjectValueBase
{
public:
	class UTexture2D*                             Value;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectProjectorValue
// 0x0068 (0x0080 - 0x0018)
struct FCustomizableObjectProjectorValue final : public FCustomizableObjectValueBase
{
public:
	struct FVector                                Position;                                          // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpDirection;                                       // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0060(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CustomizableObjectStateValue
// 0x0010 (0x0028 - 0x0018)
struct FCustomizableObjectStateValue final : public FCustomizableObjectValueBase
{
public:
	class FString                                 NewState;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectIntParamVariant
// 0x0010 (0x0030 - 0x0020)
struct FCustomizableObjectIntParamVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TArray<struct FCustomizableObjectIntValue>    Parameters;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectFloatParamVariant
// 0x0010 (0x0030 - 0x0020)
struct FCustomizableObjectFloatParamVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TArray<struct FCustomizableObjectFloatValue>  Parameters;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectBoolParamVariant
// 0x0010 (0x0030 - 0x0020)
struct FCustomizableObjectBoolParamVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TArray<struct FCustomizableObjectBoolValue>   Parameters;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectVectorParamVariant
// 0x0010 (0x0030 - 0x0020)
struct FCustomizableObjectVectorParamVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TArray<struct FCustomizableObjectVectorValue> Parameters;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectTextureParamVariant
// 0x0010 (0x0030 - 0x0020)
struct FCustomizableObjectTextureParamVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TArray<struct FCustomizableObjectTextureValue> Parameters;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectProjectorVariant
// 0x0010 (0x0030 - 0x0020)
struct FCustomizableObjectProjectorVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TArray<struct FCustomizableObjectProjectorValue> Parameters;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectMultilayerProjectsVirtualLayer
// 0x0090 (0x0090 - 0x0000)
struct FCustomizableObjectMultilayerProjectsVirtualLayer final
{
public:
	bool                                          bModifyEnabled;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bModifyProjection;                                 // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Position;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0020(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpDirection;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bModifyImage;                                      // 0x006C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Image;                                             // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bModifyOpacity;                                    // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Opacity;                                           // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bModifyOrder;                                      // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Order;                                             // 0x008C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectMultilayerProjectors
// 0x0050 (0x0050 - 0x0000)
struct FCustomizableObjectMultilayerProjectors final
{
public:
	TMap<class FName, struct FCustomizableObjectMultilayerProjectsVirtualLayer> VirtualLayers;       // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectMultilayerProjectorVariant
// 0x0050 (0x0070 - 0x0020)
struct FCustomizableObjectMultilayerProjectorVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TMap<class FName, struct FCustomizableObjectMultilayerProjectors> MultilayerProjectors;          // 0x0020(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectStateVariant
// 0x0010 (0x0030 - 0x0020)
struct FCustomizableObjectStateVariant final : public FCustomizableObjectParamVariantBase
{
public:
	TArray<struct FCustomizableObjectStateValue>  States;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CustomizableObjectParamsVariantDef
// 0x0080 (0x0120 - 0x00A0)
struct FCustomizableObjectParamsVariantDef final : public FBaseVariantDef
{
public:
	TArray<struct FCustomizableObjectIntParamVariant> IntParams;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectFloatParamVariant> FloatParams;                                 // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectBoolParamVariant> BoolParams;                                   // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectVectorParamVariant> VectorParams;                               // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectTextureParamVariant> TextureParams;                             // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectProjectorVariant> ProjectorParams;                              // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectMultilayerProjectorVariant> MultilayerProjectorParams;          // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectStateVariant> StateVariants;                                    // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.MeshCosmeticsCustomizationPerSlotData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FMeshCosmeticsCustomizationPerSlotData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.MeshCosmeticsCustomizableObjectEntry
// 0x02A0 (0x02A0 - 0x0000)
struct alignas(0x08) FMeshCosmeticsCustomizableObjectEntry final
{
public:
	uint8                                         Pad_0[0x2A0];                                      // 0x0000(0x02A0)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.MeshCosmeticsCustomizationCCV2Data
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FMeshCosmeticsCustomizationCCV2Data final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.MeshCosmeticsImageProviderWrapper
// 0x0010 (0x0010 - 0x0000)
struct FMeshCosmeticsImageProviderWrapper final
{
public:
	class UDefaultImageProvider*                  ImageProvider;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.PendingCustomizationComponentsList
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FPendingCustomizationComponentsList final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.LoadedAthenaCosmeticAssets
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FLoadedAthenaCosmeticAssets final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.PendingVariantAssetsToLoad
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FPendingVariantAssetsToLoad final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct MeshCosmetics.CosmeticSlotSelector
// 0x0002 (0x0002 - 0x0000)
struct FCosmeticSlotSelector final
{
public:
	EFortCustomPartType                           LegacyPartType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAthenaCustomizationCategory                  SourceCategory;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.SkeletalComponentData
// 0x0018 (0x0018 - 0x0000)
struct FSkeletalComponentData final
{
public:
	class UMeshCosmeticsLayoutSchema*             LayoutSchema;                                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmeticSlotSelector                  Slot;                                              // 0x0008(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UCustomizableObject*                    CustomizableObject;                                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.CosmeticsLayoutSlot
// 0x0098 (0x0098 - 0x0000)
struct FCosmeticsLayoutSlot final
{
public:
	TSoftObjectPtr<class UCustomizableObject>     SlottedObject;                                     // 0x0000(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentIndex;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmeticSlotSelector                  RequiredCosmeticPart;                              // 0x0024(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftClassPtr<class UClass>                   ProportionalLayerAnimBP;                           // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, class FName>                      LinkedAnimGraphTag;                                // 0x0048(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmetics.MeshCosmeticsPassDataCommon
// 0x0110 (0x0110 - 0x0000)
struct FMeshCosmeticsPassDataCommon final
{
public:
	TMap<struct FCosmeticSlotSelector, struct FCosmeticsLayoutSlot> AllSlotDataConfigs;              // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FCosmeticSlotSelector, class UMeshCosmeticsLayoutSchema*> ProvidedSlotsToSchemaData; // 0x0050(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UAthenaCosmeticItemDefinition*>  MeshCosmeticsItemDefs;                             // 0x00A0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        KeepLoadedObjects;                                 // 0x00B0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class UCustomizableSkeletalComponent*, struct FSkeletalComponentData> SkeletalComponentData; // 0x00C0(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPublic)
};

}

