#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MeshModelingToolsExp

#include "Basic.hpp"

#include "ModelingComponents_structs.hpp"
#include "ModelingComponents_classes.hpp"
#include "MeshModelingToolsExp_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InteractiveToolsFramework_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "ModelingOperators_structs.hpp"
#include "MeshModelingTools_structs.hpp"
#include "MeshModelingTools_classes.hpp"


namespace SDK
{

// Class MeshModelingToolsExp.HoleFillToolActions
// 0x0008 (0x00B0 - 0x00A8)
class UHoleFillToolActions final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void Clear();
	void SelectAll();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoleFillToolActions">();
	}
	static class UHoleFillToolActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoleFillToolActions>();
	}
};

// Class MeshModelingToolsExp.BakeInputMeshProperties
// 0x0098 (0x0140 - 0x00A8)
class UBakeInputMeshProperties final : public UInteractiveToolPropertySet
{
public:
	class UStaticMesh*                            TargetStaticMesh;                                  // 0x00A8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x00B0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetDynamicMesh;                                 // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetUVLayer;                                     // 0x00C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasTargetUVLayer;                                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UStaticMesh*                            SourceStaticMesh;                                  // 0x00D8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x00E0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SourceDynamicMesh;                                 // 0x00E8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideSourceMesh;                                   // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             SourceNormalMap;                                   // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceNormalMapUVLayer;                            // 0x0100(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeNormalSpace                              SourceNormalSpace;                                 // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSourceNormalMap;                               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ProjectionDistance;                                // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectionInWorldSpace;                           // 0x011C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         TargetUVLayerNamesList;                            // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         SourceUVLayerNamesList;                            // 0x0130(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	const TArray<class FString> GetSourceUVLayerNamesFunc() const;
	const TArray<class FString> GetTargetUVLayerNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeInputMeshProperties">();
	}
	static class UBakeInputMeshProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeInputMeshProperties>();
	}
};

// Class MeshModelingToolsExp.BakeNormalMapToolProperties
// 0x0000 (0x00A8 - 0x00A8)
class UBakeNormalMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeNormalMapToolProperties">();
	}
	static class UBakeNormalMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeNormalMapToolProperties>();
	}
};

// Class MeshModelingToolsExp.PhysicsObjectToolPropertySet
// 0x0068 (0x0110 - 0x00A8)
class UPhysicsObjectToolPropertySet final : public UInteractiveToolPropertySet
{
public:
	class FString                                 ObjectName;                                        // 0x00A8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionGeometryMode                        CollisionType;                                     // 0x00B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPhysicsSphereData>             Spheres;                                           // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsBoxData>                Boxes;                                             // 0x00D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsCapsuleData>            Capsules;                                          // 0x00E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsConvexData>             Convexes;                                          // 0x00F0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsLevelSetData>           LevelSets;                                         // 0x0100(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsObjectToolPropertySet">();
	}
	static class UPhysicsObjectToolPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsObjectToolPropertySet>();
	}
};

// Class MeshModelingToolsExp.BakeOcclusionMapToolProperties
// 0x0010 (0x00B8 - 0x00A8)
class UBakeOcclusionMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         OcclusionRays;                                     // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpreadAngle;                                       // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BiasAngle;                                         // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeOcclusionMapToolProperties">();
	}
	static class UBakeOcclusionMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeOcclusionMapToolProperties>();
	}
};

// Class MeshModelingToolsExp.BakeCurvatureMapToolProperties
// 0x0018 (0x00C0 - 0x00A8)
class UBakeCurvatureMapToolProperties final : public UInteractiveToolPropertySet
{
public:
	EBakeCurvatureTypeMode                        CurvatureType;                                     // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeCurvatureColorMode                       ColorMapping;                                      // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ColorRangeMultiplier;                              // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRangeMultiplier;                                // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeCurvatureClampMode                       Clamping;                                          // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeCurvatureMapToolProperties">();
	}
	static class UBakeCurvatureMapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeCurvatureMapToolProperties>();
	}
};

// Class MeshModelingToolsExp.OffsetMeshToolProperties
// 0x0010 (0x00B8 - 0x00A8)
class UOffsetMeshToolProperties final : public UInteractiveToolPropertySet
{
public:
	EOffsetMeshToolOffsetType                     OffsetType;                                        // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Distance;                                          // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateShell;                                      // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OffsetMeshToolProperties">();
	}
	static class UOffsetMeshToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetMeshToolProperties>();
	}
};

// Class MeshModelingToolsExp.BakeTexture2DProperties
// 0x0028 (0x00D0 - 0x00A8)
class UBakeTexture2DProperties final : public UInteractiveToolPropertySet
{
public:
	class UTexture2D*                             SourceTexture;                                     // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UVLayer;                                           // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UVLayerNamesList;                                  // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	const TArray<class FString> GetUVLayerNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeTexture2DProperties">();
	}
	static class UBakeTexture2DProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeTexture2DProperties>();
	}
};

// Class MeshModelingToolsExp.BakeMultiTexture2DProperties
// 0x0040 (0x00E8 - 0x00A8)
class UBakeMultiTexture2DProperties final : public UInteractiveToolPropertySet
{
public:
	TArray<class UTexture2D*>                     MaterialIDSourceTextures;                          // 0x00A8(0x0010)(Edit, EditFixedSize, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class FString                                 UVLayer;                                           // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UVLayerNamesList;                                  // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     AllSourceTextures;                                 // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	const TArray<class FString> GetUVLayerNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeMultiTexture2DProperties">();
	}
	static class UBakeMultiTexture2DProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeMultiTexture2DProperties>();
	}
};

// Class MeshModelingToolsExp.SmoothHoleFillProperties
// 0x0028 (0x00D0 - 0x00A8)
class USmoothHoleFillProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bConstrainToHoleInterior;                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RemeshingExteriorRegionWidth;                      // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SmoothingExteriorRegionWidth;                      // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SmoothingInteriorRegionWidth;                      // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteriorSmoothness;                                // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        FillDensityScalar;                                 // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectDuringRemesh;                              // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmoothHoleFillProperties">();
	}
	static class USmoothHoleFillProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmoothHoleFillProperties>();
	}
};

// Class MeshModelingToolsExp.BakeVisualizationProperties
// 0x0010 (0x00B8 - 0x00A8)
class UBakeVisualizationProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bPreviewAsMaterial;                                // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Brightness;                                        // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AOMultiplier;                                      // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeVisualizationProperties">();
	}
	static class UBakeVisualizationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeVisualizationProperties>();
	}
};

// Class MeshModelingToolsExp.ExtrudeMeshSelectionToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UExtrudeMeshSelectionToolBuilder final : public USingleTargetWithSelectionToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExtrudeMeshSelectionToolBuilder">();
	}
	static class UExtrudeMeshSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtrudeMeshSelectionToolBuilder>();
	}
};

// Class MeshModelingToolsExp.MeshAttributePaintToolBuilder
// 0x0040 (0x0070 - 0x0030)
class UMeshAttributePaintToolBuilder final : public UMeshSurfacePointMeshEditingToolBuilder
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshAttributePaintToolBuilder">();
	}
	static class UMeshAttributePaintToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshAttributePaintToolBuilder>();
	}
};

// Class MeshModelingToolsExp.ExtrudeMeshSelectionToolProperties
// 0x0048 (0x00F0 - 0x00A8)
class UExtrudeMeshSelectionToolProperties final : public UInteractiveToolPropertySet
{
public:
	EExtrudeMeshSelectionInteractionMode          InputMode;                                         // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        ExtrudeDistance;                                   // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExtrudeMeshSelectionRegionModifierMode       RegionMode;                                        // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NumSubdivisions;                                   // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CreaseAngle;                                       // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RaycastMaxDistance;                                // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShellsToSolids;                                   // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInferGroupsFromNbrs;                              // 0x00D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGroupPerSubdivision;                              // 0x00D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplaceSelectionGroups;                           // 0x00D3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        UVScale;                                           // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUVIslandPerGroup;                                 // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInferMaterialID;                                  // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SetMaterialID;                                     // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInputMaterials;                               // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExtrudeMeshSelectionToolProperties">();
	}
	static class UExtrudeMeshSelectionToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtrudeMeshSelectionToolProperties>();
	}
};

// Class MeshModelingToolsExp.ExtrudeMeshSelectionTool
// 0x0748 (0x0870 - 0x0128)
class UExtrudeMeshSelectionTool final : public USingleTargetWithSelectionTool
{
public:
	class UExtrudeMeshSelectionToolProperties*    ExtrudeProperties;                                 // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x720];                                    // 0x0130(0x0720)(Fixing Size After Last Property [ Dumper-8 ])
	class UPreviewMesh*                           SourcePreview;                                     // 0x0850(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    EditCompute;                                       // 0x0858(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x0860(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTransformProxy*                        TransformProxy;                                    // 0x0868(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExtrudeMeshSelectionTool">();
	}
	static class UExtrudeMeshSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtrudeMeshSelectionTool>();
	}
};

// Class MeshModelingToolsExp.HoleFillOperatorFactory
// 0x0010 (0x0038 - 0x0028)
class UHoleFillOperatorFactory final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UHoleFillTool*                          FillTool;                                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoleFillOperatorFactory">();
	}
	static class UHoleFillOperatorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoleFillOperatorFactory>();
	}
};

// Class MeshModelingToolsExp.MeshSculptBrushOpProps
// 0x0000 (0x00A8 - 0x00A8)
class UMeshSculptBrushOpProps : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshSculptBrushOpProps">();
	}
	static class UMeshSculptBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSculptBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.BaseKelvinletBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class UBaseKelvinletBrushOpProps : public UMeshSculptBrushOpProps
{
public:
	float                                         Stiffness;                                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Incompressiblity;                                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BrushSteps;                                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseKelvinletBrushOpProps">();
	}
	static class UBaseKelvinletBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseKelvinletBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.EditUVIslandsTool
// 0x03D8 (0x04E0 - 0x0108)
class alignas(0x10) UEditUVIslandsTool final : public UMeshSurfacePointTool
{
public:
	class UExistingMeshMaterialProperties*        MaterialSettings;                                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               CheckerMaterial;                                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInternalToolFrameworkActor*            PreviewMeshActor;                                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicMeshComponent*                  DynamicMeshComponent;                              // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPolygonSelectionMechanic*              SelectionMechanic;                                 // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTransformProxy*                        TransformProxy;                                    // 0x0140(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0x398];                                    // 0x0148(0x0398)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditUVIslandsTool">();
	}
	static class UEditUVIslandsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditUVIslandsTool>();
	}
};

// Class MeshModelingToolsExp.ScaleKelvinletBrushOpProps
// 0x0008 (0x00C0 - 0x00B8)
class UScaleKelvinletBrushOpProps final : public UBaseKelvinletBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScaleKelvinletBrushOpProps">();
	}
	static class UScaleKelvinletBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScaleKelvinletBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.PullKelvinletBrushOpProps
// 0x0008 (0x00C0 - 0x00B8)
class UPullKelvinletBrushOpProps final : public UBaseKelvinletBrushOpProps
{
public:
	float                                         Falloff;                                           // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PullKelvinletBrushOpProps">();
	}
	static class UPullKelvinletBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPullKelvinletBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.LatticeDeformerOperatorFactory
// 0x0010 (0x0038 - 0x0028)
class ULatticeDeformerOperatorFactory final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class ULatticeDeformerTool*                   LatticeDeformerTool;                               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LatticeDeformerOperatorFactory">();
	}
	static class ULatticeDeformerOperatorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULatticeDeformerOperatorFactory>();
	}
};

// Class MeshModelingToolsExp.SharpPullKelvinletBrushOpProps
// 0x0008 (0x00C0 - 0x00B8)
class USharpPullKelvinletBrushOpProps final : public UBaseKelvinletBrushOpProps
{
public:
	float                                         Falloff;                                           // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SharpPullKelvinletBrushOpProps">();
	}
	static class USharpPullKelvinletBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<USharpPullKelvinletBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.TwistKelvinletBrushOpProps
// 0x0008 (0x00C0 - 0x00B8)
class UTwistKelvinletBrushOpProps final : public UBaseKelvinletBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwistKelvinletBrushOpProps">();
	}
	static class UTwistKelvinletBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwistKelvinletBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.MeshGroupPaintToolActionPropertySet
// 0x0008 (0x00B0 - 0x00A8)
class UMeshGroupPaintToolActionPropertySet : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshGroupPaintToolActionPropertySet">();
	}
	static class UMeshGroupPaintToolActionPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshGroupPaintToolActionPropertySet>();
	}
};

// Class MeshModelingToolsExp.GroupEraseBrushOpProps
// 0x0048 (0x00F0 - 0x00A8)
class UGroupEraseBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	int32                                         Group;                                             // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyEraseCurrent;                                 // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x43];                                      // 0x00AD(0x0043)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroupEraseBrushOpProps">();
	}
	static class UGroupEraseBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupEraseBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.GroupPaintBrushOpProps
// 0x0008 (0x00B0 - 0x00A8)
class UGroupPaintBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	int32                                         Group;                                             // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyPaintUngrouped;                               // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroupPaintBrushOpProps">();
	}
	static class UGroupPaintBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupPaintBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.MeshAttributePaintToolProperties
// 0x0020 (0x00C8 - 0x00A8)
class UMeshAttributePaintToolProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 Attribute;                                         // 0x00A8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	const TArray<class FString> GetAttributeNames();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshAttributePaintToolProperties">();
	}
	static class UMeshAttributePaintToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshAttributePaintToolProperties>();
	}
};

// Class MeshModelingToolsExp.InflateBrushOpProps
// 0x0008 (0x00B0 - 0x00A8)
class UInflateBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InflateBrushOpProps">();
	}
	static class UInflateBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInflateBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.MoveBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class UMoveBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModelingToolsAxisFilter               AxisFilters;                                       // 0x00B4(0x0003)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoveBrushOpProps">();
	}
	static class UMoveBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoveBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.LatticeDeformerToolBuilder
// 0x0000 (0x0028 - 0x0028)
class ULatticeDeformerToolBuilder final : public USingleSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LatticeDeformerToolBuilder">();
	}
	static class ULatticeDeformerToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULatticeDeformerToolBuilder>();
	}
};

// Class MeshModelingToolsExp.PinchBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class UPinchBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPerpDamping;                                      // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PinchBrushOpProps">();
	}
	static class UPinchBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPinchBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.BasePlaneBrushOpProps
// 0x0000 (0x00A8 - 0x00A8)
class UBasePlaneBrushOpProps : public UMeshSculptBrushOpProps
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePlaneBrushOpProps">();
	}
	static class UBasePlaneBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasePlaneBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.MeshGroupPaintToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMeshGroupPaintToolBuilder final : public UMeshSurfacePointMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshGroupPaintToolBuilder">();
	}
	static class UMeshGroupPaintToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshGroupPaintToolBuilder>();
	}
};

// Class MeshModelingToolsExp.PlaneBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class UPlaneBrushOpProps final : public UBasePlaneBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlaneBrushSideMode                           WhichSide;                                         // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlaneBrushOpProps">();
	}
	static class UPlaneBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlaneBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.ViewAlignedPlaneBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class UViewAlignedPlaneBrushOpProps final : public UBasePlaneBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlaneBrushSideMode                           WhichSide;                                         // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViewAlignedPlaneBrushOpProps">();
	}
	static class UViewAlignedPlaneBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViewAlignedPlaneBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.MeshSelectionToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMeshSelectionToolBuilder final : public UMeshSurfacePointMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshSelectionToolBuilder">();
	}
	static class UMeshSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSelectionToolBuilder>();
	}
};

// Class MeshModelingToolsExp.FixedPlaneBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class UFixedPlaneBrushOpProps final : public UBasePlaneBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlaneBrushSideMode                           WhichSide;                                         // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedPlaneBrushOpProps">();
	}
	static class UFixedPlaneBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFixedPlaneBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.StandardSculptBrushOpProps
// 0x0008 (0x00B0 - 0x00A8)
class UStandardSculptBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StandardSculptBrushOpProps">();
	}
	static class UStandardSculptBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandardSculptBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.MeshSculptToolBase
// 0x0A98 (0x0BA0 - 0x0108)
#pragma pack(push, 0x1)
class alignas(0x10) UMeshSculptToolBase : public UMeshSurfacePointTool
{
public:
	class USculptBrushProperties*                 BrushProperties;                                   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorkPlaneProperties*                   GizmoProperties;                                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x118];                                    // 0x0118(0x0118)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<int32, class UMeshSculptBrushOpProps*>   BrushOpPropSets;                                   // 0x0230(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x50];                                     // 0x0280(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<int32, class UMeshSculptBrushOpProps*>   SecondaryBrushOpPropSets;                          // 0x02D0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x6F0];                                    // 0x0320(0x06F0)(Fixing Size After Last Property [ Dumper-8 ])
	class UMeshEditingViewProperties*             ViewProperties;                                    // 0x0A10(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               ActiveOverrideMaterial;                            // 0x0A18(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBrushStampIndicator*                   BrushIndicator;                                    // 0x0A20(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsVolumetricIndicator;                            // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A29[0x7];                                      // 0x0A29(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               BrushIndicatorMaterial;                            // 0x0A30(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           BrushIndicatorMesh;                                // 0x0A38(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCombinedTransformGizmo*                PlaneTransformGizmo;                               // 0x0A40(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransformProxy*                        PlaneTransformProxy;                               // 0x0A48(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A50[0x148];                                    // 0x0A50(0x0148)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshSculptToolBase">();
	}
	static class UMeshSculptToolBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSculptToolBase>();
	}
};
#pragma pack(pop)

// Class MeshModelingToolsExp.ViewAlignedSculptBrushOpProps
// 0x0008 (0x00B0 - 0x00A8)
class UViewAlignedSculptBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViewAlignedSculptBrushOpProps">();
	}
	static class UViewAlignedSculptBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViewAlignedSculptBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.SculptMaxBrushOpProps
// 0x0018 (0x00C0 - 0x00A8)
class USculptMaxBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHeight;                                         // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFixedHeight;                                   // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         FixedHeight;                                       // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SculptMaxBrushOpProps">();
	}
	static class USculptMaxBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<USculptMaxBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.DynamicMeshBrushTool
// 0x0040 (0x02C8 - 0x0288)
class UDynamicMeshBrushTool : public UBaseBrushTool
{
public:
	class UPreviewMesh*                           PreviewMesh;                                       // 0x0288(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_290[0x38];                                     // 0x0290(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshBrushTool">();
	}
	static class UDynamicMeshBrushTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshBrushTool>();
	}
};

// Class MeshModelingToolsExp.MeshAttributePaintTool
// 0x04F8 (0x07C0 - 0x02C8)
class alignas(0x10) UMeshAttributePaintTool final : public UDynamicMeshBrushTool
{
public:
	class UMeshAttributePaintBrushOperationProperties* BrushActionProps;                             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshAttributePaintToolProperties*      AttribProps;                                       // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x4E8];                                    // 0x02D8(0x04E8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshAttributePaintTool">();
	}
	static class UMeshAttributePaintTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshAttributePaintTool>();
	}
};

// Class MeshModelingToolsExp.BaseSmoothBrushOpProps
// 0x0000 (0x00A8 - 0x00A8)
class UBaseSmoothBrushOpProps : public UMeshSculptBrushOpProps
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseSmoothBrushOpProps">();
	}
	static class UBaseSmoothBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseSmoothBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.SmoothBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class USmoothBrushOpProps final : public UBaseSmoothBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveUVFlow;                                   // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmoothBrushOpProps">();
	}
	static class USmoothBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmoothBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.SecondarySmoothBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class USecondarySmoothBrushOpProps final : public UBaseSmoothBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveUVFlow;                                   // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SecondarySmoothBrushOpProps">();
	}
	static class USecondarySmoothBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<USecondarySmoothBrushOpProps>();
	}
};

// Class MeshModelingToolsExp.SmoothFillBrushOpProps
// 0x0010 (0x00B8 - 0x00A8)
class USmoothFillBrushOpProps final : public UBaseSmoothBrushOpProps
{
public:
