#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MidMatchRiftPoiGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiCheatManager
// 0x0000 (0x0028 - 0x0028)
class UMidmatchRiftPoiCheatManager final : public UChildCheatManager
{
public:
	void MidmatchRiftPoiSpawnFurthestFromPawnLocation();
	void MidmatchRiftPoiSpawnNearestToPawnLocation();
	void SpawnMidmatchPoiFurthestLocation(const struct FVector& Location);
	void SpawnMidmatchPoiNearestLocation(const struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidmatchRiftPoiCheatManager">();
	}
	static class UMidmatchRiftPoiCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidmatchRiftPoiCheatManager>();
	}
};

// Class MidMatchRiftPoiGameplayRuntime.MidMatchRiftPoiManagerActor
// 0x00D8 (0x0368 - 0x0290)
class AMidMatchRiftPoiManagerActor final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	uint8                                         bCanBeMarked : 1;                                  // 0x0298(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bBlockMarking : 1;                                 // 0x0298(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x02A0(0x00A8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x0348(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDynamicLandBrushApplied;                          // 0x0360(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetDynamicLandBrush(const struct FSlateBrush& LandIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidMatchRiftPoiManagerActor">();
	}
	static class AMidMatchRiftPoiManagerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMidMatchRiftPoiManagerActor>();
	}
};

// Class MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiSpawnIndicator
// 0x00D8 (0x0368 - 0x0290)
class AMidmatchRiftPoiSpawnIndicator final : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	uint8                                         bCanBeMarked : 1;                                  // 0x02A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bBlockMarking : 1;                                 // 0x02A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x02A8(0x00A8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x0350(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void TeleportVehicleActor(class AActor* VehicleActor, const struct FVector& TeleportLocation);

	bool IsActorInDataLayerInstance(const class AActor* Actor, const class UDataLayerInstance* DataLayerInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidmatchRiftPoiSpawnIndicator">();
	}
	static class AMidmatchRiftPoiSpawnIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMidmatchRiftPoiSpawnIndicator>();
	}
};

}

