#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MLDeformerFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "MLDeformerFramework_structs.hpp"
#include "OptimusCore_classes.hpp"
#include "ComputeFramework_classes.hpp"


namespace SDK
{

// Class MLDeformerFramework.MLDeformerAsset
// 0x0008 (0x0030 - 0x0028)
class UMLDeformerAsset final : public UObject
{
public:
	class UMLDeformerModel*                       Model;                                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerAsset">();
	}
	static class UMLDeformerAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerAsset>();
	}
};

// Class MLDeformerFramework.MLDeformerVizSettings
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerVizSettings : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerVizSettings">();
	}
	static class UMLDeformerVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerVizSettings>();
	}
};

// Class MLDeformerFramework.MLDeformerGeomCacheVizSettings
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerGeomCacheVizSettings : public UMLDeformerVizSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGeomCacheVizSettings">();
	}
	static class UMLDeformerGeomCacheVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGeomCacheVizSettings>();
	}
};

// Class MLDeformerFramework.MLDeformerMorphModelVizSettings
// 0x0010 (0x0038 - 0x0028)
class UMLDeformerMorphModelVizSettings : public UMLDeformerGeomCacheVizSettings
{
public:
	float                                         MorphTargetDeltaThreshold;                         // 0x0028(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MorphTargetNumber;                                 // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawMorphTargets;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerMorphModelVizSettings">();
	}
	static class UMLDeformerMorphModelVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelVizSettings>();
	}
};

// Class MLDeformerFramework.MLDeformerComponent
// 0x0040 (0x00E0 - 0x00A0)
class UMLDeformerComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	class UMLDeformerAsset*                       DeformerAsset;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Weight;                                            // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         QualityLevel;                                      // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMLDeformerModelInstance*               ModelInstance;                                     // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetDeformerAsset(class UMLDeformerAsset* InDeformerAsset);
	void SetQualityLevel(int32 InQualityLevel);
	void SetWeight(float NormalizedWeightValue);
	void UpdateSkeletalMeshComponent();

	class USkeletalMeshComponent* FindSkeletalMeshComponent(const class UMLDeformerAsset* Asset) const;
	class UMLDeformerAsset* GetDeformerAsset() const;
	int32 GetQualityLevel() const;
	class USkeletalMeshComponent* GetSkeletalMeshComponent() const;
	float GetWeight() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerComponent">();
	}
	static class UMLDeformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponent>();
	}
};

// Class MLDeformerFramework.MLDeformerComponentSource
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerComponentSource">();
	}
	static class UMLDeformerComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponentSource>();
	}
};

// Class MLDeformerFramework.MLDeformerModel
// 0x00C0 (0x00E8 - 0x0028)
class UMLDeformerModel : public UObject
{
public:
	uint8                                         Pad_28[0x98];                                      // 0x0028(0x0098)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NumBaseMeshVerts;                                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumTargetMeshVerts;                                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMLDeformerInputInfo*                   InputInfo;                                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int32>                                 VertexMap;                                         // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerModel">();
	}
	static class UMLDeformerModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerModel>();
	}
};

// Class MLDeformerFramework.MLDeformerGeomCacheModel
// 0x0000 (0x00E8 - 0x00E8)
class UMLDeformerGeomCacheModel : public UMLDeformerModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGeomCacheModel">();
	}
	static class UMLDeformerGeomCacheModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGeomCacheModel>();
	}
};

// Class MLDeformerFramework.MLDeformerGraphDebugDataInterface
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerGraphDebugDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGraphDebugDataInterface">();
	}
	static class UMLDeformerGraphDebugDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDebugDataInterface>();
	}
};

// Class MLDeformerFramework.MLDeformerGraphDebugDataProvider
// 0x0010 (0x0038 - 0x0028)
class UMLDeformerGraphDebugDataProvider final : public UComputeDataProvider
{
public:
	class UMLDeformerComponent*                   DeformerComponent;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMLDeformerAsset*                       DeformerAsset;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGraphDebugDataProvider">();
	}
	static class UMLDeformerGraphDebugDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDebugDataProvider>();
	}
};

// Class MLDeformerFramework.MLDeformerInputInfo
// 0x0040 (0x0068 - 0x0028)
class UMLDeformerInputInfo : public UObject
{
public:
	struct FSoftObjectPath                        SkeletalMesh;                                      // 0x0028(0x0018)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           BoneNames;                                         // 0x0040(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           CurveNames;                                        // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NumBaseMeshVertices;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumTargetMeshVertices;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerInputInfo">();
	}
	static class UMLDeformerInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerInputInfo>();
	}
};

// Class MLDeformerFramework.MLDeformerModelInstance
// 0x0060 (0x0088 - 0x0028)
class UMLDeformerModelInstance : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UMLDeformerModel*                       Model;                                             // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerModelInstance">();
	}
	static class UMLDeformerModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerModelInstance>();
	}
};

// Class MLDeformerFramework.MLDeformerMorphModel
// 0x00A8 (0x0190 - 0x00E8)
class UMLDeformerMorphModel : public UMLDeformerGeomCacheModel
{
public:
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bClampMorphWeights;                                // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVector3f>                      MorphTargetDeltas;                                 // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         NumMorphTargets;                                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	uint64                                        CompressedMorphDataSizeInBytes;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint64                                        UncompressedMorphDataSizeInBytes;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int32>                                 MorphTargetErrorOrder;                             // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 MorphTargetErrors;                                 // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 MaxMorphWeights;                                   // 0x0148(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FFloatInterval>                 MorphTargetsMinMaxWeights;                         // 0x0158(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMLDeformerMorphModelQualityLevel> QualityLevels;                                  // 0x0168(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bIncludeNormals;                                   // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MorphDeltaZeroThreshold;                           // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MorphCompressionLevel;                             // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMLDeformerMaskChannel                        MaskChannel;                                       // 0x0184(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertMaskChannel;                                // 0x0185(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_186[0xA];                                      // 0x0186(0x000A)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetMorphTargetDeltaFloats(const TArray<float>& Deltas);
	void SetMorphTargetDeltas(const TArray<struct FVector3f>& Deltas);
	void SetMorphTargetsErrorOrder(const TArray<int32>& MorphTargetOrder, const TArray<float>& ErrorValues);
	void SetMorphTargetsMaxWeights(const TArray<float>& MaxWeights);
	void SetMorphTargetsMinMaxWeights(const TArray<float>& MinValues, const TArray<float>& MaxValues);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerMorphModel">();
	}
	static class UMLDeformerMorphModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModel>();
	}
};

// Class MLDeformerFramework.MLDeformerMorphModelInputInfo
// 0x0000 (0x0068 - 0x0068)
class UMLDeformerMorphModelInputInfo : public UMLDeformerInputInfo
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerMorphModelInputInfo">();
	}
	static class UMLDeformerMorphModelInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelInputInfo>();
	}
};

// Class MLDeformerFramework.MLDeformerMorphModelInstance
// 0x0020 (0x00A8 - 0x0088)
class UMLDeformerMorphModelInstance : public UMLDeformerModelInstance
{
public:
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerMorphModelInstance">();
	}
	static class UMLDeformerMorphModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelInstance>();
	}
};

}

