#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MLDeformerFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MLDeformerFramework.MLDeformerComponent.SetDeformerAsset
// 0x0008 (0x0008 - 0x0000)
struct MLDeformerComponent_SetDeformerAsset final
{
public:
	class UMLDeformerAsset*                       InDeformerAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerComponent.SetQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerComponent_SetQualityLevel final
{
public:
	int32                                         InQualityLevel;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerComponent.SetWeight
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerComponent_SetWeight final
{
public:
	float                                         NormalizedWeightValue;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerComponent.FindSkeletalMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct MLDeformerComponent_FindSkeletalMeshComponent final
{
public:
	const class UMLDeformerAsset*                 Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerComponent.GetDeformerAsset
// 0x0008 (0x0008 - 0x0000)
struct MLDeformerComponent_GetDeformerAsset final
{
public:
	class UMLDeformerAsset*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerComponent.GetQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerComponent_GetQualityLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerComponent.GetSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct MLDeformerComponent_GetSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerComponent.GetWeight
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerComponent_GetWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerMorphModel.SetMorphTargetDeltaFloats
// 0x0010 (0x0010 - 0x0000)
struct MLDeformerMorphModel_SetMorphTargetDeltaFloats final
{
public:
	TArray<float>                                 Deltas;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerMorphModel.SetMorphTargetDeltas
// 0x0010 (0x0010 - 0x0000)
struct MLDeformerMorphModel_SetMorphTargetDeltas final
{
public:
	TArray<struct FVector3f>                      Deltas;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerMorphModel.SetMorphTargetsErrorOrder
// 0x0020 (0x0020 - 0x0000)
struct MLDeformerMorphModel_SetMorphTargetsErrorOrder final
{
public:
	TArray<int32>                                 MorphTargetOrder;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 ErrorValues;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerMorphModel.SetMorphTargetsMaxWeights
// 0x0010 (0x0010 - 0x0000)
struct MLDeformerMorphModel_SetMorphTargetsMaxWeights final
{
public:
	TArray<float>                                 MaxWeights;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MLDeformerFramework.MLDeformerMorphModel.SetMorphTargetsMinMaxWeights
// 0x0020 (0x0020 - 0x0000)
struct MLDeformerMorphModel_SetMorphTargetsMinMaxWeights final
{
public:
	TArray<float>                                 MinValues;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 MaxValues;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

}

