#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ModelViewViewModel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelViewViewModel_structs.hpp"


namespace SDK
{

// Class ModelViewViewModel.MVVMConversionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMVVMConversionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static ESlateVisibility Conv_BoolToSlateVisibility(bool bIsVisible, ESlateVisibility TrueVisibility, ESlateVisibility FalseVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMConversionLibrary">();
	}
	static class UMVVMConversionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMConversionLibrary>();
	}
};

// Class ModelViewViewModel.MVVMViewModelContextResolver
// 0x0000 (0x0028 - 0x0028)
class UMVVMViewModelContextResolver : public UObject
{
public:
	TScriptInterface<class INotifyFieldValueChanged> K2_CreateInstance(const class UClass* ExpectedType, const class UUserWidget* UserWidget) const;
	void K2_DestroyInstance(const class UObject* ViewModel, const class UMVVMView* View) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelContextResolver">();
	}
	static class UMVVMViewModelContextResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelContextResolver>();
	}
};

// Class ModelViewViewModel.MVVMGameSubsystem
// 0x0008 (0x0038 - 0x0030)
class UMVVMGameSubsystem final : public UGameInstanceSubsystem
{
public:
	class UMVVMViewModelCollectionObject*         ViewModelCollection;                               // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UMVVMViewModelCollectionObject* GetViewModelCollection() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMGameSubsystem">();
	}
	static class UMVVMGameSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMGameSubsystem>();
	}
};

// Class ModelViewViewModel.MVVMSubsystem
// 0x0000 (0x0030 - 0x0030)
class UMVVMSubsystem final : public UEngineSubsystem
{
public:
	bool DoesWidgetTreeContainedWidget(const class UWidgetTree* WidgetTree, const class UWidget* ViewWidget) const;
	class UMVVMViewModelCollectionObject* GetGlobalViewModelCollection() const;
	struct FMVVMAvailableBinding K2_GetAvailableBinding(const class UClass* Class_0, const struct FMVVMBindingName& BindingName, const class UClass* Accessor) const;
	TArray<struct FMVVMAvailableBinding> K2_GetAvailableBindings(const class UClass* Class_0, const class UClass* Accessor) const;
	class UMVVMView* K2_GetViewFromUserWidget(const class UUserWidget* UserWidget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMSubsystem">();
	}
	static class UMVVMSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMSubsystem>();
	}
};

// Class ModelViewViewModel.MVVMViewModelBase
// 0x0040 (0x0068 - 0x0028)
class UMVVMViewModelBase : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void K2_AddFieldValueChangedDelegate(const struct FFieldNotificationId& FieldId, TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate);
	void K2_BroadcastFieldValueChanged(const struct FFieldNotificationId& FieldId);
	void K2_RemoveFieldValueChangedDelegate(const struct FFieldNotificationId& FieldId, TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate);
	bool K2_SetPropertyValue(const int32& OldValue, const int32& NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelBase">();
	}
	static class UMVVMViewModelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelBase>();
	}
};

// Class ModelViewViewModel.MVVMViewModelCollectionObject
// 0x0028 (0x0050 - 0x0028)
class UMVVMViewModelCollectionObject final : public UObject
{
public:
	struct FMVVMViewModelCollection               ViewModelCollection;                               // 0x0028(0x0028)(Transient, NativeAccessSpecifierPrivate)

public:
	bool AddViewModelInstance(const struct FMVVMViewModelContext& Context, class UMVVMViewModelBase* ViewModel);
	int32 RemoveAllViewModelInstance(class UMVVMViewModelBase* ViewModel);
	bool RemoveViewModel(const struct FMVVMViewModelContext& Context);

	class UMVVMViewModelBase* FindFirstViewModelInstanceOfType(const TSubclassOf<class UMVVMViewModelBase>& ViewModelClass) const;
	class UMVVMViewModelBase* FindViewModelInstance(const struct FMVVMViewModelContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelCollectionObject">();
	}
	static class UMVVMViewModelCollectionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelCollectionObject>();
	}
};

// Class ModelViewViewModel.MVVMInstancedViewModelGeneratedClass
// 0x0060 (0x03C8 - 0x0368)
class UMVVMInstancedViewModelGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	TArray<class UFunction*>                      OnRepFunctionToLink;                               // 0x0368(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0x50];                                     // 0x0378(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMInstancedViewModelGeneratedClass">();
	}
	static class UMVVMInstancedViewModelGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMInstancedViewModelGeneratedClass>();
	}
};

// Class ModelViewViewModel.MVVMViewModelBlueprintGeneratedClass
// 0x0000 (0x0368 - 0x0368)
class UMVVMViewModelBlueprintGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelBlueprintGeneratedClass">();
	}
	static class UMVVMViewModelBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelBlueprintGeneratedClass>();
	}
};

// Class ModelViewViewModel.MVVMBindingSubsystem
// 0x0060 (0x0090 - 0x0030)
class UMVVMBindingSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBindingSubsystem">();
	}
	static class UMVVMBindingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBindingSubsystem>();
	}
};

// Class ModelViewViewModel.MVVMView
// 0x0050 (0x0078 - 0x0028)
class UMVVMView final : public UUserWidgetExtension
{
public:
	class UMVVMViewClass*                         ClassExtension;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMViewSource>                Sources;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bLogBinding;                                       // 0x0070(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bConstructed;                                      // 0x0071(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSourcesInitialized;                               // 0x0072(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bBindingsInitialized;                              // 0x0073(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasEveryTickBinding;                              // 0x0074(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void InitializeBindings();
	void InitializeSources();
	bool SetViewModel(class FName ViewModelName, TScriptInterface<class INotifyFieldValueChanged> ViewModel);
	bool SetViewModelByClass(TScriptInterface<class INotifyFieldValueChanged> NewValue);
	void UninitializeBindings();
	void UninitializeSources();

	bool AreBindingsInitialized() const;
	bool AreSourcesInitialized() const;
	TScriptInterface<class INotifyFieldValueChanged> GetViewModel(class FName ViewModelName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMView">();
	}
	static class UMVVMView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMView>();
	}
};

// Class ModelViewViewModel.MVVMViewClass
// 0x0098 (0x00C0 - 0x0028)
class UMVVMViewClass final : public UWidgetBlueprintGeneratedClassExtension
{
public:
	TArray<struct FMVVMViewClass_SourceCreator>   SourceCreators;                                    // 0x0028(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMViewClass_CompiledBinding> CompiledBindings;                                  // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMViewClass_CompiledEvent>   CompiledEvents;                                    // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FMVVMCompiledBindingLibrary            BindingLibrary;                                    // 0x0058(0x0060)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x4];                                       // 0x00B8(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bInitializeSourcesOnConstruct;                     // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInitializeBindingsOnConstruct;                    // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewClass">();
	}
	static class UMVVMViewClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewClass>();
	}
};

}

