#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MotherGameplayUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function MotherGameplayUI.AvocadoEaterHealthBarWidget.OnSetMarkerPosition
// 0x0004 (0x0004 - 0x0000)
struct AvocadoEaterHealthBarWidget_OnSetMarkerPosition final
{
public:
	float                                         MarkerPosition;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotherGameplayUI.FortPaddleGingerReticleExtensionWidget.OnPropActivationChanged
// 0x0001 (0x0001 - 0x0000)
struct FortPaddleGingerReticleExtensionWidget_OnPropActivationChanged final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotherGameplayUI.FortPaddleGingerReticleExtensionWidget.OnPropIndexChanged
// 0x0028 (0x0028 - 0x0000)
struct FortPaddleGingerReticleExtensionWidget_OnPropIndexChanged final
{
public:
	class FText                                   CategoryText;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         PropIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPropCount;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CategoryIndex;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxCategoryCount;                                  // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotherGameplayUI.FortReactorGradeReticleExtensionWidget.OnUpdateChargeToAutoDischarge
// 0x0004 (0x0004 - 0x0000)
struct FortReactorGradeReticleExtensionWidget_OnUpdateChargeToAutoDischarge final
{
public:
	float                                         ChargePercent;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotherGameplayUI.FortReactorGradeReticleExtensionWidget.OnUpdateChargeToMin
// 0x0004 (0x0004 - 0x0000)
struct FortReactorGradeReticleExtensionWidget_OnUpdateChargeToMin final
{
public:
	float                                         ChargePercent;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

