#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MotherGameplayRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "MotherGameplayRuntime_structs.hpp"


namespace SDK
{

// Class MotherGameplayRuntime.GravityGunTargetTrackingComponent
// 0x01C8 (0x0268 - 0x00A0)
class UGravityGunTargetTrackingComponent final : public UActorComponent
{
public:
	struct FScalableFloat                         AllowLargeObjects;                                 // 0x00A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowMultipleGrabbers;                             // 0x00C8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowVehicles;                                     // 0x00F0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowPickups;                                      // 0x0118(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowProjectiles;                                  // 0x0140(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowForay;                                        // 0x0168(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowWhileInVehicle;                               // 0x0190(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   GrabbedByGravityGunTagName;                        // 0x01B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  InvalidTargetTags;                                 // 0x01C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsPlayerTag;                                 // 0x01E0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsAlreadyGrabbedTag;                         // 0x0200(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsOwnVehicleTag;                             // 0x0220(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* NewTarget)> FoundTargetDelegate;                     // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              DeactivateReticleDelegate;                         // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void FindTargetActor(class AActor* OwningPlayer, const struct FVector& TraceStart, const struct FVector& TraceEnd);
	bool FindTargetProjectile(class AActor* OwningPlayer, const struct FVector& TraceStart, const struct FVector& TraceEnd, float TargetingRadius);
	bool IsValidTarget(class AActor* OwningPlayer, class AActor* PotentialTarget, struct FGameplayTagContainer* ReasonForFailure);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GravityGunTargetTrackingComponent">();
	}
	static class UGravityGunTargetTrackingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGravityGunTargetTrackingComponent>();
	}
};

// Class MotherGameplayRuntime.FortCabbageIglooVehicle
// 0x0000 (0x2720 - 0x2720)
class AFortCabbageIglooVehicle final : public AFortOctopusVehicle
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCabbageIglooVehicle">();
	}
	static class AFortCabbageIglooVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortCabbageIglooVehicle>();
	}
};

// Class MotherGameplayRuntime.FortBaseAnimInstance_CageSaddle
// 0x0170 (0x05B0 - 0x0440)
class UFortBaseAnimInstance_CageSaddle final : public UFortBaseAnimInstance
{
public:
	class AFortSphericalVehicle*                  AsFortSphericalVehicle;                            // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnGround;                                       // 0x0440(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         RemappedPitch;                                     // 0x0444(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentRoll;                                       // 0x0448(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LockedRoll;                                        // 0x044C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHeadShouldBend;                                   // 0x0450(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFootShouldBend;                                   // 0x0451(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_452[0x6];                                      // 0x0452(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                BodyGroundOffset;                                  // 0x0458(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinClampPitchInRange;                              // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinClampPitchOutRange;                             // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxClampPitchInRange;                              // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxClampPitchOutRange;                             // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadAlphaInterpSpeed;                              // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B4[0xFC];                                     // 0x04B4(0x00FC)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBaseAnimInstance_CageSaddle">();
	}
	static class UFortBaseAnimInstance_CageSaddle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBaseAnimInstance_CageSaddle>();
	}
};

// Class MotherGameplayRuntime.FortGameplayCueNotifyLoop_Goop
// 0x0040 (0x09F0 - 0x09B0)
class AFortGameplayCueNotifyLoop_Goop final : public AFortGameplayCueNotify_Loop
{
public:
	class FName                                   SpeedParamName;                                    // 0x09B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsFallingParamName;                                // 0x09B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGoopAudioMapRangeClamped              SpeedMapRangeClamped;                              // 0x09B8(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         InterpSpeed;                                       // 0x09D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9DC[0x4];                                      // 0x09DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAudioComponent*                        LoopingAudioComponent;                             // 0x09E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9E8[0x8];                                      // 0x09E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCueNotifyLoop_Goop">();
	}
	static class AFortGameplayCueNotifyLoop_Goop* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameplayCueNotifyLoop_Goop>();
	}
};

// Class MotherGameplayRuntime.PropGunFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UPropGunFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearPropActivatedEventState(class AActor* ContextActor);
	static void ClearPropIndexEventState(class AActor* ContextActor);
	static void UpdatePropActivatedEventState(class AActor* ContextActor, const struct FPaddleGingerPropActivatedData& Payload);
	static void UpdatePropIndexEventState(class AActor* ContextActor, const struct FPaddleGingerPropData& Payload);
	static void UpdatePropPreviewPosition(class USceneComponent* PropPreviewComponent, const float DeltaTime, const class AFortPawn* AttachPawn, const class FName AttachSocket, const class USkeletalMeshComponent* WeaponMesh, const struct FVector& DesiredRelativeTransform, const float MinimumZOffset, const struct FRotator& RelativeRotation, const struct FVector& CachedScale, const float InterpSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropGunFunctionLibrary">();
	}
	static class UPropGunFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropGunFunctionLibrary>();
	}
};

// Class MotherGameplayRuntime.ReactorGradeGameplayCue_ChargeUp
// 0x0088 (0x0A38 - 0x09B0)
class AReactorGradeGameplayCue_ChargeUp final : public AFortGameplayCueNotify_Loop
{
public:
	class AFortPawn*                              Pawn;                                              // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWeaponFxComponent_ChargeAimLocation* CachedAimLocationComponent;                      // 0x09B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FoundEndPoint;                                     // 0x09C0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinHitDistance;                                    // 0x09D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HitObjectsLimit;                                   // 0x0A00(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A28[0x4];                                      // 0x0A28(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	ECollisionChannel                             TraceChannel;                                      // 0x0A2C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A2D[0xB];                                      // 0x0A2D(0x000B)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnEndPointUpdated(const struct FVector& FoundPoint);
	void UpdateAimEndPoint();

	const struct FVector GetFoundEndPoint() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReactorGradeGameplayCue_ChargeUp">();
	}
	static class AReactorGradeGameplayCue_ChargeUp* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReactorGradeGameplayCue_ChargeUp>();
	}
};

}

