#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MotoSynth

#include "Basic.hpp"

#include "MotoSynth_structs.hpp"


namespace SDK::Params
{

// Function MotoSynth.SynthComponentMoto.GetRPMRange
// 0x0008 (0x0008 - 0x0000)
struct SynthComponentMoto_GetRPMRange final
{
public:
	float                                         OutMinRPM;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMaxRPM;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotoSynth.SynthComponentMoto.SetRPM
// 0x0008 (0x0008 - 0x0000)
struct SynthComponentMoto_SetRPM final
{
public:
	float                                         InRPM;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTimeSec;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotoSynth.SynthComponentMoto.SetSettings
// 0x0138 (0x0138 - 0x0000)
struct SynthComponentMoto_SetSettings final
{
public:
	struct FMotoSynthRuntimeSettings              InSettings;                                        // 0x0000(0x0138)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function MotoSynth.SynthComponentMoto.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct SynthComponentMoto_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

