#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MotoSynth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MotoSynth_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AudioMixer_classes.hpp"


namespace SDK
{

// Class MotoSynth.MotoSynthPreset
// 0x0138 (0x0160 - 0x0028)
class UMotoSynthPreset final : public UObject
{
public:
	struct FMotoSynthRuntimeSettings              Settings;                                          // 0x0028(0x0138)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotoSynthPreset">();
	}
	static class UMotoSynthPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotoSynthPreset>();
	}
};

// Class MotoSynth.MotoSynthSource
// 0x00D0 (0x00F8 - 0x0028)
class UMotoSynthSource final : public UObject
{
public:
	bool                                          bConvertTo8Bit;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DownSampleFactor;                                  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     RpmCurve;                                          // 0x0030(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<float>                                 SourceData;                                        // 0x00B8(0x0010)(ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected)
	TArray<int16>                                 SourceDataPCM;                                     // 0x00C8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         SourceSampleRate;                                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FGrainTableEntry>               GrainTable;                                        // 0x00E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotoSynthSource">();
	}
	static class UMotoSynthSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotoSynthSource>();
	}
};

// Class MotoSynth.SynthComponentMoto
// 0x01A0 (0x0AA0 - 0x0900)
class USynthComponentMoto : public USynthComponent
{
public:
	class UMotoSynthPreset*                       MotoSynthPreset;                                   // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RPM;                                               // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90C[0x194];                                    // 0x090C(0x0194)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void GetRPMRange(float* OutMinRPM, float* OutMaxRPM);
	void SetRPM(float InRPM, float InTimeSec);
	void SetSettings(const struct FMotoSynthRuntimeSettings& InSettings);

	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SynthComponentMoto">();
	}
	static class USynthComponentMoto* GetDefaultObj()
	{
		return GetDefaultObjImpl<USynthComponentMoto>();
	}
};

}

