#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MotorboatRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MotorboatRuntime.FortMeatballVehicle.CacheAudioPointers
// 0x0030 (0x0030 - 0x0000)
struct FortMeatballVehicle_CacheAudioPointers final
{
public:
	class UFortVehicleAudioVoice*                 InAudioEngineUp;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVehicleAudioVoice*                 InAudioEngineDown;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVehicleAudioVoice*                 InAudioWakeTurn;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVehicleAudioVoice*                 InAudioWakeSpeed;                                  // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVehicleAudioVoice*                 InAudioScrape;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVehicleAudioVoice*                 InAudioEngineOutOfFuel;                            // 0x0028(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotorboatRuntime.FortMeatballVehicle.CacheGroundFXComponent
// 0x0008 (0x0008 - 0x0000)
struct FortMeatballVehicle_CacheGroundFXComponent final
{
public:
	class UNiagaraComponent*                      InGroundFXComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotorboatRuntime.FortMeatballVehicle.ShowCooldownCue
// 0x0010 (0x0010 - 0x0000)
struct FortMeatballVehicle_ShowCooldownCue final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function MotorboatRuntime.FortMeatballVehicle.SmashedThroughBuildingPiece
// 0x0038 (0x0038 - 0x0000)
struct FortMeatballVehicle_SmashedThroughBuildingPiece final
{
public:
	struct FVector                                ImpactPoint;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImpactNormal;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ABuildingActor*                   BuildingHitActor;                                  // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotorboatRuntime.FortMeatballVehicle.UpdateSnowAndDirtParams
// 0x0004 (0x0004 - 0x0000)
struct FortMeatballVehicle_UpdateSnowAndDirtParams final
{
public:
	float                                         NormalizedForwardSpeed;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotorboatRuntime.FortMeatballVehicle.GetBoostCharge
// 0x0004 (0x0004 - 0x0000)
struct FortMeatballVehicle_GetBoostCharge final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotorboatRuntime.FortMeatballVehicle.GetSeatOffset
// 0x0018 (0x0018 - 0x0000)
struct FortMeatballVehicle_GetSeatOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotorboatRuntime.FortMeatballVehicle.GetSeatRotation
// 0x0020 (0x0020 - 0x0000)
struct FortMeatballVehicle_GetSeatRotation final
{
public:
	struct FQuat                                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

