#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "StructUtils_structs.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "OpenColorIO_structs.hpp"


namespace SDK
{

// Class MovieRenderPipelineCore.MovieGraphNode
// 0x0070 (0x0098 - 0x0028)
class UMovieGraphNode : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UMovieGraphPin*>                 InputPins;                                         // 0x0040(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphPin*>                 OutputPins;                                        // 0x0050(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FInstancedPropertyBag                  DynamicProperties;                                 // 0x0060(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMovieGraphPropertyInfo>        ExposedPropertyInfo;                               // 0x0070(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIsDisabled : 1;                                   // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  Guid;                                              // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphNode">();
	}
	static class UMovieGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphSettingNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphSettingNode : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphSettingNode">();
	}
	static class UMovieGraphSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSettingNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphApplyCVarPresetNode
// 0x0018 (0x00B0 - 0x0098)
class UMovieGraphApplyCVarPresetNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ConsoleVariablePreset : 1;               // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TScriptInterface<class IMovieSceneConsoleVariableTrackInterface> ConsoleVariablePreset;          // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphApplyCVarPresetNode">();
	}
	static class UMovieGraphApplyCVarPresetNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphApplyCVarPresetNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphFileOutputNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphFileOutputNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphFileOutputNode">();
	}
	static class UMovieGraphFileOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphFileOutputNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphAudioOutputNode
// 0x0080 (0x0118 - 0x0098)
class UMovieGraphAudioOutputNode final : public UMovieGraphFileOutputNode
{
public:
	uint8                                         bOverride_FileNameFormatOverride : 1;              // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 FileNameFormatOverride;                            // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x68];                                      // 0x00B0(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphAudioOutputNode">();
	}
	static class UMovieGraphAudioOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioOutputNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetCurrentAperture(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class UCineCameraComponent* GetCurrentCineCamera(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static float GetCurrentFocalLength(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static float GetCurrentFocusDistance(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static void GetCurrentSegmentName(const class UMovieGraphPipeline* InMovieGraphPipeline, class FText* OutOuterName, class FText* OutInnerName);
	static EMovieRenderShotState GetCurrentSegmentState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FMoviePipelineSegmentWorkMetrics GetCurrentSegmentWorkMetrics(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetCurrentShotFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetCurrentShotTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameRate GetEffectiveFrameRate(class UMovieGraphOutputSettingNode* InNode, const struct FFrameRate& InDefaultRate);
	static struct FIntPoint GetEffectiveOutputResolution(class UMovieGraphEvaluatedConfig* InEvaluatedGraph, const class FName& InBranchName);
	static bool GetEstimatedTimeRemaining(const class UMovieGraphPipeline* InMovieGraphPipeline, struct FTimespan* OutEstimate);
	static class FText GetJobAuthor(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FDateTime GetJobInitializationTime(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class FText GetJobName(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static void GetOverallOutputFrames(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static void GetOverallSegmentCounts(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static EMovieRenderPipelineState GetPipelineState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetRootFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetRootTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class FString ResolveFilenameFormatArguments(const class FString& InFormatString, const struct FMovieGraphFilenameResolveParams& InParams, struct FMovieGraphResolveArgs* OutMergedFormatArgs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBlueprintLibrary">();
	}
	static class UMovieGraphBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBlueprintLibrary>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBranchNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphBranchNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBranchNode">();
	}
	static class UMovieGraphBranchNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBranchNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphRenderPassNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphRenderPassNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphRenderPassNode">();
	}
	static class UMovieGraphRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRenderPassNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphWidgetRendererBaseNode
// 0x0078 (0x0110 - 0x0098)
class UMovieGraphWidgetRendererBaseNode : public UMovieGraphRenderPassNode
{
public:
	uint8                                         bOverride_bCompositeOntoFinalImage : 1;            // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bCompositeOntoFinalImage;                          // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x76];                                      // 0x009A(0x0076)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphWidgetRendererBaseNode">();
	}
	static class UMovieGraphWidgetRendererBaseNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphWidgetRendererBaseNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBurnInNode
// 0x0070 (0x0180 - 0x0110)
class UMovieGraphBurnInNode final : public UMovieGraphWidgetRendererBaseNode
{
public:
	uint8                                         bOverride_BurnInClass : 1;                         // 0x0110(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSoftClassPath                         BurnInClass;                                       // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, class UMovieGraphBurnInWidget*> BurnInWidgetInstances;                       // 0x0130(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBurnInNode">();
	}
	static class UMovieGraphBurnInNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBurnInWidget
// 0x0000 (0x02C0 - 0x02C0)
class UMovieGraphBurnInWidget final : public UUserWidget
{
public:
	void UpdateForGraph(class UMovieGraphPipeline* InGraphPipeline);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBurnInWidget">();
	}
	static class UMovieGraphBurnInWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInWidget>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCollectionNode
// 0x0020 (0x00B8 - 0x0098)
class UMovieGraphCollectionNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_CollectionName : 1;                      // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_QueryClass : 1;                          // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 CollectionName;                                    // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineCollectionQuery*          QueryClass;                                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCollectionNode">();
	}
	static class UMovieGraphCollectionNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCollectionNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphPostRenderNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphPostRenderNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphPostRenderNode">();
	}
	static class UMovieGraphPostRenderNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphPostRenderNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCommandLineEncoderNode
// 0x00B8 (0x0150 - 0x0098)
class UMovieGraphCommandLineEncoderNode final : public UMovieGraphPostRenderNode
{
public:
	uint8                                         bOverride_FileNameFormatOverride : 1;              // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Quality : 1;                             // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bDeleteSourceFiles : 1;                  // 0x0098(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bSkipEncodeOnRenderCanceled : 1;         // 0x0098(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoCodec : 1;                          // 0x0098(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioCodec : 1;                          // 0x0098(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputFileExtension : 1;                 // 0x0098(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CommandLineFormat : 1;                   // 0x0098(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoInputStringFormat : 1;              // 0x0099(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioInputStringFormat : 1;              // 0x0099(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EncodeSettings : 1;                      // 0x0099(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bRetainInputTextFiles : 1;               // 0x0099(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 FileNameFormatOverride;                            // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSourceFiles;                                // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipEncodeOnRenderCanceled;                       // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 VideoCodec;                                        // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioCodec;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFileExtension;                               // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandLineFormat;                                 // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoInputStringFormat;                            // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioInputStringFormat;                            // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings;                                    // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetainInputTextFiles;                             // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x27];                                     // 0x0129(0x0027)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCommandLineEncoderNode">();
	}
	static class UMovieGraphCommandLineEncoderNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCommandLineEncoderNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphValueContainer
// 0x0018 (0x0040 - 0x0028)
class UMovieGraphValueContainer : public UObject
{
public:
	class FName                                   PropertyName;                                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedPropertyBag                  Value;                                             // 0x0030(0x0010)(Edit, NativeAccessSpecifierPrivate)

public:
	class FString GetValueSerializedString();
	bool SetValueBool(const bool bInValue);
	bool SetValueByte(const uint8 InValue);
	bool SetValueClass(class UClass* InValue);
	void SetValueContainerType(EMovieGraphContainerType ContainerType);
	bool SetValueDouble(const double InValue);
	bool SetValueEnum(const uint8 InValue, const class UEnum* Enum);
	bool SetValueFloat(const float InValue);
	bool SetValueInt32(const int32 InValue);
	bool SetValueInt64(const int64 InValue);
	bool SetValueName(const class FName InValue);
	bool SetValueObject(class UObject* InValue);
	bool SetValueSerializedString(const class FString& NewValue);
	bool SetValueString(const class FString& InValue);
	bool SetValueText(const class FText& InValue);
	void SetValueType(EMovieGraphValueType ValueType, class UObject* InValueTypeObject);
	void SetValueTypeObject(const class UObject* ValueTypeObject);

	bool GetValueBool(bool* bOutValue) const;
	bool GetValueByte(uint8* OutValue) const;
	bool GetValueClass(class UClass** OutValue) const;
	EMovieGraphContainerType GetValueContainerType() const;
	bool GetValueDouble(double* OutValue) const;
	bool GetValueEnum(uint8* OutValue, const class UEnum* RequestedEnum) const;
	bool GetValueFloat(float* OutValue) const;
	bool GetValueInt32(int32* OutValue) const;
	bool GetValueInt64(int64* OutValue) const;
	bool GetValueName(class FName* OutValue) const;
	bool GetValueObject(class UObject* OutValue, const class UClass* RequestedClass) const;
	bool GetValueString(class FString* OutValue) const;
	bool GetValueText(class FText* OutValue) const;
	EMovieGraphValueType GetValueType() const;
	const class UObject* GetValueTypeObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphValueContainer">();
	}
	static class UMovieGraphValueContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphValueContainer>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphMember
// 0x0038 (0x0078 - 0x0040)
class UMovieGraphMember : public UMovieGraphValueContainer
{
public:
	class FString                                 Description;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0050(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEditable;                                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphMember">();
	}
	static class UMovieGraphMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphMember>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphVariable
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphVariable : public UMovieGraphMember
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphVariable">();
	}
	static class UMovieGraphVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphVariable>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable : public UMovieGraphVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable">();
	}
	static class UMovieGraphGlobalVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_ShotName
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_ShotName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_ShotName">();
	}
	static class UMovieGraphGlobalVariable_ShotName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_ShotName>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_SequenceName
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_SequenceName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_SequenceName">();
	}
	static class UMovieGraphGlobalVariable_SequenceName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_SequenceName>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_FrameNumber
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_FrameNumber final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_FrameNumber">();
	}
	static class UMovieGraphGlobalVariable_FrameNumber* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_FrameNumber>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_CameraName
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_CameraName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_CameraName">();
	}
	static class UMovieGraphGlobalVariable_CameraName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_CameraName>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphInterfaceBase
// 0x0008 (0x0080 - 0x0078)
class UMovieGraphInterfaceBase : public UMovieGraphMember
{
public:
	bool                                          bIsBranch;                                         // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphInterfaceBase">();
	}
	static class UMovieGraphInterfaceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInterfaceBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphInput
// 0x0000 (0x0080 - 0x0080)
class UMovieGraphInput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphInput">();
	}
	static class UMovieGraphInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInput>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphOutput
// 0x0000 (0x0080 - 0x0080)
class UMovieGraphOutput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphOutput">();
	}
	static class UMovieGraphOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutput>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphEvaluatedConfig
// 0x0050 (0x0078 - 0x0028)
class UMovieGraphEvaluatedConfig final : public UObject
{
public:
	TMap<class FName, struct FMovieGraphEvaluatedBranchConfig> BranchConfigMapping;                  // 0x0028(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEvaluatedConfig">();
	}
	static class UMovieGraphEvaluatedConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEvaluatedConfig>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphTraversableObject
// 0x0000 (0x0000 - 0x0000)
class IMovieGraphTraversableObject final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphTraversableObject">();
	}
	static class IMovieGraphTraversableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieGraphTraversableObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class MovieRenderPipelineCore.MovieGraphConfig
// 0x0060 (0x0088 - 0x0028)
class UMovieGraphConfig final : public UObject
{
public:
	TArray<class UMovieGraphNode*>                AllNodes;                                          // 0x0028(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        InputNode;                                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        OutputNode;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphVariable*>            Variables;                                         // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphGlobalVariable*>      GlobalVariables;                                   // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphInput*>               Inputs;                                            // 0x0068(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphOutput*>              Outputs;                                           // 0x0078(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class UMovieGraphVariable* AddVariable(const class FName InCustomBaseName);
	class UMovieGraphEvaluatedConfig* CreateFlattenedGraph(const struct FMovieGraphTraversalContext& InContext);
	void UpdateGlobalVariableValues(const class UMovieGraphPipeline* InPipeline);

	TArray<class UMovieGraphVariable*> GetVariables(const bool bIncludeGlobal) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphConfig">();
	}
	static class UMovieGraphConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConfig>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphShowFlags
// 0x00D8 (0x0100 - 0x0028)
class UMovieGraphShowFlags final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSet<uint32>                                  OverriddenShowFlags;                               // 0x0030(0x0050)(NativeAccessSpecifierPrivate)
	TMap<uint32, bool>                            ShowFlagEnableState;                               // 0x0080(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x30];                                      // 0x00D0(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphShowFlags">();
	}
	static class UMovieGraphShowFlags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphShowFlags>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCoreRenderPassNode
// 0x0020 (0x00B8 - 0x0098)
class UMovieGraphCoreRenderPassNode : public UMovieGraphRenderPassNode
{
public:
	uint8                                         bOverride_ShowFlags : 1;                           // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMovieGraphShowFlags*                   ShowFlags;                                         // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCoreRenderPassNode">();
	}
	static class UMovieGraphCoreRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCoreRenderPassNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphTimeStepBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphTimeStepBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphTimeStepBase">();
	}
	static class UMovieGraphTimeStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphTimeStepBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCoreTimeStep
// 0x0158 (0x0180 - 0x0028)
class UMovieGraphCoreTimeStep : public UMovieGraphTimeStepBase
{
public:
	struct FMovieGraphTimeStepData                CurrentTimeStepData;                               // 0x0028(0x0060)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0xE8];                                      // 0x0088(0x00E8)(Fixing Size After Last Property [ Dumper-8 ])
	class UMovieGraphEngineTimeStep*              CustomTimeStep;                                    // 0x0170(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEngineCustomTimeStep*                  PrevCustomTimeStep;                                // 0x0178(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCoreTimeStep">();
	}
	static class UMovieGraphCoreTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCoreTimeStep>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphEngineTimeStep
// 0x0010 (0x0038 - 0x0028)
class UMovieGraphEngineTimeStep final : public UEngineCustomTimeStep
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEngineTimeStep">();
	}
	static class UMovieGraphEngineTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEngineTimeStep>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphRendererBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphRendererBase : public UObject
{
public:
	class UTexture* GetPreviewTexture() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphRendererBase">();
	}
	static class UMovieGraphRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRendererBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDataSourceBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphDataSourceBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDataSourceBase">();
	}
	static class UMovieGraphDataSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDataSourceBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphAudioRendererBase
// 0x0030 (0x0058 - 0x0028)
class UMovieGraphAudioRendererBase : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphAudioRendererBase">();
	}
	static class UMovieGraphAudioRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioRendererBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDefaultAudioRenderer
// 0x0000 (0x0058 - 0x0058)
class UMovieGraphDefaultAudioRenderer final : public UMovieGraphAudioRendererBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDefaultAudioRenderer">();
	}
	static class UMovieGraphDefaultAudioRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultAudioRenderer>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDefaultRenderer
// 0x0188 (0x01B0 - 0x0028)
class UMovieGraphDefaultRenderer final : public UMovieGraphRendererBase
{
public:
	TArray<class UMovieGraphRenderPassNode*>      RenderPassesInUse;                                 // 0x0028(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x178];                                     // 0x0038(0x0178)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDefaultRenderer">();
	}
	static class UMovieGraphDefaultRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultRenderer>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDeferredRenderPassNode
// 0x0008 (0x00C0 - 0x00B8)
class UMovieGraphDeferredRenderPassNode final : public UMovieGraphCoreRenderPassNode
{
public:
	uint8                                         bOverride_ViewModeIndex : 1;                       // 0x00B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EViewModeIndex                                ViewModeIndex;                                     // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDeferredRenderPassNode">();
	}
	static class UMovieGraphDeferredRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDeferredRenderPassNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphEdge
// 0x0010 (0x0038 - 0x0028)
class UMovieGraphEdge final : public UObject
{
public:
	class UMovieGraphPin*                         InputPin;                                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieGraphPin*                         OutputPin;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEdge">();
	}
	static class UMovieGraphEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEdge>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGetCVarValueNode
// 0x0018 (0x00B0 - 0x0098)
class UMovieGraphGetCVarValueNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_Name : 1;                                // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Name_0;                                            // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGetCVarValueNode">();
	}
	static class UMovieGraphGetCVarValueNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGetCVarValueNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalGameOverridesNode
// 0x0030 (0x00C8 - 0x0098)
class UMovieGraphGlobalGameOverridesNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_GameModeOverride : 1;                    // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CinematicQualitySettings : 1;            // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_TextureStreaming : 1;                    // 0x0098(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UseLODZero : 1;                          // 0x0098(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DisableHLODs : 1;                        // 0x0098(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UseHighQualityShadows : 1;               // 0x0098(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowDistanceScale : 1;                 // 0x0098(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowRadiusThreshold : 1;               // 0x0098(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverrideViewDistanceScale : 1;           // 0x0099(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ViewDistanceScale : 1;                   // 0x0099(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FlushGrassStreaming : 1;                 // 0x0099(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FlushStreamingManagers : 1;              // 0x0099(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VirtualTextureFeedbackFactor : 1;        // 0x0099(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DisableGPUTimeout : 1;                   // 0x0099(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class AGameModeBase>              GameModeOverride;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCinematicQualitySettings;                         // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineTextureStreamingMethod          TextureStreaming;                                  // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLODZero;                                       // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableHLODs;                                     // 0x00AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighQualityShadows;                            // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ShadowDistanceScale;                               // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowRadiusThreshold;                             // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ViewDistanceScale;                                 // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushGrassStreaming;                              // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushStreamingManagers;                           // 0x00BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         VirtualTextureFeedbackFactor;                      // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalGameOverridesNode">();
	}
	static class UMovieGraphGlobalGameOverridesNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalGameOverridesNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphInputNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphInputNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphInputNode">();
	}
	static class UMovieGraphInputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInputNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphLinearTimeStep
// 0x0000 (0x0180 - 0x0180)
class UMovieGraphLinearTimeStep final : public UMovieGraphCoreTimeStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphLinearTimeStep">();
	}
	static class UMovieGraphLinearTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphLinearTimeStep>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphModifierNode
// 0x0030 (0x00C8 - 0x0098)
class UMovieGraphModifierNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ModifierName : 1;                        // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ModifiedCollectionName : 1;              // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ModifierClass : 1;                       // 0x0098(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ModifierName;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ModifiedCollectionName;                            // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineCollectionModifier*       ModifierClass;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphModifierNode">();
	}
	static class UMovieGraphModifierNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphModifierNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphOutputNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphOutputNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphOutputNode">();
	}
	static class UMovieGraphOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutputNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphOutputSettingNode
// 0x0048 (0x00E0 - 0x0098)
class UMovieGraphOutputSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_OutputDirectory : 1;                     // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputResolution : 1;                    // 0x0098(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputFrameRate : 1;                     // 0x0098(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bOverwriteExistingOutput : 1;            // 0x0098(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ZeroPadFrameNumbers : 1;                 // 0x0098(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FrameNumberOffset : 1;                   // 0x0098(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_HandleFrameCount : 1;                    // 0x0098(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDirectoryPath                         OutputDirectory;                                   // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileNameFormat;                                    // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              OutputResolution;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             OutputFrameRate;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverwriteExistingOutput;                          // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ZeroPadFrameNumbers;                               // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameNumberOffset;                                 // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HandleFrameCount;                                  // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphOutputSettingNode">();
	}
	static class UMovieGraphOutputSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutputSettingNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphPathTracedRenderPassNode
// 0x0008 (0x00C0 - 0x00B8)
class UMovieGraphPathTracedRenderPassNode final : public UMovieGraphCoreRenderPassNode
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphPathTracedRenderPassNode">();
	}
	static class UMovieGraphPathTracedRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphPathTracedRenderPassNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphPin
// 0x0020 (0x0048 - 0x0028)
class UMovieGraphPin final : public UObject
{
public:
	class UMovieGraphNode*                        Node;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieGraphPinProperties               Properties;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UMovieGraphEdge*>                Edges;                                             // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphPin">();
	}
	static class UMovieGraphPin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphPin>();
	}
};

// Class MovieRenderPipelineCore.MoviePipelineBase
// 0x0030 (0x0058 - 0x0028)
class UMoviePipelineBase : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void RequestShutdown(bool bIsError);
	void Shutdown(bool bIsError);

	EMovieRenderPipelineState GetPipelineState() const;
	bool IsShutdownRequested() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineBase">();
	}
	static class UMoviePipelineBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphPipeline
// 0x0110 (0x0168 - 0x0058)
class UMovieGraphPipeline final : public UMoviePipelineBase
{
public:
	TArray<class UMovieGraphTimeStepBase*>        GraphTimeStepInstances;                            // 0x0058(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMovieGraphTimeStepBase*                GraphTimeStepInstance;                             // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphRendererBase*                GraphRendererInstance;                             // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphDataSourceBase*              GraphDataSourceInstance;                           // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphAudioRendererBase*           GraphAudioRendererInstance;                        // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipelineExecutorJob*              CurrentJob;                                        // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMoviePipelineExecutorShot*>     ActiveShotList;                                    // 0x0090(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UMovieGraphRenderPreviewWidget> PreviewWidgetClassToUse;                       // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
