#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MudGameplayRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function MudGameplayRuntime.FortPawnComponent_Mud.HandleASCInitialized
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_Mud_HandleASCInitialized final
{
public:
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        AffectedPawn;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MudGameplayRuntime.FortPawnComponent_Mud.HandleSurfaceTypeChanged
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_Mud_HandleSurfaceTypeChanged final
{
public:
	class AActor*                                 SurfaceActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              CurrentSurfaceType;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              PrevSurfaceType;                                   // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function MudGameplayRuntime.FortPawnComponent_Mud.OnAttachedParentCoveredInMud
// 0x00B0 (0x00B0 - 0x0000)
struct FortPawnComponent_Mud_OnAttachedParentCoveredInMud final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MudGameplayRuntime.FortPawnComponent_Mud.OnCreatureSprintingTagCountChanged
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_Mud_OnCreatureSprintingTagCountChanged final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MudGameplayRuntime.FortPawnComponent_Mud.OnCurieFireTagCountChanged
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_Mud_OnCurieFireTagCountChanged final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MudGameplayRuntime.FortPawnComponent_Mud.OnSlidingTagCountChanged
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_Mud_OnSlidingTagCountChanged final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MudGameplayRuntime.FortPawnComponent_Mud.OnSprintingTagCountChanged
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_Mud_OnSprintingTagCountChanged final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

