#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MultiInteractActorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MultiInteractActorComponent.MultiInteractActorComponent_C
// 0x0028 (0x01B0 - 0x0188)
class UMultiInteractActorComponent_C final : public UFortActorComponent_MultiInteract
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0188(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           RemoveInteractPlayerTag;                           // 0x0190(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AddInteractPlayerTag;                              // 0x0194(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LoopingMultiInteractTag;                           // 0x0198(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        RequiredDuration;                                  // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GCNLApplied;                                       // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddGCNL();
	void ExecuteGCNFromTag(class AFortPlayerPawn*& PlayerPawn, struct FGameplayTag& InteractTag, int32 PreviousInteractPlayerCount);
	void ExecuteUbergraph_MultiInteractActorComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void RemoveGCNL();
	void SetRequiredDuration(double NewRequiredDuration);
	void UpdateForPlayerJustJoinedInteraction(const class AFortPlayerStateAthena* JoinedPlayer);
	void UpdateForPlayerJustLeftInteraction(const class AFortPlayerStateAthena* LeftPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MultiInteractActorComponent_C">();
	}
	static class UMultiInteractActorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiInteractActorComponent_C>();
	}
};

}

