#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MultipleSubscriptionAlertModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function MultipleSubscriptionAlertModal.MultipleSubscriptionAlertModal_C.OnSetHowToCancelURL
// 0x0010 (0x0010 - 0x0000)
struct MultipleSubscriptionAlertModal_C_OnSetHowToCancelURL final
{
public:
	class FString                                 MoreInfoUrl;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function MultipleSubscriptionAlertModal.MultipleSubscriptionAlertModal_C.ExecuteUbergraph_MultipleSubscriptionAlertModal
// 0x0040 (0x0040 - 0x0000)
struct MultipleSubscriptionAlertModal_C_ExecuteUbergraph_MultipleSubscriptionAlertModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 K2Node_Event_MoreInfoUrl;                          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class URichTextButton_C*                      K2Node_DynamicCast_AsRich_Text_Button;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};

}

