#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NearestNeighborModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function NearestNeighborModel.NearestNeighborOptimizedNetworkLoader.LoadOptimizedNetwork
// 0x0018 (0x0018 - 0x0000)
struct NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork final
{
public:
	class FString                                 OnnxPath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function NearestNeighborModel.NearestNeighborOptimizedNetworkLoader.GetOptimizedNetwork
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork final
{
public:
	class UNearestNeighborOptimizedNetwork*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.ClipInputs
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborModel_ClipInputs final
{
public:
	TArray<float>                                 Input;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetNumParts
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetNumParts final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetPartNumVerts
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborModel_GetPartNumVerts final
{
public:
	int32                                         PartId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetPCACoeffNum
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborModel_GetPCACoeffNum final
{
public:
	int32                                         PartId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetPCACoeffStart
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborModel_GetPCACoeffStart final
{
public:
	int32                                         PartId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelInstance.Eval
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborModelInstance_Eval final
{
public:
	TArray<float>                                 InputData;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

