#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NetCore

#include "Basic.hpp"


namespace SDK
{

// Enum NetCore.ENetworkFailure
// NumValues: 0x000C
enum class ENetworkFailure : uint8
{
	NetDriverAlreadyExists                   = 0,
	NetDriverCreateFailure                   = 1,
	NetDriverListenFailure                   = 2,
	ConnectionLost                           = 3,
	ConnectionTimeout                        = 4,
	FailureReceived                          = 5,
	OutdatedClient                           = 6,
	OutdatedServer                           = 7,
	PendingConnectionFailure                 = 8,
	NetGuidMismatch                          = 9,
	NetChecksumMismatch                      = 10,
	ENetworkFailure_MAX                      = 11,
};

// Enum NetCore.ENetCloseResult
// NumValues: 0x0070
enum class ENetCloseResult : uint8
{
	NetDriverAlreadyExists                   = 0,
	NetDriverCreateFailure                   = 1,
	NetDriverListenFailure                   = 2,
	ConnectionLost                           = 3,
	ConnectionTimeout                        = 4,
	FailureReceived                          = 5,
	OutdatedClient                           = 6,
	OutdatedServer                           = 7,
	PendingConnectionFailure                 = 8,
	NetGuidMismatch                          = 9,
	NetChecksumMismatch                      = 10,
	SecurityMalformedPacket                  = 11,
	SecurityInvalidData                      = 12,
	SecurityClosed                           = 13,
	Unknown                                  = 14,
	Success                                  = 15,
	Extended                                 = 16,
	HostClosedConnection                     = 17,
	Disconnect                               = 18,
	Upgrade                                  = 19,
	PreLoginFailure                          = 20,
	JoinFailure                              = 21,
	JoinSplitFailure                         = 22,
	AddressResolutionFailed                  = 23,
	RPCDoS                                   = 24,
	Cleanup                                  = 25,
	MissingLevelPackage                      = 26,
	PacketHandlerIncomingError               = 27,
	ZeroLastByte                             = 28,
	ZeroSize                                 = 29,
	ReadHeaderFail                           = 30,
	ReadHeaderExtraFail                      = 31,
	AckSequenceMismatch                      = 32,
	BunchBadChannelIndex                     = 33,
	BunchChannelNameFail                     = 34,
	BunchWrongChannelType                    = 35,
	BunchHeaderOverflow                      = 36,
	BunchDataOverflow                        = 37,
	BunchServerPackageMapExports             = 38,
	BunchPrematureControlChannel             = 39,
	BunchPrematureChannel                    = 40,
	BunchPrematureControlClose               = 41,
	UnknownChannelType                       = 42,
	PrematureSend                            = 43,
	CorruptData                              = 44,
	SocketSendFailure                        = 45,
	BadChildConnectionIndex                  = 46,
	LogLimitInstant                          = 47,
	LogLimitSustained                        = 48,
	EncryptionFailure                        = 49,
	EncryptionTokenMissing                   = 50,
	ReceivedNetGUIDBunchFail                 = 51,
	MaxReliableExceeded                      = 52,
	ReceivedNextBunchFail                    = 53,
	ReceivedNextBunchQueueFail               = 54,
	PartialInitialReliableDestroy            = 55,
	PartialMergeReliableDestroy              = 56,
	PartialInitialNonByteAligned             = 57,
	PartialNonByteAligned                    = 58,
	PartialFinalPackageMapExports            = 59,
	PartialTooLarge                          = 60,
	AlreadyOpen                              = 61,
	ReliableBeforeOpen                       = 62,
	ReliableBufferOverflow                   = 63,
	RPCReliableBufferOverflow                = 64,
	ControlChannelClose                      = 65,
	ControlChannelEndianCheck                = 66,
	ControlChannelPlayerChannelFail          = 67,
	ControlChannelMessageUnknown             = 68,
	ControlChannelMessageFail                = 69,
	ControlChannelMessagePayloadFail         = 70,
	ControlChannelBunchOverflowed            = 71,
	ControlChannelQueueBunchOverflowed       = 72,
	ClientHasMustBeMappedGUIDs               = 73,
	ClientSentDestructionInfo                = 74,
	UnregisteredMustBeMappedGUID             = 75,
	ObjectReplicatorReceivedBunchFail        = 76,
	ContentBlockFail                         = 77,
	ContentBlockHeaderRepLayoutFail          = 78,
	ContentBlockHeaderIsActorFail            = 79,
	ContentBlockHeaderObjFail                = 80,
	ContentBlockHeaderPrematureEnd           = 81,
	ContentBlockHeaderSubObjectActor         = 82,
	ContentBlockHeaderBadParent              = 83,
	ContentBlockHeaderInvalidCreate          = 84,
	ContentBlockHeaderStablyNamedFail        = 85,
	ContentBlockHeaderNoSubObjectClass       = 86,
	ContentBlockHeaderUObjectSubObject       = 87,
	ContentBlockHeaderAActorSubObject        = 88,
	ContentBlockHeaderFail                   = 89,
	ContentBlockPayloadBitsFail              = 90,
	FieldHeaderRepIndex                      = 91,
	FieldHeaderBadRepIndex                   = 92,
	FieldHeaderPayloadBitsFail               = 93,
	FieldPayloadFail                         = 94,
	ReplicationChannelCountMaxedOut          = 95,
	BeaconControlFlowError                   = 96,
	BeaconUnableToParsePacket                = 97,
	BeaconAuthenticationFailure              = 98,
	BeaconLoginInvalidIdError                = 99,
	BeaconLoginInvalidAuthHandlerError       = 100,
	BeaconAuthError                          = 101,
	BeaconSpawnClientWorldPackageNameError   = 102,
	BeaconSpawnExistingActorError            = 103,
	BeaconSpawnFailureError                  = 104,
	BeaconSpawnNetGUIDAckNoActor             = 105,
	BeaconSpawnNetGUIDAckNoHost              = 106,
	BeaconSpawnUnexpectedError               = 107,
	IrisProtocolMismatch                     = 108,
	FaultDisconnect                          = 109,
	NotRecoverable                           = 110,
	ENetCloseResult_MAX                      = 111,
};

// Enum NetCore.EFastArraySerializerDeltaFlags
// NumValues: 0x0005
enum class EFastArraySerializerDeltaFlags : uint8
{
	None                                     = 0,
	HasBeenSerialized                        = 1,
	HasDeltaBeenRequested                    = 2,
	IsUsingDeltaSerialization                = 4,
	EFastArraySerializerDeltaFlags_MAX       = 5,
};

// ScriptStruct NetCore.NetAnalyticsDataConfig
// 0x0008 (0x0008 - 0x0000)
struct FNetAnalyticsDataConfig final
{
public:
	class FName                                   DataName;                                          // 0x0000(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0004(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct NetCore.FastArraySerializerItem
// 0x000C (0x000C - 0x0000)
struct FFastArraySerializerItem
{
public:
	int32                                         ReplicationID;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplicationKey;                                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MostRecentArrayReplicationKey;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

struct FFastArraySerializerItem;

struct FFastArraySerializer
{
public:
    uint8 ItemMap[80];
    int32 IDCounter;
    int32 ArrayReplicationKey;
    char GuidReferencesMap[0x50];
    char GuidReferencesMap_StructDelta[0x50];

    int32 CachedNumItems;
    int32 CachedNumItemsToConsiderForWriting;

    EFastArraySerializerDeltaFlags DeltaFlags;

    uint8 _Padding1[0x7];

    void MarkItemDirty(FFastArraySerializerItem& Item, bool markArrayDirty = true)
    {
        if (Item.ReplicationID == -1)
        {
            Item.ReplicationID = ++IDCounter;
            if (IDCounter == -1)
            {
                IDCounter++;
            }
        }

        Item.ReplicationKey++;
        if (markArrayDirty) MarkArrayDirty();
    }

    void MarkArrayDirty()
    {
        ArrayReplicationKey++;
        if (ArrayReplicationKey == -1)
        {
            ArrayReplicationKey++;
        }

        CachedNumItems = -1;
        CachedNumItemsToConsiderForWriting = -1;
    }
};
// ScriptStruct NetCore.StateStruct
// 0x0018 (0x0018 - 0x0000)
struct FStateStruct
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 StateName;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct NetCore.EscalationState
// 0x0018 (0x0030 - 0x0018)
struct FEscalationState : public FStateStruct
{
public:
	bool                                          bLogEscalate;                                      // 0x0018(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDormant;                                          // 0x0019(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         CooloffTime;                                       // 0x001A(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         AutoEscalateTime;                                  // 0x001C(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          HighestTimePeriod;                                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int8>                                  AllTimePeriods;                                    // 0x0020(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct NetCore.NetFaultState
// 0x0010 (0x0040 - 0x0030)
struct FNetFaultState final : public FEscalationState
{
public:
	bool                                          bCloseConnection;                                  // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x1];                                       // 0x0031(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	int16                                         EscalateQuotaFaultsPerPeriod;                      // 0x0032(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          EscalateQuotaFaultPercentPerPeriod;                // 0x0034(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x1];                                       // 0x0035(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	int16                                         DescalateQuotaFaultsPerPeriod;                     // 0x0036(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DescalateQuotaFaultPercentPerPeriod;               // 0x0038(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          EscalateQuotaTimePeriod;                           // 0x0039(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

