#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NetworkPrediction

#include "Basic.hpp"

#include "NetworkPrediction_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class NetworkPrediction.NetworkPredictionComponent
// 0x01F0 (0x0290 - 0x00A0)
class UNetworkPredictionComponent : public UActorComponent
{
public:
	struct FNetworkPredictionProxy                NetworkPredictionProxy;                            // 0x00A0(0x00B0)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FReplicationProxy                      ReplicationProxy_ServerRPC;                        // 0x0150(0x0050)(Protected, NativeAccessSpecifierProtected)
	struct FReplicationProxy                      ReplicationProxy_Autonomous;                       // 0x01A0(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FReplicationProxy                      ReplicationProxy_Simulated;                        // 0x01F0(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FReplicationProxy                      ReplicationProxy_Replay;                           // 0x0240(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)

public:
	void ServerReceiveClientInput(const struct FServerReplicationRPCParameter& ProxyParameter);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionComponent">();
	}
	static class UNetworkPredictionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionComponent>();
	}
};

// Class NetworkPrediction.NetworkPredictionPhysicsComponent
// 0x0120 (0x01C0 - 0x00A0)
class UNetworkPredictionPhysicsComponent final : public UActorComponent
{
public:
	struct FNetworkPredictionProxy                NetworkPredictionProxy;                            // 0x00A0(0x00B0)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    UpdatedPrimitive;                                  // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FReplicationProxy                      ReplicationProxy;                                  // 0x0160(0x0050)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionPhysicsComponent">();
	}
	static class UNetworkPredictionPhysicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionPhysicsComponent>();
	}
};

// Class NetworkPrediction.NetworkPredictionReplicatedManager
// 0x0010 (0x02A0 - 0x0290)
class ANetworkPredictionReplicatedManager final : public AActor
{
public:
	struct FSharedPackageMap                      SharedPackageMap;                                  // 0x0290(0x0010)(Net, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionReplicatedManager">();
	}
	static class ANetworkPredictionReplicatedManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANetworkPredictionReplicatedManager>();
	}
};

// Class NetworkPrediction.NetworkPredictionSettingsObject
// 0x0040 (0x0068 - 0x0028)
class UNetworkPredictionSettingsObject final : public UObject
{
public:
	struct FNetworkPredictionSettings             Settings;                                          // 0x0028(0x0030)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FNetworkPredictionDevHUD>       DevHUDs;                                           // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionSettingsObject">();
	}
	static class UNetworkPredictionSettingsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionSettingsObject>();
	}
};

// Class NetworkPrediction.NetworkPredictionWorldManager
// 0x0640 (0x0670 - 0x0030)
class UNetworkPredictionWorldManager final : public UWorldSubsystem
{
public:
	class ANetworkPredictionReplicatedManager*    ReplicatedManager;                                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x638];                                     // 0x0038(0x0638)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkPredictionWorldManager">();
	}
	static class UNetworkPredictionWorldManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkPredictionWorldManager>();
	}
};

}

