#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NeuralMorphModel

#include "Basic.hpp"

#include "MLDeformerFramework_classes.hpp"
#include "NeuralMorphModel_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class NeuralMorphModel.NeuralMorphInputInfo
// 0x0020 (0x0088 - 0x0068)
class UNeuralMorphInputInfo final : public UMLDeformerMorphModelInputInfo
{
public:
	TArray<struct FNeuralMorphBoneGroup>          BoneGroups;                                        // 0x0068(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FNeuralMorphCurveGroup>         CurveGroups;                                       // 0x0078(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphInputInfo">();
	}
	static class UNeuralMorphInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphInputInfo>();
	}
};

// Class NeuralMorphModel.NeuralMorphModelInstance
// 0x0028 (0x00D0 - 0x00A8)
class UNeuralMorphModelInstance final : public UMLDeformerMorphModelInstance
{
public:
	class UNeuralMorphNetworkInstance*            NetworkInstance;                                   // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x20];                                      // 0x00B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphModelInstance">();
	}
	static class UNeuralMorphModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphModelInstance>();
	}
};

// Class NeuralMorphModel.NeuralMorphModelVizSettings
// 0x0008 (0x0040 - 0x0038)
class UNeuralMorphModelVizSettings final : public UMLDeformerMorphModelVizSettings
{
public:
	ENeuralMorphMaskVizMode                       MaskVizMode;                                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphModelVizSettings">();
	}
	static class UNeuralMorphModelVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphModelVizSettings>();
	}
};

// Class NeuralMorphModel.NeuralMorphMLPLayer
// 0x0030 (0x0058 - 0x0028)
class UNeuralMorphMLPLayer final : public UObject
{
public:
	int32                                         NumInputs;                                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumOutputs;                                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Depth;                                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<float>                                 Weights;                                           // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Biases;                                            // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphMLPLayer">();
	}
	static class UNeuralMorphMLPLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphMLPLayer>();
	}
};

// Class NeuralMorphModel.NeuralMorphMLP
// 0x0010 (0x0038 - 0x0028)
class UNeuralMorphMLP final : public UObject
{
public:
	TArray<class UNeuralMorphMLPLayer*>           Layers;                                            // 0x0028(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphMLP">();
	}
	static class UNeuralMorphMLP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphMLP>();
	}
};

// Class NeuralMorphModel.NeuralMorphNetwork
// 0x0080 (0x00A8 - 0x0028)
class UNeuralMorphNetwork final : public UObject
{
public:
	class UNeuralMorphMLP*                        MainMLP;                                           // 0x0028(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNeuralMorphMLP*                        GroupMLP;                                          // 0x0030(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNNEModelData*                          MainModelData;                                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UNNEModelData*                          GroupModelData;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<float>                                 InputMeans;                                        // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 InputStd;                                          // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	ENeuralMorphMode                              Mode;                                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NumMorphs;                                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumMorphsPerBone;                                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumBones;                                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumCurves;                                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumFloatsPerCurve;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumGroups;                                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumItemsPerGroup;                                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphNetwork">();
	}
	static class UNeuralMorphNetwork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphNetwork>();
	}
};

// Class NeuralMorphModel.NeuralMorphNetworkInstance
// 0x0058 (0x0080 - 0x0028)
class UNeuralMorphNetworkInstance final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	class UNeuralMorphNetwork*                    Network;                                           // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphNetworkInstance">();
	}
	static class UNeuralMorphNetworkInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphNetworkInstance>();
	}
};

// Class NeuralMorphModel.NeuralMorphModel
// 0x0100 (0x0290 - 0x0190)
class UNeuralMorphModel final : public UMLDeformerMorphModel
{
public:
	TArray<struct FNeuralMorphBoneGroup>          BoneGroups;                                        // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNeuralMorphCurveGroup>         CurveGroups;                                       // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FNeuralMorphMaskInfo> BoneMaskInfos;                                    // 0x01B0(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FNeuralMorphMaskInfo> BoneGroupMaskInfos;                               // 0x0200(0x0050)(NativeAccessSpecifierPublic)
	ENeuralMorphMode                              Mode;                                              // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         LocalNumMorphTargetsPerBone;                       // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GlobalNumMorphTargets;                             // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumIterations;                                     // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalNumHiddenLayers;                              // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalNumNeuronsPerLayer;                           // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GlobalNumHiddenLayers;                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GlobalNumNeuronsPerLayer;                          // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BatchSize;                                         // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LearningRate;                                      // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RegularizationFactor;                              // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableBoneMasks;                                  // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SmoothLossBeta;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UNeuralMorphNetwork*                    NeuralMorphNetwork;                                // 0x0288(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeuralMorphModel">();
	}
	static class UNeuralMorphModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralMorphModel>();
	}
};

}

