#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: OnlineSubsystemUtils

#include "Basic.hpp"

#include "OnlineSubsystem_structs.hpp"
#include "Engine_classes.hpp"
#include "AudioMixer_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemUtils.AchievementBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAchievementBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetCachedAchievementDescription(class UObject* WorldContextObject, class APlayerController* PlayerController, class FName AchievementID, bool* bFoundID, class FText* Title, class FText* LockedDescription, class FText* UnlockedDescription, bool* bHidden);
	static void GetCachedAchievementProgress(class UObject* WorldContextObject, class APlayerController* PlayerController, class FName AchievementID, bool* bFoundID, float* Progress);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementBlueprintLibrary">();
	}
	static class UAchievementBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementBlueprintLibrary>();
	}
};

// Class OnlineSubsystemUtils.AchievementQueryCallbackProxy
// 0x0038 (0x0068 - 0x0030)
class UAchievementQueryCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UAchievementQueryCallbackProxy* CacheAchievementDescriptions(class UObject* WorldContextObject, class APlayerController* PlayerController);
	static class UAchievementQueryCallbackProxy* CacheAchievements(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementQueryCallbackProxy">();
	}
	static class UAchievementQueryCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementQueryCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.AchievementWriteCallbackProxy
// 0x0050 (0x0080 - 0x0030)
class UAchievementWriteCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UAchievementWriteCallbackProxy* WriteAchievementProgress(class UObject* WorldContextObject, class APlayerController* PlayerController, class FName AchievementName, float Progress, int32 UserTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementWriteCallbackProxy">();
	}
	static class UAchievementWriteCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementWriteCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.ConnectionCallbackProxy
// 0x0048 (0x0078 - 0x0030)
class UConnectionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void(int32 ErrorCode)> OnSuccess;                                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ErrorCode)> OnFailure;                                       // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UConnectionCallbackProxy* ConnectToService(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConnectionCallbackProxy">();
	}
	static class UConnectionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConnectionCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.CreateSessionCallbackProxy
// 0x0068 (0x0098 - 0x0030)
class UCreateSessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UCreateSessionCallbackProxy* CreateSession(class UObject* WorldContextObject, class APlayerController* PlayerController, int32 PublicConnections, bool bUseLAN);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreateSessionCallbackProxy">();
	}
	static class UCreateSessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateSessionCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.DestroySessionCallbackProxy
// 0x0048 (0x0078 - 0x0030)
class UDestroySessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UDestroySessionCallbackProxy* DestroySession(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DestroySessionCallbackProxy">();
	}
	static class UDestroySessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestroySessionCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.EndMatchCallbackProxy
// 0x0050 (0x0080 - 0x0030)
class UEndMatchCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UEndMatchCallbackProxy* EndMatch(class UObject* WorldContextObject, class APlayerController* PlayerController, TScriptInterface<class ITurnBasedMatchInterface> MatchActor, const class FString& MatchID, EMPMatchOutcome LocalPlayerOutcome, EMPMatchOutcome OtherPlayersOutcome);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndMatchCallbackProxy">();
	}
	static class UEndMatchCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndMatchCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.EndTurnCallbackProxy
// 0x0048 (0x0078 - 0x0030)
class UEndTurnCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UEndTurnCallbackProxy* EndTurn(class UObject* WorldContextObject, class APlayerController* PlayerController, const class FString& MatchID, TScriptInterface<class ITurnBasedMatchInterface> TurnBasedMatchInterface);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndTurnCallbackProxy">();
	}
	static class UEndTurnCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndTurnCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.FindSessionsCallbackProxy
// 0x0060 (0x0090 - 0x0030)
class UFindSessionsCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UFindSessionsCallbackProxy* FindSessions(class UObject* WorldContextObject, class APlayerController* PlayerController, int32 MaxResults, bool bUseLAN);
	static int32 GetCurrentPlayers(const struct FBlueprintSessionResult& Result);
	static int32 GetMaxPlayers(const struct FBlueprintSessionResult& Result);
	static int32 GetPingInMs(const struct FBlueprintSessionResult& Result);
	static class FString GetServerName(const struct FBlueprintSessionResult& Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FindSessionsCallbackProxy">();
	}
	static class UFindSessionsCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFindSessionsCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.FindTurnBasedMatchCallbackProxy
// 0x0058 (0x0088 - 0x0030)
class UFindTurnBasedMatchCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void(const class FString& MatchID)> OnSuccess;                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& MatchID)> OnFailure;                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UFindTurnBasedMatchCallbackProxy* FindTurnBasedMatch(class UObject* WorldContextObject, class APlayerController* PlayerController, TScriptInterface<class ITurnBasedMatchInterface> MatchActor, int32 MinPlayers, int32 MaxPlayers, int32 PlayerGroup, bool ShowExistingMatches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FindTurnBasedMatchCallbackProxy">();
	}
	static class UFindTurnBasedMatchCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFindTurnBasedMatchCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.InAppPurchaseCallbackProxy2
// 0x0080 (0x00A8 - 0x0028)
class UInAppPurchaseCallbackProxy2 final : public UObject
{
public:
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const TArray<struct FInAppPurchaseReceiptInfo2>& InAppPurchaseReceipts)> OnSuccess; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const TArray<struct FInAppPurchaseReceiptInfo2>& InAppPurchaseReceipts)> OnFailure; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x60];                                      // 0x0048(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UInAppPurchaseCallbackProxy2* CreateProxyObjectForInAppPurchase(class APlayerController* PlayerController, const struct FInAppPurchaseProductRequest2& ProductRequest);
	static class UInAppPurchaseCallbackProxy2* CreateProxyObjectForInAppPurchaseQueryOwned(class APlayerController* PlayerController);
	static class UInAppPurchaseCallbackProxy2* CreateProxyObjectForInAppPurchaseUnprocessedPurchases(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseCallbackProxy2">();
	}
	static class UInAppPurchaseCallbackProxy2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseCallbackProxy2>();
	}
};

// Class OnlineSubsystemUtils.InAppPurchaseCheckoutCallbackProxy
// 0x0078 (0x00A0 - 0x0028)
class UInAppPurchaseCheckoutCallbackProxy final : public UObject
{
public:
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const struct FInAppPurchaseReceiptInfo2& InAppPurchaseReceipt)> OnSuccess; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const struct FInAppPurchaseReceiptInfo2& InAppPurchaseReceipt)> OnFailure; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x58];                                      // 0x0048(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UInAppPurchaseCheckoutCallbackProxy* CreateProxyObjectForInAppPurchaseCheckout(class APlayerController* PlayerController, const struct FInAppPurchaseProductRequest2& ProductRequest);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseCheckoutCallbackProxy">();
	}
	static class UInAppPurchaseCheckoutCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseCheckoutCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.InAppPurchaseFinalizeProxy
// 0x0000 (0x0028 - 0x0028)
class UInAppPurchaseFinalizeProxy final : public UObject
{
public:
	static class UInAppPurchaseFinalizeProxy* CreateProxyObjectForInAppPurchaseFinalize(const struct FInAppPurchaseReceiptInfo2& InAppPurchaseReceipt, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseFinalizeProxy">();
	}
	static class UInAppPurchaseFinalizeProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseFinalizeProxy>();
	}
};

// Class OnlineSubsystemUtils.InAppPurchaseQueryCallbackProxy2
// 0x0040 (0x0068 - 0x0028)
class UInAppPurchaseQueryCallbackProxy2 final : public UObject
{
public:
	TMulticastInlineDelegate<void(const TArray<struct FOnlineProxyStoreOffer>& InAppOfferInformation)> OnSuccess; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FOnlineProxyStoreOffer>& InAppOfferInformation)> OnFailure; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UInAppPurchaseQueryCallbackProxy2* CreateProxyObjectForInAppPurchaseQuery(class APlayerController* PlayerController, const TArray<class FString>& ProductIdentifiers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseQueryCallbackProxy2">();
	}
	static class UInAppPurchaseQueryCallbackProxy2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseQueryCallbackProxy2>();
	}
};

// Class OnlineSubsystemUtils.InAppPurchaseReceiptsCallbackProxy
// 0x0060 (0x0088 - 0x0028)
class UInAppPurchaseReceiptsCallbackProxy final : public UObject
{
public:
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const TArray<struct FInAppPurchaseReceiptInfo2>& InAppPurchaseReceipts)> OnSuccess; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const TArray<struct FInAppPurchaseReceiptInfo2>& InAppPurchaseReceipts)> OnFailure; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x40];                                      // 0x0048(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UInAppPurchaseReceiptsCallbackProxy* CreateProxyObjectForInAppPurchaseGetKnownReceipts(class APlayerController* PlayerController);
	static class UInAppPurchaseReceiptsCallbackProxy* CreateProxyObjectForInAppPurchaseQueryOwnedProducts(class APlayerController* PlayerController);
	static class UInAppPurchaseReceiptsCallbackProxy* CreateProxyObjectForInAppPurchaseRestoreOwnedProducts(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseReceiptsCallbackProxy">();
	}
	static class UInAppPurchaseReceiptsCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseReceiptsCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.InAppPurchaseRestoreCallbackProxy2
// 0x0088 (0x00B0 - 0x0028)
class UInAppPurchaseRestoreCallbackProxy2 final : public UObject
{
public:
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const TArray<struct FInAppPurchaseRestoreInfo2>& InAppPurchaseRestoreInfo)> OnSuccess; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EInAppPurchaseStatus PurchaseStatus, const TArray<struct FInAppPurchaseRestoreInfo2>& InAppPurchaseRestoreInfo)> OnFailure; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x68];                                      // 0x0048(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UInAppPurchaseRestoreCallbackProxy2* CreateProxyObjectForInAppPurchaseRestore(const TArray<struct FInAppPurchaseProductRequest2>& ConsumableProductFlags, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InAppPurchaseRestoreCallbackProxy2">();
	}
	static class UInAppPurchaseRestoreCallbackProxy2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseRestoreCallbackProxy2>();
	}
};

// Class OnlineSubsystemUtils.IpConnection
// 0x0090 (0x1E88 - 0x1DF8)
class UIpConnection : public UNetConnection
{
public:
	uint8                                         Pad_1DF8[0x74];                                    // 0x1DF8(0x0074)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SocketErrorDisconnectDelay;                        // 0x1E6C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E70[0x18];                                    // 0x1E70(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IpConnection">();
	}
	static class UIpConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIpConnection>();
	}
};

// Class OnlineSubsystemUtils.IpNetDriver
// 0x00B0 (0x0868 - 0x07B8)
class UIpNetDriver : public UNetDriver
{
public:
	uint8                                         LogPortUnreach : 1;                                // 0x07B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         AllowPlayerPortUnreach : 1;                        // 0x07B8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExitOnBindFailure : 1;                            // 0x07B8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        MaxPortCountToTry;                                 // 0x07BC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C0[0x4];                                      // 0x07C0(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        ServerDesiredSocketReceiveBufferBytes;             // 0x07C4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ServerDesiredSocketSendBufferBytes;                // 0x07C8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ClientDesiredSocketReceiveBufferBytes;             // 0x07CC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ClientDesiredSocketSendBufferBytes;                // 0x07D0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        MaxSecondsInReceive;                               // 0x07D8(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NbPacketsBetweenReceiveTimeTest;                   // 0x07E0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ResolutionConnectionTimeout;                       // 0x07E4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E8[0x80];                                     // 0x07E8(0x0080)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IpNetDriver">();
	}
	static class UIpNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIpNetDriver>();
	}
};

// Class OnlineSubsystemUtils.JoinSessionCallbackProxy
// 0x0168 (0x0198 - 0x0030)
class UJoinSessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x148];                                     // 0x0050(0x0148)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UJoinSessionCallbackProxy* JoinSession(class UObject* WorldContextObject, class APlayerController* PlayerController, const struct FBlueprintSessionResult& SearchResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JoinSessionCallbackProxy">();
	}
	static class UJoinSessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinSessionCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.LeaderboardBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class ULeaderboardBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool WriteLeaderboardInteger(class APlayerController* PlayerController, class FName StatName, int32 StatValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeaderboardBlueprintLibrary">();
	}
	static class ULeaderboardBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardBlueprintLibrary>();
	}
};

// Class OnlineSubsystemUtils.LeaderboardFlushCallbackProxy
// 0x0040 (0x0068 - 0x0028)
class ULeaderboardFlushCallbackProxy final : public UObject
{
public:
	TMulticastInlineDelegate<void(class FName SessionName)> OnSuccess;                               // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName SessionName)> OnFailure;                               // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class ULeaderboardFlushCallbackProxy* CreateProxyObjectForFlush(class APlayerController* PlayerController, class FName SessionName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeaderboardFlushCallbackProxy">();
	}
	static class ULeaderboardFlushCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardFlushCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.LeaderboardQueryCallbackProxy
// 0x0068 (0x0090 - 0x0028)
class ULeaderboardQueryCallbackProxy final : public UObject
{
public:
	TMulticastInlineDelegate<void(int32 LeaderboardValue)> OnSuccess;                                // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 LeaderboardValue)> OnFailure;                                // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class ULeaderboardQueryCallbackProxy* CreateProxyObjectForIntQuery(class APlayerController* PlayerController, class FName StatName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeaderboardQueryCallbackProxy">();
	}
	static class ULeaderboardQueryCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardQueryCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.LogoutCallbackProxy
// 0x0038 (0x0068 - 0x0030)
class ULogoutCallbackProxy final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class APlayerController* PlayerController)> OnSuccess;             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerController* PlayerController)> OnFailure;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class ULogoutCallbackProxy* Logout(class UObject* WorldContextObject, class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LogoutCallbackProxy">();
	}
	static class ULogoutCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogoutCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.OnlineBeacon
// 0x0030 (0x02C0 - 0x0290)
class AOnlineBeacon : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BeaconConnectionInitialTimeout;                    // 0x0298(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BeaconConnectionTimeout;                           // 0x029C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNetDriver*                             NetDriver;                                         // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x18];                                     // 0x02A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeacon">();
	}
	static class AOnlineBeacon* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeacon>();
	}
};

// Class OnlineSubsystemUtils.OnlineBeaconClient
// 0x0060 (0x0320 - 0x02C0)
class AOnlineBeaconClient : public AOnlineBeacon
{
public:
	class AOnlineBeaconHostObject*                BeaconOwner;                                       // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNetConnection*                         BeaconConnection;                                  // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeaconConnectionState                        ConnectionState;                                   // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x4F];                                     // 0x02D1(0x004F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ClientOnConnected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeaconClient">();
	}
	static class AOnlineBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeaconClient>();
	}
};

// Class OnlineSubsystemUtils.OnlineBeaconHost
// 0x0110 (0x03D0 - 0x02C0)
class AOnlineBeaconHost : public AOnlineBeacon
{
public:
	int32                                         ListenPort;                                        // 0x02C0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseAddressAndPort;                              // 0x02C4(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAuthRequired;                                     // 0x02C5(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C6[0x2];                                      // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        MaxAuthTokenSize;                                  // 0x02C8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x54];                                     // 0x02CC(0x0054)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AOnlineBeaconClient*>            ClientActors;                                      // 0x0320(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_330[0xA0];                                     // 0x0330(0x00A0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeaconHost">();
	}
	static class AOnlineBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeaconHost>();
	}
};

// Class OnlineSubsystemUtils.OnlineBeaconHostObject
// 0x0028 (0x02B8 - 0x0290)
class AOnlineBeaconHostObject : public AActor
{
public:
	class FString                                 BeaconTypeName;                                    // 0x0290(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AOnlineBeaconClient>        ClientBeaconActorClass;                            // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AOnlineBeaconClient*>            ClientActors;                                      // 0x02A8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineBeaconHostObject">();
	}
	static class AOnlineBeaconHostObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlineBeaconHostObject>();
	}
};

// Class OnlineSubsystemUtils.OnlineEngineInterfaceImpl
// 0x0160 (0x0188 - 0x0028)
class UOnlineEngineInterfaceImpl final : public UOnlineEngineInterface
{
public:
	TMap<class FName, class FName>                MappedUniqueNetIdTypes;                            // 0x0028(0x0050)(Config, NativeAccessSpecifierPrivate)
	TArray<class FName>                           CompatibleUniqueNetIdTypes;                        // 0x0078(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FName                                   VoiceSubsystemNameOverride;                        // 0x0088(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0xFC];                                      // 0x008C(0x00FC)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineEngineInterfaceImpl">();
	}
	static class UOnlineEngineInterfaceImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineEngineInterfaceImpl>();
	}
};

// Class OnlineSubsystemUtils.OnlinePIESettings
// 0x0018 (0x0048 - 0x0030)
class UOnlinePIESettings final : public UDeveloperSettings
{
public:
	bool                                          bOnlinePIEEnabled;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPIELoginSettingsInternal>      Logins;                                            // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlinePIESettings">();
	}
	static class UOnlinePIESettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlinePIESettings>();
	}
};

// Class OnlineSubsystemUtils.OnlineServicesEngineInterfaceImpl
// 0x0000 (0x0028 - 0x0028)
class UOnlineServicesEngineInterfaceImpl final : public UOnlineEngineInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineServicesEngineInterfaceImpl">();
	}
	static class UOnlineServicesEngineInterfaceImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineServicesEngineInterfaceImpl>();
	}
};

// Class OnlineSubsystemUtils.OnlineSessionClient
// 0x01B8 (0x01E0 - 0x0028)
class UOnlineSessionClient : public UOnlineSession
{
public:
	uint8                                         Pad_28[0x1B0];                                     // 0x0028(0x01B0)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsFromInvite;                                     // 0x01D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandlingDisconnect;                               // 0x01D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSessionClient">();
	}
	static class UOnlineSessionClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSessionClient>();
	}
};

// Class OnlineSubsystemUtils.PartyBeaconClient
// 0x00C8 (0x03E8 - 0x0320)
class APartyBeaconClient : public AOnlineBeaconClient
{
public:
	uint8                                         Pad_320[0x30];                                     // 0x0320(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 DestSessionId;                                     // 0x0350(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPartyReservation                      PendingReservation;                                // 0x0360(0x0058)(Protected, NativeAccessSpecifierProtected)
	EClientRequestType                            RequestType;                                       // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingReservationSent;                           // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCancelReservation;                                // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BB[0x2D];                                     // 0x03BB(0x002D)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ClientCancelReservationResponse(EPartyReservationResult ReservationResponse);
	void ClientReservationResponse(EPartyReservationResult ReservationResponse);
	void ClientSendReservationFull();
	void ClientSendReservationUpdates(int32 NumRemainingReservations);
	void ServerAddOrUpdateReservationRequest(const class FString& SessionId, const struct FPartyReservation& Reservation);
	void ServerCancelReservationRequest(const struct FUniqueNetIdRepl& PartyLeader);
	void ServerRemoveMemberFromReservationRequest(const class FString& SessionId, const struct FPartyReservation& ReservationUpdate);
	void ServerReservationRequest(const class FString& SessionId, const struct FPartyReservation& Reservation);
	void ServerUpdateReservationRequest(const class FString& SessionId, const struct FPartyReservation& ReservationUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyBeaconClient">();
	}
	static class APartyBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<APartyBeaconClient>();
	}
};

// Class OnlineSubsystemUtils.PartyBeaconHost
// 0x0078 (0x0330 - 0x02B8)
class APartyBeaconHost : public AOnlineBeaconHostObject
{
public:
	class UPartyBeaconState*                      State;                                             // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x60];                                     // 0x02C0(0x0060)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bLogoutOnSessionTimeout;                           // 0x0320(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsValidationStrRequired;                          // 0x0321(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SessionTimeoutSecs;                                // 0x0324(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TravelSessionTimeoutSecs;                          // 0x0328(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyBeaconHost">();
	}
	static class APartyBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<APartyBeaconHost>();
	}
};

// Class OnlineSubsystemUtils.PartyBeaconState
// 0x0070 (0x0098 - 0x0028)
class UPartyBeaconState : public UObject
{
public:
	class FName                                   SessionName;                                       // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumConsumedReservations;                           // 0x002C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxReservations;                                   // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumTeams;                                          // 0x0034(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumPlayersPerTeam;                                 // 0x0038(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TeamAssignmentMethod;                              // 0x003C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ReservedHostTeamNum;                               // 0x0040(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ForceTeamNum;                                      // 0x0044(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRestrictCrossConsole;                             // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         PlatformCrossplayRestrictions;                     // 0x0050(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPartyBeaconCrossplayPlatformMapping> PlatformTypeMapping;                         // 0x0060(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnableRemovalRequests;                            // 0x0070(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRespectCompetitiveIntegrity;                      // 0x0071(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPartyReservation>              Reservations;                                      // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyBeaconState">();
	}
	static class UPartyBeaconState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyBeaconState>();
	}
};

// Class OnlineSubsystemUtils.QuitMatchCallbackProxy
// 0x0048 (0x0078 - 0x0030)
class UQuitMatchCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UQuitMatchCallbackProxy* QuitMatch(class UObject* WorldContextObject, class APlayerController* PlayerController, const class FString& MatchID, EMPMatchOutcome Outcome, int32 TurnTimeoutInSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"QuitMatchCallbackProxy">();
	}
	static class UQuitMatchCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuitMatchCallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.ShowLoginUICallbackProxy
// 0x0030 (0x0060 - 0x0030)
class UShowLoginUICallbackProxy final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class APlayerController* PlayerController)> OnSuccess;             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerController* PlayerController)> OnFailure;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UShowLoginUICallbackProxy* ShowExternalLoginUI(class UObject* WorldContextObject, class APlayerController* InPlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShowLoginUICallbackProxy">();
	}
	static class UShowLoginUICallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowLoginUICallbackProxy>();
	}
};

// Class OnlineSubsystemUtils.SpectatorBeaconClient
// 0x00F8 (0x0418 - 0x0320)
class ASpectatorBeaconClient : public AOnlineBeaconClient
{
public:
	uint8                                         Pad_320[0x30];                                     // 0x0320(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 DestSessionId;                                     // 0x0350(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSpectatorReservation                  PendingReservation;                                // 0x0360(0x0088)(Protected, NativeAccessSpecifierProtected)
	ESpectatorClientRequestType                   RequestType;                                       // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingReservationSent;                           // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCancelReservation;                                // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3EB[0x2D];                                     // 0x03EB(0x002D)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ClientCancelReservationResponse(ESpectatorReservationResult ReservationResponse);
	void ClientReservationResponse(ESpectatorReservationResult ReservationResponse);
	void ClientSendReservationFull();
	void ClientSendReservationUpdates(int32 NumRemainingReservations);
	void ServerCancelReservationRequest(const struct FUniqueNetIdRepl& Spectator);
	void ServerReservationRequest(const class FString& SessionId, const struct FSpectatorReservation& Reservation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpectatorBeaconClient">();
	}
	static class ASpectatorBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpectatorBeaconClient>();
	}
};

// Class OnlineSubsystemUtils.SpectatorBeaconHost
// 0x0078 (0x0330 - 0x02B8)
class ASpectatorBeaconHost : public AOnlineBeaconHostObject
{
public:
	class USpectatorBeaconState*                  State;                                             // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x60];                                     // 0x02C0(0x0060)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bLogoutOnSessionTimeout;                           // 0x0320(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsValidationStrRequired;                          // 0x0321(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SessionTimeoutSecs;                                // 0x0324(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TravelSessionTimeoutSecs;                          // 0x0328(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpectatorBeaconHost">();
	}
	static class ASpectatorBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpectatorBeaconHost>();
	}
};

// Class OnlineSubsystemUtils.SpectatorBeaconState
// 0x0030 (0x0058 - 0x0028)
class USpectatorBeaconState : public UObject
{
public:
	class FName                                   SessionName;                                       // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumConsumedReservations;                           // 0x002C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxReservations;                                   // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRestrictCrossConsole;                             // 0x0034(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FSpectatorReservation>          Reservations;                                      // 0x0038(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpectatorBeaconState">();
	}
	static class USpectatorBeaconState* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpectatorBeaconState>();
	}
};

// Class OnlineSubsystemUtils.TestBeaconClient
// 0x0000 (0x0320 - 0x0320)
class ATestBeaconClient final : public AOnlineBeaconClient
{
public:
	void ClientPing();
	void ServerPong();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestBeaconClient">();
	}
	static class ATestBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATestBeaconClient>();
	}
};

// Class OnlineSubsystemUtils.TestBeaconHost
// 0x0000 (0x02B8 - 0x02B8)
class ATestBeaconHost final : public AOnlineBeaconHostObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestBeaconHost">();
	}
	static class ATestBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATestBeaconHost>();
	}
};

// Class OnlineSubsystemUtils.TurnBasedBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UTurnBasedBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetIsMyTurn(class UObject* WorldContextObject, class APlayerController* PlayerController, const class FString& MatchID, bool* bIsMyTurn);
	static void GetMyPlayerIndex(class UObject* WorldContextObject, class APlayerController* PlayerController, const class FString& MatchID, int32* PlayerIndex);
	static void GetPlayerDisplayName(class UObject* WorldContextObject, class APlayerController* PlayerController, const class FString& MatchID, int32 PlayerIndex, class FString* PlayerDisplayName);
	static void RegisterTurnBasedMatchInterfaceObject(class UObject* WorldContextObject, class APlayerController* PlayerController, class UObject* Object);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TurnBasedBlueprintLibrary">();
	}
	static class UTurnBasedBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTurnBasedBlueprintLibrary>();
	}
};

// Class OnlineSubsystemUtils.VoipListenerSynthComponent
// 0x0060 (0x0960 - 0x0900)
class UVoipListenerSynthComponent final : public USynthComponent
{
public:
	uint8                                         Pad_900[0x60];                                     // 0x0900(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool IsIdling();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoipListenerSynthComponent">();
	}
	static class UVoipListenerSynthComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoipListenerSynthComponent>();
	}
};

}

