#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: OpenColorIO

#include "Basic.hpp"

#include "OpenColorIO_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OpenColorIO.OpenColorIOBlueprintLibrary.ApplyColorSpaceTransform
// 0x00B8 (0x00B8 - 0x0000)
struct OpenColorIOBlueprintLibrary_ApplyColorSpaceTransform final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOpenColorIOColorConversionSettings    ConversionSettings;                                // 0x0008(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTexture*                               InputTexture;                                      // 0x00A0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 OutputRenderTarget;                                // 0x00A8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function OpenColorIO.OpenColorIOConfiguration.ReloadExistingColorspaces
// 0x0001 (0x0001 - 0x0000)
struct OpenColorIOConfiguration_ReloadExistingColorspaces final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OpenColorIO.OpenColorIODisplayExtensionWrapper.CreateInGameOpenColorIODisplayExtension
// 0x00A8 (0x00A8 - 0x0000)
struct OpenColorIODisplayExtensionWrapper_CreateInGameOpenColorIODisplayExtension final
{
public:
	struct FOpenColorIODisplayConfiguration       InDisplayConfiguration;                            // 0x0000(0x00A0)(Parm, NativeAccessSpecifierPublic)
	class UOpenColorIODisplayExtensionWrapper*    ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OpenColorIO.OpenColorIODisplayExtensionWrapper.CreateOpenColorIODisplayExtension
// 0x0100 (0x0100 - 0x0000)
struct OpenColorIODisplayExtensionWrapper_CreateOpenColorIODisplayExtension final
{
public:
	struct FOpenColorIODisplayConfiguration       InDisplayConfiguration;                            // 0x0000(0x00A0)(Parm, NativeAccessSpecifierPublic)
	struct FSceneViewExtensionIsActiveFunctor     IsActiveFunction;                                  // 0x00A0(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UOpenColorIODisplayExtensionWrapper*    ReturnValue;                                       // 0x00F0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function OpenColorIO.OpenColorIODisplayExtensionWrapper.SetOpenColorIOConfiguration
// 0x00A0 (0x00A0 - 0x0000)
struct OpenColorIODisplayExtensionWrapper_SetOpenColorIOConfiguration final
{
public:
	struct FOpenColorIODisplayConfiguration       InDisplayConfiguration;                            // 0x0000(0x00A0)(Parm, NativeAccessSpecifierPublic)
};

// Function OpenColorIO.OpenColorIODisplayExtensionWrapper.SetSceneExtensionIsActiveFunction
// 0x0050 (0x0050 - 0x0000)
struct OpenColorIODisplayExtensionWrapper_SetSceneExtensionIsActiveFunction final
{
public:
	struct FSceneViewExtensionIsActiveFunctor     IsActiveFunction;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OpenColorIO.OpenColorIODisplayExtensionWrapper.SetSceneExtensionIsActiveFunctions
// 0x0010 (0x0010 - 0x0000)
struct OpenColorIODisplayExtensionWrapper_SetSceneExtensionIsActiveFunctions final
{
public:
	TArray<struct FSceneViewExtensionIsActiveFunctor> IsActiveFunctions;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OpenColorIO.OpenColorIODisplayExtensionWrapper.GetOpenColorIOConfiguration
// 0x00A0 (0x00A0 - 0x0000)
struct OpenColorIODisplayExtensionWrapper_GetOpenColorIOConfiguration final
{
public:
	struct FOpenColorIODisplayConfiguration       ReturnValue;                                       // 0x0000(0x00A0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

}

