#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: OptionsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenu.OptionsMenu_C
// 0x0030 (0x10B0 - 0x1080)
class UOptionsMenu_C final : public UFortOptionsMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1080(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortHUDElementWrapper_C*               FortHUDElementWrapper;                             // 0x1088(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ContentLetoSplitscreen;                    // 0x1090(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_HeadingLeto;                               // 0x1098(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 TabGamepadConfig;                                  // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature(class FName TabID, class UCommonButtonBase* TabButton);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void DialogResult_826C59EC4C294BC872A644878B35A13B(EFortDialogResult Result, class FName ResultName);
	void DialogResult_B31FF5BD4C0772716F27509EA83B418E(EFortDialogResult Result, class FName ResultName);
	void ExecuteUbergraph_OptionsMenu(int32 EntryPoint);
	void Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE();
	void HandleTabGamePadActionsNeedBinds(TArray<class FText>& ScreenLabels);
	void HandleTabGamepadConfigActionHandlerStates();
	void LoadTabClasses();
	void On_Override_Reset_Modal(bool bOverride);
	void OnSettingsTabListPopulated();
	void OnShowResetToDefaultModal();
	void OnSplitscreenUpdateSizing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenu_C">();
	}
	static class UOptionsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenu_C>();
	}
};

}

