#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: OptimusCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ComputeFramework_structs.hpp"
#include "ComputeFramework_classes.hpp"
#include "OptimusCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OptimusCore.OptimusComponentBindingProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusComponentBindingProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComponentBindingProvider">();
	}
	static class IOptimusComponentBindingProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComponentBindingProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusComputeKernelDataInterface
// 0x0000 (0x0000 - 0x0000)
class IOptimusComputeKernelDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComputeKernelDataInterface">();
	}
	static class IOptimusComputeKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComputeKernelDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusComputeKernelProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusComputeKernelProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComputeKernelProvider">();
	}
	static class IOptimusComputeKernelProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComputeKernelProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusDataInterfaceProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusDataInterfaceProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDataInterfaceProvider">();
	}
	static class IOptimusDataInterfaceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDataInterfaceProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusDeformerInstanceAccessor
// 0x0000 (0x0000 - 0x0000)
class IOptimusDeformerInstanceAccessor final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDeformerInstanceAccessor">();
	}
	static class IOptimusDeformerInstanceAccessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDeformerInstanceAccessor>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusDeprecatedExecutionDataInterface
// 0x0000 (0x0000 - 0x0000)
class IOptimusDeprecatedExecutionDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDeprecatedExecutionDataInterface">();
	}
	static class IOptimusDeprecatedExecutionDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDeprecatedExecutionDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusExecutionDomainProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusExecutionDomainProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusExecutionDomainProvider">();
	}
	static class IOptimusExecutionDomainProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusExecutionDomainProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusGeneratedClassDefiner
// 0x0000 (0x0000 - 0x0000)
class IOptimusGeneratedClassDefiner final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGeneratedClassDefiner">();
	}
	static class IOptimusGeneratedClassDefiner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusGeneratedClassDefiner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusNodeAdderPinProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeAdderPinProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeAdderPinProvider">();
	}
	static class IOptimusNodeAdderPinProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeAdderPinProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusNodeFunctionLibraryOwner
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeFunctionLibraryOwner final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeFunctionLibraryOwner">();
	}
	static class IOptimusNodeFunctionLibraryOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeFunctionLibraryOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusNodeGraphCollectionOwner
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeGraphCollectionOwner final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeGraphCollectionOwner">();
	}
	static class IOptimusNodeGraphCollectionOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeGraphCollectionOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusNodePinRouter
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodePinRouter final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodePinRouter">();
	}
	static class IOptimusNodePinRouter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodePinRouter>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusParameterBindingProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusParameterBindingProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusParameterBindingProvider">();
	}
	static class IOptimusParameterBindingProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusParameterBindingProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusPathResolver
// 0x0000 (0x0000 - 0x0000)
class IOptimusPathResolver final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPathResolver">();
	}
	static class IOptimusPathResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPathResolver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusPersistentBufferProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusPersistentBufferProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPersistentBufferProvider">();
	}
	static class IOptimusPersistentBufferProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPersistentBufferProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusPinMutabilityDefiner
// 0x0000 (0x0000 - 0x0000)
class IOptimusPinMutabilityDefiner final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPinMutabilityDefiner">();
	}
	static class IOptimusPinMutabilityDefiner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPinMutabilityDefiner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusShaderTextProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusShaderTextProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusShaderTextProvider">();
	}
	static class IOptimusShaderTextProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusShaderTextProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusValueProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusValueProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusValueProvider">();
	}
	static class IOptimusValueProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusValueProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class OptimusCore.OptimusComputeDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusComputeDataInterface : public UComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComputeDataInterface">();
	}
	static class UOptimusComputeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusComputeDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataInterface
// 0x0008 (0x0030 - 0x0028)
class UOptimusSkinnedMeshVertexAttributeDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   AttributeName;                                     // 0x0028(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshVertexAttributeDataInterface">();
	}
	static class UOptimusSkinnedMeshVertexAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshVertexAttributeDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusSkinnedMeshVertexAttributeDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMeshComponent;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeName;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshVertexAttributeDataProvider">();
	}
	static class UOptimusSkinnedMeshVertexAttributeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshVertexAttributeDataProvider>();
	}
};

// Class OptimusCore.OptimusKernelSource
// 0x0010 (0x00A8 - 0x0098)
class UOptimusKernelSource final : public UComputeKernelSource
{
public:
	class FString                                 Source;                                            // 0x0098(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusKernelSource">();
	}
	static class UOptimusKernelSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusKernelSource>();
	}
};

// Class OptimusCore.OptimusComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusComponentSource : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComponentSource">();
	}
	static class UOptimusComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusComponentSource>();
	}
};

// Class OptimusCore.OptimusSceneComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusSceneComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSceneComponentSource">();
	}
	static class UOptimusSceneComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSceneComponentSource>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkinnedMeshComponentSource : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshComponentSource">();
	}
	static class UOptimusSkinnedMeshComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshComponentSource>();
	}
};

// Class OptimusCore.OptimusSkeletalMeshComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkeletalMeshComponentSource final : public UOptimusSkinnedMeshComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletalMeshComponentSource">();
	}
	static class UOptimusSkeletalMeshComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletalMeshComponentSource>();
	}
};

// Class OptimusCore.OptimusAnimAttributeDataInterface
// 0x0010 (0x0038 - 0x0028)
class UOptimusAnimAttributeDataInterface final : public UOptimusComputeDataInterface
{
public:
	struct FOptimusAnimAttributeArray             AttributeArray;                                    // 0x0028(0x0010)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusAnimAttributeDataInterface">();
	}
	static class UOptimusAnimAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAnimAttributeDataInterface>();
	}
};

// Class OptimusCore.OptimusAnimAttributeDataProvider
// 0x0020 (0x0048 - 0x0028)
class UOptimusAnimAttributeDataProvider final : public UComputeDataProvider
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusAnimAttributeDataProvider">();
	}
	static class UOptimusAnimAttributeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAnimAttributeDataProvider>();
	}
};

// Class OptimusCore.OptimusClothDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusClothDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusClothDataInterface">();
	}
	static class UOptimusClothDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusClothDataInterface>();
	}
};

// Class OptimusCore.OptimusClothDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusClothDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusClothDataProvider">();
	}
	static class UOptimusClothDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusClothDataProvider>();
	}
};

// Class OptimusCore.OptimusConnectivityDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusConnectivityDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusConnectivityDataInterface">();
	}
	static class UOptimusConnectivityDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusConnectivityDataInterface>();
	}
};

// Class OptimusCore.OptimusConnectivityDataProvider
// 0x0018 (0x0040 - 0x0028)
class UOptimusConnectivityDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusConnectivityDataProvider">();
	}
	static class UOptimusConnectivityDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusConnectivityDataProvider>();
	}
};

// Class OptimusCore.OptimusCustomComputeKernelDataInterface
// 0x0030 (0x0058 - 0x0028)
class UOptimusCustomComputeKernelDataInterface final : public UComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                     // 0x0030(0x0008)(BlueprintReadOnly, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NumThreadsExpression;                              // 0x0038(0x0010)(BlueprintReadOnly, ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusConstantIdentifier             ExecutionDomainConstantIdentifier;                 // 0x0048(0x000C)(BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusCustomComputeKernelDataInterface">();
	}
	static class UOptimusCustomComputeKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCustomComputeKernelDataInterface>();
	}
};

// Class OptimusCore.OptimusCustomComputeKernelDataProvider
// 0x0020 (0x0048 - 0x0028)
class UOptimusCustomComputeKernelDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusCustomComputeKernelDataProvider">();
	}
	static class UOptimusCustomComputeKernelDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCustomComputeKernelDataProvider>();
	}
};

// Class OptimusCore.OptimusDebugDrawDataInterface
// 0x0018 (0x0040 - 0x0028)
class UOptimusDebugDrawDataInterface final : public UOptimusComputeDataInterface
{
public:
	struct FOptimusDebugDrawParameters            DebugDrawParameters;                               // 0x0028(0x0014)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDebugDrawDataInterface">();
	}
	static class UOptimusDebugDrawDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDebugDrawDataInterface>();
	}
};

// Class OptimusCore.OptimusDebugDrawDataProvider
// 0x0020 (0x0048 - 0x0028)
class UOptimusDebugDrawDataProvider final : public UComputeDataProvider
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusDebugDrawParameters            DebugDrawParameters;                               // 0x0030(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDebugDrawDataProvider">();
	}
	static class UOptimusDebugDrawDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDebugDrawDataProvider>();
	}
};

// Class OptimusCore.OptimusDuplicateVerticesDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusDuplicateVerticesDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDuplicateVerticesDataInterface">();
	}
	static class UOptimusDuplicateVerticesDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDuplicateVerticesDataInterface>();
	}
};

// Class OptimusCore.OptimusDuplicateVerticesDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusDuplicateVerticesDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDuplicateVerticesDataProvider">();
	}
	static class UOptimusDuplicateVerticesDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDuplicateVerticesDataProvider>();
	}
};

// Class OptimusCore.OptimusGraphDataInterface
// 0x0018 (0x0040 - 0x0028)
class UOptimusGraphDataInterface final : public UComputeDataInterface
{
public:
	TArray<struct FOptimusGraphVariableDescription> Variables;                                       // 0x0028(0x0010)(BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         ParameterBufferSize;                               // 0x0038(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGraphDataInterface">();
	}
	static class UOptimusGraphDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGraphDataInterface>();
	}
};

// Class OptimusCore.OptimusGraphDataProvider
// 0x0030 (0x0058 - 0x0028)
class UOptimusGraphDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UMeshComponent*                         MeshComponent;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOptimusGraphVariableDescription> Variables;                                       // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGraphDataProvider">();
	}
	static class UOptimusGraphDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGraphDataProvider>();
	}
};

// Class OptimusCore.OptimusHalfEdgeDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusHalfEdgeDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusHalfEdgeDataInterface">();
	}
	static class UOptimusHalfEdgeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusHalfEdgeDataInterface>();
	}
};

// Class OptimusCore.OptimusHalfEdgeDataProvider
// 0x0020 (0x0048 - 0x0028)
class UOptimusHalfEdgeDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusHalfEdgeDataProvider">();
	}
	static class UOptimusHalfEdgeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusHalfEdgeDataProvider>();
	}
};

// Class OptimusCore.OptimusMorphTargetDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusMorphTargetDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusMorphTargetDataInterface">();
	}
	static class UOptimusMorphTargetDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusMorphTargetDataInterface>();
	}
};

// Class OptimusCore.OptimusMorphTargetDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusMorphTargetDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusMorphTargetDataProvider">();
	}
	static class UOptimusMorphTargetDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusMorphTargetDataProvider>();
	}
};

// Class OptimusCore.OptimusRawBufferDataInterface
// 0x0060 (0x0088 - 0x0028)
class UOptimusRawBufferDataInterface : public UOptimusComputeDataInterface
{
public:
	struct FShaderValueTypeHandle                 ValueType;                                         // 0x0028(0x0008)(BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusDataDomain                     DataDomain;                                        // 0x0030(0x0040)(BlueprintReadOnly, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                     // 0x0070(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusConstantIdentifier             DomainConstantIdentifier;                          // 0x0078(0x000C)(BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusRawBufferDataInterface">();
	}
	static class UOptimusRawBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusRawBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusTransientBufferDataInterface
// 0x0008 (0x0090 - 0x0088)
class UOptimusTransientBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	bool                                          bZeroInitForAtomicWrites;                          // 0x0088(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusTransientBufferDataInterface">();
	}
	static class UOptimusTransientBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusTransientBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusImplicitPersistentBufferDataInterface
// 0x0008 (0x0090 - 0x0088)
class UOptimusImplicitPersistentBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	bool                                          bZeroInitForAtomicWrites;                          // 0x0088(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusImplicitPersistentBufferDataInterface">();
	}
	static class UOptimusImplicitPersistentBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusImplicitPersistentBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusPersistentBufferDataInterface
// 0x0008 (0x0090 - 0x0088)
class UOptimusPersistentBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	class FName                                   ResourceName;                                      // 0x0088(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPersistentBufferDataInterface">();
	}
	static class UOptimusPersistentBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusPersistentBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusRawBufferDataProvider
// 0x0078 (0x00A0 - 0x0028)
class UOptimusRawBufferDataProvider : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x78];                                      // 0x0028(0x0078)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusRawBufferDataProvider">();
	}
	static class UOptimusRawBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusRawBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusTransientBufferDataProvider
// 0x0008 (0x00A8 - 0x00A0)
class UOptimusTransientBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusTransientBufferDataProvider">();
	}
	static class UOptimusTransientBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusTransientBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusImplicitPersistentBufferDataProvider
// 0x0020 (0x00C0 - 0x00A0)
class UOptimusImplicitPersistentBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusImplicitPersistentBufferDataProvider">();
	}
	static class UOptimusImplicitPersistentBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusImplicitPersistentBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusPersistentBufferDataProvider
// 0x0020 (0x00C0 - 0x00A0)
class UOptimusPersistentBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPersistentBufferDataProvider">();
	}
	static class UOptimusPersistentBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusPersistentBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusSceneDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusSceneDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSceneDataInterface">();
	}
	static class UOptimusSceneDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSceneDataInterface>();
	}
};

// Class OptimusCore.OptimusSceneDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusSceneDataProvider final : public UComputeDataProvider
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSceneDataProvider">();
	}
	static class UOptimusSceneDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSceneDataProvider>();
	}
};

// Class OptimusCore.OptimusSkeletonDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkeletonDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonDataInterface">();
	}
	static class UOptimusSkeletonDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonDataInterface>();
	}
};

// Class OptimusCore.OptimusSkeletonDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusSkeletonDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonDataProvider">();
	}
	static class UOptimusSkeletonDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonDataProvider>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkinnedMeshDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshDataInterface">();
	}
	static class UOptimusSkinnedMeshDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusSkinnedMeshDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshDataProvider">();
	}
	static class UOptimusSkinnedMeshDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshDataProvider>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshExecDataInterface
// 0x0010 (0x0038 - 0x0028)
class UOptimusSkinnedMeshExecDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	EOptimusSkinnedMeshExecDomain                 Domain;                                            // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshExecDataInterface">();
	}
	static class UOptimusSkinnedMeshExecDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshExecDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshExecDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusSkinnedMeshExecDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusSkinnedMeshExecDomain                 Domain;                                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshExecDataProvider">();
	}
	static class UOptimusSkinnedMeshExecDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshExecDataProvider>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshWriteDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkinnedMeshWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshWriteDataInterface">();
	}
	static class UOptimusSkinnedMeshWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshWriteDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshWriteDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusSkinnedMeshWriteDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshWriteDataProvider">();
	}
	static class UOptimusSkinnedMeshWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshWriteDataProvider>();
	}
};

// Class OptimusCore.OptimusNode
// 0x00E8 (0x0110 - 0x0028)
class UOptimusNode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   DisplayName;                                       // 0x0030(0x0018)(NonTransactional, NativeAccessSpecifierPrivate)
	struct FVector2D                              GraphPosition;                                     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UOptimusNodePin*>                Pins;                                              // 0x0058(0x0010)(ZeroConstructor, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSet<class FName>                             ExpandedPins;                                      // 0x0068(0x0050)(NonTransactional, NativeAccessSpecifierPrivate)
	EOptimusDiagnosticLevel                       DiagnosticLevel;                                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B9[0x57];                                      // 0x00B9(0x0057)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool SetGraphPosition(const struct FVector2D& InPosition);

	class FText GetDisplayName() const;
	struct FVector2D GetGraphPosition() const;
	class FName GetNodeCategory() const;
	class FName GetNodeName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode">();
	}
	static class UOptimusNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode>();
	}
};

// Class OptimusCore.OptimusNode_DataInterface
// 0x0020 (0x0130 - 0x0110)
class UOptimusNode_DataInterface : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UObject>                    DataInterfaceClass;                                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOptimusComputeDataInterface*           DataInterfaceData;                                 // 0x0128(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_DataInterface">();
	}
	static class UOptimusNode_DataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_DataInterface>();
	}
};

// Class OptimusCore.OptimusNode_AnimAttributeDataInterface
// 0x0000 (0x0130 - 0x0130)
class UOptimusNode_AnimAttributeDataInterface final : public UOptimusNode_DataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_AnimAttributeDataInterface">();
	}
	static class UOptimusNode_AnimAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_AnimAttributeDataInterface>();
	}
};

// Class OptimusCore.OptimusNode_ComponentSource
// 0x0010 (0x0120 - 0x0110)
class UOptimusNode_ComponentSource final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UOptimusComponentSourceBinding*         Binding;                                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComponentSource">();
	}
	static class UOptimusNode_ComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComponentSource>();
	}
};

// Class OptimusCore.OptimusNode_ComputeKernelBase
// 0x0008 (0x0118 - 0x0110)
class UOptimusNode_ComputeKernelBase : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComputeKernelBase">();
	}
	static class UOptimusNode_ComputeKernelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComputeKernelBase>();
	}
};

// Class OptimusCore.OptimusNode_ComputeKernelFunctionGeneratorClass
// 0x0060 (0x0260 - 0x0200)
class UOptimusNode_ComputeKernelFunctionGeneratorClass final : public UClass
{
public:
	class FName                                   category;                                          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KernelName;                                        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusExecutionDomain                ExecutionDomain;                                   // 0x0208(0x0018)(NativeAccessSpecifierPublic)
	struct FIntVector                             GroupSize;                                         // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FOptimusParameterBinding>       InputBindings;                                     // 0x0230(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOptimusParameterBinding>       OutputBindings;                                    // 0x0240(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ShaderSource;                                      // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComputeKernelFunctionGeneratorClass">();
	}
	static class UOptimusNode_ComputeKernelFunctionGeneratorClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComputeKernelFunctionGeneratorClass>();
	}
};

// Class OptimusCore.OptimusNode_ComputeKernelFunction
// 0x0000 (0x0118 - 0x0118)
class UOptimusNode_ComputeKernelFunction final : public UOptimusNode_ComputeKernelBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComputeKernelFunction">();
	}
	static class UOptimusNode_ComputeKernelFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComputeKernelFunction>();
	}
};

// Class OptimusCore.OptimusNode_ConstantValueGeneratorClass
// 0x0010 (0x0210 - 0x0200)
class UOptimusNode_ConstantValueGeneratorClass final : public UClass
{
public:
	struct FOptimusDataTypeRef                    DataType;                                          // 0x0200(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ConstantValueGeneratorClass">();
	}
	static class UOptimusNode_ConstantValueGeneratorClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ConstantValueGeneratorClass>();
	}
};

// Class OptimusCore.OptimusNode_ConstantValue
// 0x0018 (0x0128 - 0x0110)
class UOptimusNode_ConstantValue final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ConstantValue">();
	}
	static class UOptimusNode_ConstantValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ConstantValue>();
	}
};

// Class OptimusCore.OptimusNode_CustomComputeKernel
// 0x00E0 (0x01F8 - 0x0118)
class UOptimusNode_CustomComputeKernel final : public UOptimusNode_ComputeKernelBase
{
public:
	uint8                                         Pad_118[0x20];                                     // 0x0118(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   category;                                          // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusValidatedName                  KernelName;                                        // 0x013C(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FOptimusExecutionDomain                ExecutionDomain;                                   // 0x0140(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FIntVector                             GroupSize;                                         // 0x0158(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FOptimus_ShaderBinding>         Parameters;                                        // 0x0168(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	TArray<struct FOptimusParameterBinding>       InputBindings;                                     // 0x0178(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	TArray<struct FOptimusParameterBinding>       OutputBindings;                                    // 0x0188(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FOptimusParameterBindingArray          InputBindingArray;                                 // 0x0198(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FOptimusParameterBindingArray          OutputBindingArray;                                // 0x01A8(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FOptimusSecondaryInputBindingsGroup> SecondaryInputBindingGroups;                  // 0x01B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UComputeSource*>                 AdditionalSources;                                 // 0x01C8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FOptimusShaderText                     ShaderSource;                                      // 0x01D8(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_CustomComputeKernel">();
	}
	static class UOptimusNode_CustomComputeKernel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_CustomComputeKernel>();
	}
};

// Class OptimusCore.OptimusNode_FunctionReference
// 0x0010 (0x0120 - 0x0110)
class UOptimusNode_FunctionReference final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UOptimusFunctionNodeGraph*              FunctionGraph;                                     // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_FunctionReference">();
	}
	static class UOptimusNode_FunctionReference* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_FunctionReference>();
	}
};

// Class OptimusCore.OptimusNode_ResourceAccessorBase
// 0x0078 (0x0188 - 0x0110)
class UOptimusNode_ResourceAccessorBase : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class UOptimusResourceDescription> ResourceDesc;                                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EOptimusBufferWriteType                       WriteType;                                         // 0x0130(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FOptimusNode_ResourceAccessorBase_DuplicationInfo DuplicationInfo;                        // 0x0138(0x0050)(DuplicateTransient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ResourceAccessorBase">();
	}
	static class UOptimusNode_ResourceAccessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ResourceAccessorBase>();
	}
};

// Class OptimusCore.OptimusNode_GetResource
// 0x0000 (0x0188 - 0x0188)
class UOptimusNode_GetResource final : public UOptimusNode_ResourceAccessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_GetResource">();
	}
	static class UOptimusNode_GetResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_GetResource>();
	}
};

// Class OptimusCore.OptimusNode_GetVariable
// 0x0038 (0x0148 - 0x0110)
class UOptimusNode_GetVariable final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class UOptimusVariableDescription> VariableDesc;                                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FOptimusNode_GetVariable_DuplicationInfo DuplicationInfo;                                 // 0x0128(0x0020)(DuplicateTransient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_GetVariable">();
	}
	static class UOptimusNode_GetVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_GetVariable>();
	}
};

// Class OptimusCore.OptimusNode_GraphTerminal
// 0x0018 (0x0128 - 0x0110)
class UOptimusNode_GraphTerminal final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	EOptimusTerminalType                          TerminalType;                                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UOptimusNodeSubGraph>    OwningGraph;                                       // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_GraphTerminal">();
	}
	static class UOptimusNode_GraphTerminal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_GraphTerminal>();
	}
};

// Class OptimusCore.OptimusNode_Resource
// 0x0000 (0x0188 - 0x0188)
class UOptimusNode_Resource final : public UOptimusNode_ResourceAccessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_Resource">();
	}
	static class UOptimusNode_Resource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_Resource>();
	}
};

// Class OptimusCore.OptimusNode_SetResource
// 0x0000 (0x0188 - 0x0188)
class UOptimusNode_SetResource final : public UOptimusNode_ResourceAccessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_SetResource">();
	}
	static class UOptimusNode_SetResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_SetResource>();
	}
};

// Class OptimusCore.OptimusNode_SubGraphReference
// 0x0010 (0x0120 - 0x0110)
class UOptimusNode_SubGraphReference final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UOptimusNodeSubGraph*                   SubGraph;                                          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_SubGraphReference">();
	}
	static class UOptimusNode_SubGraphReference* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_SubGraphReference>();
	}
};

// Class OptimusCore.OptimusActionStack
// 0x00B8 (0x00E0 - 0x0028)
class UOptimusActionStack final : public UObject
{
public:
	int32                                         TransactedActionIndex;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0xB4];                                      // 0x002C(0x00B4)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusActionStack">();
	}
	static class UOptimusActionStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusActionStack>();
	}
};

// Class OptimusCore.OptimusComponentSourceBinding
// 0x0028 (0x0050 - 0x0028)
class UOptimusComponentSourceBinding final : public UObject
{
public:
	class FName                                   BindingName;                                       // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
