#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PCG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PCG_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Class PCG.PCGData
// 0x0010 (0x0038 - 0x0028)
class UPCGData : public UObject
{
public:
	uint64                                        UID;                                               // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGData">();
	}
	static class UPCGData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGData>();
	}
};

// Class PCG.PCGSettingsInterface
// 0x0008 (0x0040 - 0x0038)
class UPCGSettingsInterface : public UPCGData
{
public:
	bool                                          bEnabled;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSettingsInterface">();
	}
	static class UPCGSettingsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettingsInterface>();
	}
};

// Class PCG.PCGSettings
// 0x0110 (0x0150 - 0x0040)
class UPCGSettings : public UPCGSettingsInterface
{
public:
	int32                                         Seed;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSet<class FString>                           FilterOnTags;                                      // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bPassThroughFilteredOutInputs;                     // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSet<class FString>                           TagsAppliedOnOutput;                               // 0x00A0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bUseSeed;                                          // 0x00F8(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F9[0x3F];                                      // 0x00F9(0x003F)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPCGSettingsOverridableParam>   CachedOverridableParams;                           // 0x0138(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSettings">();
	}
	static class UPCGSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettings>();
	}
};

// Class PCG.PCGAddTagSettings
// 0x0010 (0x0160 - 0x0150)
class UPCGAddTagSettings final : public UPCGSettings
{
public:
	class FString                                 TagsToAdd;                                         // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAddTagSettings">();
	}
	static class UPCGAddTagSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddTagSettings>();
	}
};

// Class PCG.PCGPropertyToParamDataSettings
// 0x0058 (0x01A8 - 0x0150)
class UPCGPropertyToParamDataSettings final : public UPCGSettings
{
public:
	struct FPCGActorSelectorSettings              ActorSelector;                                     // 0x0150(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSelectComponent;                                  // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractObjectAndStruct;                           // 0x0184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   OutputAttributeName;                               // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysRequeryActors;                              // 0x018C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGActorSelection                            ActorSelection;                                    // 0x018D(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   ActorSelectionTag;                                 // 0x0190(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ActorSelectionName;                                // 0x0194(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class AActor>                     ActorSelectionClass;                               // 0x0198(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPCGActorFilter                               ActorFilter;                                       // 0x01A0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIncludeChildren;                                  // 0x01A1(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGPropertyToParamDataSettings">();
	}
	static class UPCGPropertyToParamDataSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGPropertyToParamDataSettings>();
	}
};

// Class PCG.PCGAttributeExtractorTestObject
// 0x0008 (0x0030 - 0x0028)
class UPCGAttributeExtractorTestObject final : public UObject
{
public:
	double                                        DoubleValue;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeExtractorTestObject">();
	}
	static class UPCGAttributeExtractorTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeExtractorTestObject>();
	}
};

// Class PCG.PCGAttributePropertySelectorBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGAttributePropertySelectorBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FPCGAttributePropertyInputSelector CopyAndFixLast(const struct FPCGAttributePropertyInputSelector& Selector, const class UPCGData* InData);
	static struct FPCGAttributePropertyOutputSelector CopyAndFixSource(const struct FPCGAttributePropertyOutputSelector& Selector, const struct FPCGAttributePropertyInputSelector& InSelector);
	static class FName GetAttributeName(const struct FPCGAttributePropertySelector& Selector);
	static const TArray<class FString> GetExtraNames(const struct FPCGAttributePropertySelector& Selector);
	static EPCGExtraProperties GetExtraProperty(const struct FPCGAttributePropertySelector& Selector);
	static class FName GetName(const struct FPCGAttributePropertySelector& Selector);
	static EPCGPointProperties GetPointProperty(const struct FPCGAttributePropertySelector& Selector);
	static EPCGAttributePropertySelection GetSelection(const struct FPCGAttributePropertySelector& Selector);
	static bool SetAttributeName(struct FPCGAttributePropertySelector& Selector, class FName InAttributeName);
	static bool SetExtraProperty(struct FPCGAttributePropertySelector& Selector, EPCGExtraProperties InExtraProperty);
	static bool SetPointProperty(struct FPCGAttributePropertySelector& Selector, EPCGPointProperties InPointProperty);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributePropertySelectorBlueprintHelpers">();
	}
	static class UPCGAttributePropertySelectorBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributePropertySelectorBlueprintHelpers>();
	}
};

// Class PCG.PCGComponent
// 0x0160 (0x0200 - 0x00A0)
class UPCGComponent final : public UActorComponent
{
public:
	EPCGComponentInput                            InputType;                                         // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParseActorComponents;                             // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Seed;                                              // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivated;                                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsComponentPartitioned;                           // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGComponentGenerationTrigger                GenerationTrigger;                                 // 0x00AA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerated;                                        // 0x00AB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRuntimeGenerated;                                 // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FName>                           PostGenerateFunctionNames;                         // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UPCGGraphInstance*                      GraphInstance;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        GenerationGridSize;                                // 0x00C8(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UPCGData*                               CachedPCGData;                                     // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedInputData;                                   // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedActorData;                                   // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedLandscapeData;                               // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedLandscapeHeightData;                         // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPCGManagedResource*>            GeneratedResources;                                // 0x00F8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FBox                                   LastGeneratedBounds;                               // 0x0110(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FPCGDataCollection                     GeneratedGraphOutput;                              // 0x0148(0x0020)(NativeAccessSpecifierPrivate)
	TMap<class FString, struct FPCGDataCollection> PerPinGeneratedOutput;                            // 0x0168(0x0050)(Edit, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8[0x18];                                     // 0x01B8(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsComponentLocal;                                 // 0x01D0(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D1[0x2F];                                     // 0x01D1(0x002F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddToManagedResources(class UPCGManagedResource* InResource);
	void Cleanup(bool bRemoveComponents, bool bSave);
	void CleanupLocal(bool bRemoveComponents, bool bSave);
	class AActor* ClearPCGLink(class UClass* TemplateActor);
	void Generate(bool bForce);
	void GenerateLocal(bool bForce);
	void NotifyPropertiesChangedFromBlueprint();
	void SetGraph(class UPCGGraphInterface* InGraph);

	const struct FPCGDataCollection GetGeneratedGraphOutput() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGComponent">();
	}
	static class UPCGComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGComponent>();
	}
};

// Class PCG.PCGBooleanSelectSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGBooleanSelectSettings final : public UPCGSettings
{
public:
	bool                                          bUseInputB;                                        // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBooleanSelectSettings">();
	}
	static class UPCGBooleanSelectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBooleanSelectSettings>();
	}
};

// Class PCG.PCGBranchSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGBranchSettings final : public UPCGSettings
{
public:
	bool                                          bOutputToB;                                        // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBranchSettings">();
	}
	static class UPCGBranchSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBranchSettings>();
	}
};

// Class PCG.PCGTransformPointsSettings
// 0x00B0 (0x0200 - 0x0150)
class UPCGTransformPointsSettings final : public UPCGSettings
{
public:
	bool                                          bApplyToAttribute;                                 // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   AttributeName;                                     // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetMin;                                         // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetMax;                                         // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteOffset;                                   // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRotator                               RotationMin;                                       // 0x0190(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RotationMax;                                       // 0x01A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteRotation;                                 // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ScaleMin;                                          // 0x01C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ScaleMax;                                          // 0x01E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteScale;                                    // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUniformScale;                                     // 0x01F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecomputeSeed;                                    // 0x01FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGTransformPointsSettings">();
	}
	static class UPCGTransformPointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGTransformPointsSettings>();
	}
};

// Class PCG.PCGSpatialData
// 0x0040 (0x0078 - 0x0038)
class UPCGSpatialData : public UPCGData
{
public:
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGMetadata*                           MetaData;                                          // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCachedLastSelector;                            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPCGAttributePropertyInputSelector     CachedLastSelector;                                // 0x0050(0x0028)(NativeAccessSpecifierPrivate)

public:
	class UPCGMetadata* CreateEmptyMetadata();
	void InitializeFromData(const class UPCGSpatialData* InSource, const class UPCGMetadata* InMetadataParentOverride, bool bInheritMetadata, bool bInheritAttributes);
	class UPCGMetadata* MutableMetadata();

	const class UPCGMetadata* ConstMetadata() const;
	struct FBox GetBounds() const;
	float GetDensityAtPosition(const struct FVector& InPosition) const;
	int32 GetDimension() const;
	struct FVector GetNormal() const;
	struct FBox GetStrictBounds() const;
	bool HasNonTrivialTransform() const;
	class UPCGIntersectionData* IntersectWith(const class UPCGSpatialData* InOther) const;
	class UPCGSpatialData* ProjectOn(const class UPCGSpatialData* InOther, const struct FPCGProjectionParams& InParams) const;
	bool ProjectPoint(const struct FTransform& InTransform, const struct FBox& InBounds, const struct FPCGProjectionParams& InParams, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	bool SamplePoint(const struct FTransform& Transform, const struct FBox& Bounds, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	class UPCGDifferenceData* Subtract(const class UPCGSpatialData* InOther) const;
	const class UPCGPointData* ToPointData() const;
	const class UPCGPointData* ToPointDataWithContext(struct FPCGContext& Context) const;
	class UPCGUnionData* UnionWith(const class UPCGSpatialData* InOther) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSpatialData">();
	}
	static class UPCGSpatialData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialData>();
	}
};

// Class PCG.PCGSpatialDataWithPointCache
// 0x0050 (0x00C8 - 0x0078)
class UPCGSpatialDataWithPointCache : public UPCGSpatialData
{
public:
	class UPCGPointData*                          CachedPointData;                                   // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBox>                           CachedBoundedPointDataBoxes;                       // 0x0080(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UPCGPointData*>                  CachedBoundedPointData;                            // 0x0090(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSpatialDataWithPointCache">();
	}
	static class UPCGSpatialDataWithPointCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialDataWithPointCache>();
	}
};

// Class PCG.PCGCollisionShapeData
// 0x00F8 (0x01C0 - 0x00C8)
class UPCGCollisionShapeData final : public UPCGSpatialDataWithPointCache
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x00D0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x18];                                     // 0x0130(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	struct FBox                                   CachedBounds;                                      // 0x0148(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   CachedStrictBounds;                                // 0x0180(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCollisionShapeData">();
	}
	static class UPCGCollisionShapeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCollisionShapeData>();
	}
};

// Class PCG.PCGCreatePointsSettings
// 0x0018 (0x0168 - 0x0150)
class UPCGCreatePointsSettings final : public UPCGSettings
{
public:
	TArray<struct FPCGPoint>                      PointsToCreate;                                    // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bLocal;                                            // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCullPointsOutsideVolume;                          // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCreatePointsSettings">();
	}
	static class UPCGCreatePointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreatePointsSettings>();
	}
};

// Class PCG.PCGSplineSamplerSettings
// 0x00C8 (0x0218 - 0x0150)
class UPCGSplineSamplerSettings final : public UPCGSettings
{
public:
	struct FPCGSplineSamplerParams                SamplerParams;                                     // 0x0150(0x00C8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSplineSamplerSettings">();
	}
	static class UPCGSplineSamplerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSplineSamplerSettings>();
	}
};

// Class PCG.PCGCullPointsOutsideActorBoundsSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGCullPointsOutsideActorBoundsSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCullPointsOutsideActorBoundsSettings">();
	}
	static class UPCGCullPointsOutsideActorBoundsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCullPointsOutsideActorBoundsSettings>();
	}
};

// Class PCG.PCGExternalDataSettings
// 0x0050 (0x01A0 - 0x0150)
class UPCGExternalDataSettings : public UPCGSettings
{
public:
	TMap<class FString, struct FPCGAttributePropertyInputSelector> AttributeMapping;                 // 0x0150(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGExternalDataSettings">();
	}
	static class UPCGExternalDataSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGExternalDataSettings>();
	}
};

// Class PCG.PCGDifferenceSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGDifferenceSettings final : public UPCGSettings
{
public:
	EPCGDifferenceDensityFunction                 DensityFunction;                                   // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGDifferenceMode                            Mode;                                              // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDiffMetadata;                                     // 0x0152(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGDifferenceSettings">();
	}
	static class UPCGDifferenceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDifferenceSettings>();
	}
};

// Class PCG.PCGLoadDataTableSettings
// 0x0028 (0x01C8 - 0x01A0)
class UPCGLoadDataTableSettings final : public UPCGExternalDataSettings
{
public:
	TSoftObjectPtr<class UDataTable>              DataTable;                                         // 0x01A0(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGExclusiveDataType                         OutputType;                                        // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGLoadDataTableSettings">();
	}
	static class UPCGLoadDataTableSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGLoadDataTableSettings>();
	}
};

// Class PCG.PCGDistanceSettings
// 0x0018 (0x0168 - 0x0150)
class UPCGDistanceSettings final : public UPCGSettings
{
public:
	class FName                                   AttributeName;                                     // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputDistanceVector;                             // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetDensity;                                       // 0x0155(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        MaximumDistance;                                   // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGDistanceShape                             SourceShape;                                       // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGDistanceShape                             TargetShape;                                       // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGDistanceSettings">();
	}
	static class UPCGDistanceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDistanceSettings>();
	}
};

// Class PCG.PCGWorldRayHitSettings
// 0x00B8 (0x0208 - 0x0150)
class UPCGWorldRayHitSettings final : public UPCGSettings
{
public:
	struct FPCGWorldRayHitQueryParams             QueryParams;                                       // 0x0150(0x00B8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGWorldRayHitSettings">();
	}
	static class UPCGWorldRayHitSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGWorldRayHitSettings>();
	}
};

// Class PCG.PCGBadOutputsNodeSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGBadOutputsNodeSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBadOutputsNodeSettings">();
	}
	static class UPCGBadOutputsNodeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBadOutputsNodeSettings>();
	}
};

// Class PCG.PCGEngineSettings
// 0x0020 (0x0048 - 0x0028)
class UPCGEngineSettings final : public UObject
{
public:
	struct FVector                                VolumeScale;                                       // 0x0028(0x0018)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateOnDrop;                                   // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGEngineSettings">();
	}
	static class UPCGEngineSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGEngineSettings>();
	}
};

// Class PCG.PCGGatherSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGGatherSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGGatherSettings">();
	}
	static class UPCGGatherSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGatherSettings>();
	}
};

// Class PCG.PCGGetBoundsSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGGetBoundsSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGGetBoundsSettings">();
	}
	static class UPCGGetBoundsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGetBoundsSettings>();
	}
};

// Class PCG.PCGGraphAuthoringTestHelperSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGGraphAuthoringTestHelperSettings final : public UPCGSettings
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGGraphAuthoringTestHelperSettings">();
	}
	static class UPCGGraphAuthoringTestHelperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGraphAuthoringTestHelperSettings>();
	}
};

// Class PCG.PCGGraphParametersHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGGraphParametersHelpers final : public UBlueprintFunctionLibrary
{
public:
	static bool GetBoolParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static uint8 GetByteParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static double GetDoubleParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static uint8 GetEnumParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static float GetFloatParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static int32 GetInt32Parameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static int64 GetInt64Parameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static class FName GetNameParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static struct FQuat GetQuaternionParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static struct FRotator GetRotatorParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static TSoftClassPtr<class UClass> GetSoftClassParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static TSoftObjectPtr<class UObject> GetSoftObjectParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static struct FSoftObjectPath GetSoftObjectPathParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static class FString GetStringParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static struct FTransform GetTransformParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static struct FVector2D GetVector2DParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static struct FVector4 GetVector4Parameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static struct FVector GetVectorParameter(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static bool IsOverridden(const class UPCGGraphInterface* GraphInterface, const class FName Name_0);
	static void SetBoolParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const bool bValue);
	static void SetByteParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const uint8 Value);
	static void SetDoubleParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const double Value);
	static void SetEnumParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const uint8 Value, const class UEnum* Enum);
	static void SetFloatParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const float Value);
	static void SetInt32Parameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const int32 Value);
	static void SetInt64Parameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const int64 Value);
	static void SetNameParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const class FName Value);
	static void SetQuaternionParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const struct FQuat& Value);
	static void SetRotatorParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const struct FRotator& Value);
	static void SetSoftClassParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const TSoftClassPtr<class UClass>& Value);
	static void SetSoftObjectParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const TSoftObjectPtr<class UObject>& Value);
	static void SetSoftObjectPathParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const struct FSoftObjectPath& Value);
	static void SetStringParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const class FString& Value);
	static void SetTransformParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const struct FTransform& Value);
	static void SetVector2DParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const struct FVector2D& Value);
	static void SetVector4Parameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const struct FVector4& Value);
	static void SetVectorParameter(class UPCGGraphInterface* GraphInterface, const class FName Name_0, const struct FVector& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGGraphParametersHelpers">();
	}
	static class UPCGGraphParametersHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGraphParametersHelpers>();
	}
};

// Class PCG.PCGBaseSubgraphSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGBaseSubgraphSettings : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBaseSubgraphSettings">();
	}
	static class UPCGBaseSubgraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBaseSubgraphSettings>();
	}
};

// Class PCG.PCGSubgraphSettings
// 0x0010 (0x0160 - 0x0150)
class UPCGSubgraphSettings : public UPCGBaseSubgraphSettings
{
public:
	class UPCGGraphInstance*                      SubgraphInstance;                                  // 0x0150(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGGraphInterface*                     SubgraphOverride;                                  // 0x0158(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSubgraphSettings">();
	}
	static class UPCGSubgraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSubgraphSettings>();
	}
};

// Class PCG.PCGHiGenGridSizeSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGHiGenGridSizeSettings final : public UPCGSettings
{
public:
	EPCGHiGenGrid                                 HiGenGridSize;                                     // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGHiGenGridSizeSettings">();
	}
	static class UPCGHiGenGridSizeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGHiGenGridSizeSettings>();
	}
};

// Class PCG.PCGMakeConcreteSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGMakeConcreteSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMakeConcreteSettings">();
	}
	static class UPCGMakeConcreteSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMakeConcreteSettings>();
	}
};

// Class PCG.PCGMatchAndSetBase
// 0x0008 (0x0030 - 0x0028)
class UPCGMatchAndSetBase : public UObject
{
public:
	EPCGMetadataTypes                             Type;                                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	EPCGMetadataTypesConstantStructStringMode     StringMode;                                        // 0x002C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void MatchAndSet(struct FPCGContext& Context, const class UPCGPointMatchAndSetSettings* InSettings, const class UPCGPointData* InPointData, class UPCGPointData* OutPointData) const;
	bool ValidatePreconditions(const class UPCGPointData* InPointData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMatchAndSetBase">();
	}
	static class UPCGMatchAndSetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMatchAndSetBase>();
	}
};

// Class PCG.PCGMergeAttributesSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGMergeAttributesSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMergeAttributesSettings">();
	}
	static class UPCGMergeAttributesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMergeAttributesSettings>();
	}
};

// Class PCG.PCGMetadataSettingsBase
// 0x0030 (0x0180 - 0x0150)
class UPCGMetadataSettingsBase : public UPCGSettings
{
public:
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x0150(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   OutputDataFromPin;                                 // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	TArray<class FName> GetOutputDataFromPinOptions() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMetadataSettingsBase">();
	}
	static class UPCGMetadataSettingsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMetadataSettingsBase>();
	}
};

// Class PCG.PCGVolumeSamplerSettings
// 0x0020 (0x0170 - 0x0150)
class UPCGVolumeSamplerSettings final : public UPCGSettings
{
public:
	struct FVector                                VoxelSize;                                         // 0x0150(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnbounded;                                        // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         PointSteepness;                                    // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGVolumeSamplerSettings">();
	}
	static class UPCGVolumeSamplerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGVolumeSamplerSettings>();
	}
};

// Class PCG.PCGMetadataMakeRotatorSettings
// 0x0080 (0x0200 - 0x0180)
class UPCGMetadataMakeRotatorSettings final : public UPCGMetadataSettingsBase
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource1;                                      // 0x0180(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     InputSource2;                                      // 0x01A8(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     InputSource3;                                      // 0x01D0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EPCGMetadataMakeRotatorOp                     Operation;                                         // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMetadataMakeRotatorSettings">();
	}
	static class UPCGMetadataMakeRotatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMetadataMakeRotatorSettings>();
	}
};

// Class PCG.PCGMutateSeedSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGMutateSeedSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMutateSeedSettings">();
	}
	static class UPCGMutateSeedSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMutateSeedSettings>();
	}
};

// Class PCG.PCGNormalToDensitySettings
// 0x0030 (0x0180 - 0x0150)
class UPCGNormalToDensitySettings final : public UPCGSettings
{
public:
	struct FVector                                Normal;                                            // 0x0150(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Offset;                                            // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Strength;                                          // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGNormalToDensityMode                       DensityMode;                                       // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGNormalToDensitySettings">();
	}
	static class UPCGNormalToDensitySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGNormalToDensitySettings>();
	}
};

// Class PCG.PCGNumberOfElementsBaseSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGNumberOfElementsBaseSettings : public UPCGSettings
{
public:
	class FName                                   OutputAttributeName;                               // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGNumberOfElementsBaseSettings">();
	}
	static class UPCGNumberOfElementsBaseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGNumberOfElementsBaseSettings>();
	}
};

// Class PCG.PCGNumberOfPointsSettings
// 0x0000 (0x0158 - 0x0158)
class UPCGNumberOfPointsSettings final : public UPCGNumberOfElementsBaseSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGNumberOfPointsSettings">();
	}
	static class UPCGNumberOfPointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGNumberOfPointsSettings>();
	}
};

// Class PCG.PCGNumberOfEntriesSettings
// 0x0000 (0x0158 - 0x0158)
class UPCGNumberOfEntriesSettings final : public UPCGNumberOfElementsBaseSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGNumberOfEntriesSettings">();
	}
	static class UPCGNumberOfEntriesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGNumberOfEntriesSettings>();
	}
};

// Class PCG.PCGSettingsWithDynamicInputs
// 0x0010 (0x0160 - 0x0150)
class UPCGSettingsWithDynamicInputs : public UPCGSettings
{
public:
	TArray<struct FPCGPinProperties>              DynamicInputPinProperties;                         // 0x0150(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSettingsWithDynamicInputs">();
	}
	static class UPCGSettingsWithDynamicInputs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettingsWithDynamicInputs>();
	}
};

// Class PCG.PCGOuterIntersectionSettings
// 0x0008 (0x0168 - 0x0160)
class UPCGOuterIntersectionSettings final : public UPCGSettingsWithDynamicInputs
{
public:
	EPCGIntersectionDensityFunction               DensityFunction;                                   // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnorePinsWithNoInput;                            // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGOuterIntersectionSettings">();
	}
	static class UPCGOuterIntersectionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGOuterIntersectionSettings>();
	}
};

// Class PCG.PCGRerouteSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGRerouteSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGRerouteSettings">();
	}
	static class UPCGRerouteSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGRerouteSettings>();
	}
};

// Class PCG.PCGSanityCheckPointDataSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGSanityCheckPointDataSettings final : public UPCGSettings
{
public:
	int32                                         MinPointCount;                                     // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPointCount;                                     // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSanityCheckPointDataSettings">();
	}
	static class UPCGSanityCheckPointDataSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSanityCheckPointDataSettings>();
	}
};

// Class PCG.PCGSortPointsSettings
// 0x0030 (0x0180 - 0x0150)
class UPCGSortPointsSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0150(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EPCGSortMethod                                SortMethod;                                        // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSortPointsSettings">();
	}
	static class UPCGSortPointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSortPointsSettings>();
	}
};

// Class PCG.PCGUserParameterGetSettings
// 0x0018 (0x0168 - 0x0150)
class UPCGUserParameterGetSettings final : public UPCGSettings
{
public:
	struct FGuid                                  PropertyGuid;                                      // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGUserParameterGetSettings">();
	}
	static class UPCGUserParameterGetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGUserParameterGetSettings>();
	}
};

// Class PCG.PCGUserParametersData
// 0x0018 (0x0050 - 0x0038)
class UPCGUserParametersData final : public UPCGData
{
public:
	class UPCGGraphInterface*                     OriginalGraph;                                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
