#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PictureInPictureCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PictureInPictureCore_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "PictureInPictureDescriptors_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PictureInPictureCore.PictureInPictureClient
// 0x0080 (0x00A8 - 0x0028)
class UPictureInPictureClient : public UObject
{
public:
	TMulticastInlineDelegate<void()>              LoginSuccessEvent;                                 // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              LogoutSuccessEvent;                                // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTexture2DDynamic* QRCodeTexture)> QRCodeReceivedEvent;      // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ErrorName, const class FString& ErrorMessage)> ErrorDelegate; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 UserName;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEpicCMSImage*                          UserAvatarImage;                                   // 0x0080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2DDynamic*                      CurrentQRCodeTexture;                              // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BeginLogin(class UObject* InWorldContext);
	void CheckLogin(class UObject* InWorldContext);
	void EndLogin(class UObject* InWorldContext);
	class UEpicCMSImage* GetAvatarImage();
	const EPictureInPictureAuthState GetLoginState();
	class UTexture2DDynamic* GetQRCodeTexture();
	bool IsLoggedIn();
	void Logout();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureClient">();
	}
	static class UPictureInPictureClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureClient>();
	}
};

// Class PictureInPictureCore.PictureInPictureCheatManager
// 0x0000 (0x0028 - 0x0028)
class UPictureInPictureCheatManager final : public UChildCheatManager
{
public:
	void CanEnablePartnerPIP();
	void DisablePiP();
	void EnablePiP();
	void PrintPiPRegionInfo();
	void ResumePiP();
	void SuspendPiP();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureCheatManager">();
	}
	static class UPictureInPictureCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureCheatManager>();
	}
};

// Class PictureInPictureCore.PictureInPictureCoreEnableDisableAction
// 0x0000 (0x0028 - 0x0028)
class UPictureInPictureCoreEnableDisableAction final : public UFortUIGameFeatureAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureCoreEnableDisableAction">();
	}
	static class UPictureInPictureCoreEnableDisableAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureCoreEnableDisableAction>();
	}
};

// Class PictureInPictureCore.PictureInPictureMediaController
// 0x06B0 (0x06D8 - 0x0028)
class UPictureInPictureMediaController : public UObject
{
public:
	class FString                                 PartnerName;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UPictureInPictureActionData*>    ActionDataArray;                                   // 0x0048(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FPIPVideoPlayerAssetConfig             DefaultPlayerAssetConfig;                          // 0x0058(0x0088)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FPIPVideoPlayerAssetConfig             PlayerAssetConfig;                                 // 0x00E0(0x0088)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UPictureInPicturePlayer*                VideoWidget;                                       // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPIPVideoPlayerConfig                  VideoWidgetConfig;                                 // 0x0170(0x0048)(Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UCommonLazyImage>        ThumbnailImageNext;                                // 0x01B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UCommonLazyImage>        ThumbnailImagePrevious;                            // 0x01C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsMultipleSources;                          // 0x01C8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPiPPartnerSource                      CurrentSource;                                     // 0x01D0(0x01E8)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPiPPartnerSource>              Sources;                                           // 0x03B8(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPiPPartnerSource>              ValidSources;                                      // 0x03C8(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMediaPlayerOptions                    LocalOptions;                                      // 0x03D8(0x0030)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 ErrorType, const class FString& ErrorMessage)> BaseErrorEvent; // 0x0408(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool IsEnabled)> BaseEnabledEvent;                                 // 0x0418(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const TArray<struct FPiPPartnerSource>& Sources)> SourcesChangedEvent; // 0x0428(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const struct FPiPPartnerSource& Source)> SourceSelectedEvent;      // 0x0438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPictureInPictureActionConfig>  InstanceActionData;                                // 0x0450(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UPictureInPictureAnalyticsManager*      AnalyticsManager;                                  // 0x0460(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              ActiveStartTime;                                   // 0x0468(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              PausedStartTime;                                   // 0x0470(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPiPSuspendInfo                        SuspendedInfo;                                     // 0x0480(0x01F0)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_670[0x68];                                     // 0x0670(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void Exit(bool bStop);
	const TArray<class UPictureInPictureActionData*> GetActions();
	struct FPiPPartnerSource GetCurrentSource();
	TArray<struct FPiPPartnerSource> GetSources();
	TArray<struct FPiPPartnerSource> GetValidSources();
	void HandleSourceSelectedEvent(const class FString& SelectedSource);
	bool IsMultiSourceSupported();
	bool IsPaused();
	bool IsPlaying();
	void OnMediaClosedAnalytics();
	void OnMediaPausedAnalytics();
	void OnMediaResumedAnalytics();
	void OnMediaStartedAnalytics();
	void OnNextThumbnailReceived(class UTexture2DDynamic* InTexture);
	void OnPrevThumbnailReceived(class UTexture2DDynamic* InTexture);
	void Pause();
	void Play(bool bForcePlay);
	void SetCurrentSource(const struct FPiPPartnerSource& SelectedSource);
	void SetEnabled(bool bIsEnabled, bool bIsFromUser);
	void Stop();
	void ToggleFullScreen();

	const struct FPIPVideoPlayerAssetConfig GetDefaultPlayerAssetConfig() const;
	class UPictureInPicturePlayer* GetMediaPlayerWidget() const;
	const struct FPIPVideoPlayerAssetConfig GetPlayerAssetConfig() const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureMediaController">();
	}
	static class UPictureInPictureMediaController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureMediaController>();
	}
};

// Class PictureInPictureCore.PictureInPictureMediaPlayerCtrl
// 0x0010 (0x0118 - 0x0108)
class UPictureInPictureMediaPlayerCtrl final : public UFortMediaPlayerCtrl
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureMediaPlayerCtrl">();
	}
	static class UPictureInPictureMediaPlayerCtrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureMediaPlayerCtrl>();
	}
};

// Class PictureInPictureCore.PictureInPicturePlayer
// 0x0208 (0x0230 - 0x0028)
class UPictureInPicturePlayer final : public UObject
{
public:
	uint8                                         Pad_28[0xE0];                                      // 0x0028(0x00E0)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPIPVideoPlayerAssetConfig             AssetConfig;                                       // 0x0108(0x0088)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UPictureInPictureMediaPlayerCtrl*       MediaController;                                   // 0x0190(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x50];                                     // 0x0198(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundSubmixBase*                       DefaultSubmix;                                     // 0x01E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundSubmixBase*                       LicensedSubmix;                                    // 0x01F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F8[0x38];                                     // 0x01F8(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void FlushPlayerAssetConfig();
	void HandleUCPAudioChanged(class UFortClientSettingsRecord* Settings);
	bool IsAssetConfigSet();
	bool SetPlayerAssetConfig(struct FPIPVideoPlayerAssetConfig& InAssetConfig);
	void StreamedVideoOnUrlFailure(const class FString& URL);
	void StreamedVideoOnUrlSuccess(const class FString& URL);
	void UpdateStreamingPlayerSize(const struct FVector2D& InVector);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPicturePlayer">();
	}
	static class UPictureInPicturePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPicturePlayer>();
	}
};

// Class PictureInPictureCore.PictureInPicturePartnerControls
// 0x0018 (0x0040 - 0x0028)
class UPictureInPicturePartnerControls final : public UObject
{
public:
	bool                                          bRequiresAgeOfConsent;                             // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UPictureInPictureClient*                ClientObject;                                      // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPictureMediaController*       MediaController;                                   // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPicturePartnerControls">();
	}
	static class UPictureInPicturePartnerControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPicturePartnerControls>();
	}
};

// Class PictureInPictureCore.PictureInPictureSubsystem
// 0x00F0 (0x0120 - 0x0030)
class UPictureInPictureSubsystem final : public UEngineSubsystem
{
public:
	TArray<class UPictureInPicturePartnerDataAsset*> AvailableClientsList;                           // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPartnerUpdateComplete;                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UPictureInPicturePartnerControls* NewPartner)> OnPartnerChanged; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bPartnerListUpdated;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsSuspended;                                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCMSInitialized;                                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 CurrentPlatform;                                   // 0x0068(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class FString, class UPictureInPicturePartnerControls*> SupportedPartnerControls;           // 0x0088(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	class FString                                 CurrentPartnerName;                                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentContinent;                                  // 0x00E8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentCountry;                                    // 0x00F8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         CurrentSubdivisions;                               // 0x0108(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortMediaCMSEventsComponent*           CMSEventsComponent;                                // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EnableFullScreenPiPOption(const bool bEnable);
	bool GetAutoEnableSetting();
	class UPictureInPictureClient* GetCurrentPartnerClient();
	class UPictureInPictureMediaController* GetCurrentPartnerController();
	class UPictureInPicturePartnerControls* GetCurrentPartnerControls();
	class UPictureInPicturePartnerDataAsset* GetCurrentPartnerItem();
	void GetLastUsedPartner(class FString* OutPartnerName);
	void GetLastUsedSource(class FString* OutPartnerSourceName);
	class UPictureInPictureClient* GetPartnerClient(const class FString& PartnerName);
	class UPictureInPictureMediaController* GetPartnerController(const class FString& PartnerName);
	class UPictureInPicturePartnerControls* GetPartnerControls(const class FString& PartnerName);
	class UPictureInPicturePartnerDataAsset* GetPartnerItem(const class FString& PartnerName);
	const TArray<class UPictureInPicturePartnerDataAsset*> GetPartnerItemList();
	void HandleFNEventsSetCurrentMediaControllerEnabled(bool InEnabled);
	void HandleMediaSourceRequest();
	bool IsPartnerListUpdated();
	void OnCMSEventInvalid(const class UMediaCMSEvent* InvalidEvent);
	void OnCMSEventValid(const class UMediaCMSEvent* ValidEvent);
	void OnCurrentPartnerSourceSelected(const struct FPiPPartnerSource& SelectedSource);
	void ResumeCurrentMediaController();
	void ShutdownAllPartners();
	void StoreAutoEnableSetting(bool InUserEnabled);
	void StoreLastUsedPartner(const class FString& InPartnerName);
	void StoreLastUsedSource(const class FString& InPartnerSourceName);
	void SuspendCurrentMediaController();
	void ToggleFullScreenPiP();
	void UpdatePartnerItemList(class UObject* InWorldContext, bool bForce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureSubsystem">();
	}
	static class UPictureInPictureSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureSubsystem>();
	}
};

}

