#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PictureInPictureCore

#include "Basic.hpp"

#include "PictureInPictureCore_structs.hpp"
#include "PictureInPictureDescriptors_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PictureInPictureCore.PictureInPictureClient.BeginLogin
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_BeginLogin final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureClient.CheckLogin
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_CheckLogin final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureClient.EndLogin
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_EndLogin final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureClient.GetAvatarImage
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_GetAvatarImage final
{
public:
	class UEpicCMSImage*                          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureClient.GetLoginState
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureClient_GetLoginState final
{
public:
	EPictureInPictureAuthState                    ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureClient.GetQRCodeTexture
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_GetQRCodeTexture final
{
public:
	class UTexture2DDynamic*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureClient.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureClient_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.Exit
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_Exit final
{
public:
	bool                                          bStop;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.GetActions
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_GetActions final
{
public:
	TArray<class UPictureInPictureActionData*>    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.GetCurrentSource
// 0x01E8 (0x01E8 - 0x0000)
struct PictureInPictureMediaController_GetCurrentSource final
{
public:
	struct FPiPPartnerSource                      ReturnValue;                                       // 0x0000(0x01E8)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.GetSources
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_GetSources final
{
public:
	TArray<struct FPiPPartnerSource>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.GetValidSources
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_GetValidSources final
{
public:
	TArray<struct FPiPPartnerSource>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.HandleSourceSelectedEvent
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_HandleSourceSelectedEvent final
{
public:
	class FString                                 SelectedSource;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.IsMultiSourceSupported
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsMultiSourceSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.OnNextThumbnailReceived
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureMediaController_OnNextThumbnailReceived final
{
public:
	class UTexture2DDynamic*                      InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.OnPrevThumbnailReceived
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureMediaController_OnPrevThumbnailReceived final
{
public:
	class UTexture2DDynamic*                      InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.Play
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_Play final
{
public:
	bool                                          bForcePlay;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.SetCurrentSource
// 0x01E8 (0x01E8 - 0x0000)
struct PictureInPictureMediaController_SetCurrentSource final
{
public:
	struct FPiPPartnerSource                      SelectedSource;                                    // 0x0000(0x01E8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.SetEnabled
// 0x0002 (0x0002 - 0x0000)
struct PictureInPictureMediaController_SetEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromUser;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.GetDefaultPlayerAssetConfig
// 0x0088 (0x0088 - 0x0000)
struct PictureInPictureMediaController_GetDefaultPlayerAssetConfig final
{
public:
	struct FPIPVideoPlayerAssetConfig             ReturnValue;                                       // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.GetMediaPlayerWidget
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureMediaController_GetMediaPlayerWidget final
{
public:
	class UPictureInPicturePlayer*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.GetPlayerAssetConfig
// 0x0088 (0x0088 - 0x0000)
struct PictureInPictureMediaController_GetPlayerAssetConfig final
{
public:
	struct FPIPVideoPlayerAssetConfig             ReturnValue;                                       // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureMediaController.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPicturePlayer.HandleUCPAudioChanged
// 0x0008 (0x0008 - 0x0000)
struct PictureInPicturePlayer_HandleUCPAudioChanged final
{
public:
	class UFortClientSettingsRecord*              Settings;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPicturePlayer.IsAssetConfigSet
// 0x0001 (0x0001 - 0x0000)
struct PictureInPicturePlayer_IsAssetConfigSet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPicturePlayer.SetPlayerAssetConfig
// 0x0090 (0x0090 - 0x0000)
struct PictureInPicturePlayer_SetPlayerAssetConfig final
{
public:
	struct FPIPVideoPlayerAssetConfig             InAssetConfig;                                     // 0x0000(0x0088)(Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PictureInPictureCore.PictureInPicturePlayer.StreamedVideoOnUrlFailure
// 0x0010 (0x0010 - 0x0000)
struct PictureInPicturePlayer_StreamedVideoOnUrlFailure final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPicturePlayer.StreamedVideoOnUrlSuccess
// 0x0010 (0x0010 - 0x0000)
struct PictureInPicturePlayer_StreamedVideoOnUrlSuccess final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPicturePlayer.UpdateStreamingPlayerSize
// 0x0010 (0x0010 - 0x0000)
struct PictureInPicturePlayer_UpdateStreamingPlayerSize final
{
public:
	struct FVector2D                              InVector;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.EnableFullScreenPiPOption
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_EnableFullScreenPiPOption final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetAutoEnableSetting
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_GetAutoEnableSetting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerClient
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerClient final
{
public:
	class UPictureInPictureClient*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerController
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerController final
{
public:
	class UPictureInPictureMediaController*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerControls
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerControls final
{
public:
	class UPictureInPicturePartnerControls*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerItem
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerItem final
{
public:
	class UPictureInPicturePartnerDataAsset*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetLastUsedPartner
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_GetLastUsedPartner final
{
public:
	class FString                                 OutPartnerName;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetLastUsedSource
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_GetLastUsedSource final
{
public:
	class FString                                 OutPartnerSourceName;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerClient
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerClient final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPictureClient*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerController
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerController final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPictureMediaController*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerControls
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerControls final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPicturePartnerControls*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerItem
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerItem final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPicturePartnerDataAsset*      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerItemList
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerItemList final
{
public:
	TArray<class UPictureInPicturePartnerDataAsset*> ReturnValue;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.HandleFNEventsSetCurrentMediaControllerEnabled
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_HandleFNEventsSetCurrentMediaControllerEnabled final
{
public:
	bool                                          InEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.IsPartnerListUpdated
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_IsPartnerListUpdated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.OnCMSEventInvalid
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_OnCMSEventInvalid final
{
public:
	const class UMediaCMSEvent*                   InvalidEvent;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.OnCMSEventValid
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_OnCMSEventValid final
{
public:
	const class UMediaCMSEvent*                   ValidEvent;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.OnCurrentPartnerSourceSelected
// 0x01E8 (0x01E8 - 0x0000)
struct PictureInPictureSubsystem_OnCurrentPartnerSourceSelected final
{
public:
	struct FPiPPartnerSource                      SelectedSource;                                    // 0x0000(0x01E8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.StoreAutoEnableSetting
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_StoreAutoEnableSetting final
{
public:
	bool                                          InUserEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.StoreLastUsedPartner
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_StoreLastUsedPartner final
{
public:
	class FString                                 InPartnerName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.StoreLastUsedSource
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_StoreLastUsedSource final
{
public:
	class FString                                 InPartnerSourceName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureCore.PictureInPictureSubsystem.UpdatePartnerItemList
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_UpdatePartnerItemList final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

