#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PilgrimCoreRuntime

#include "Basic.hpp"

#include "PilgrimCoreRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "Harmonix_structs.hpp"
#include "InputCore_structs.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "MetasoundEngine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function PilgrimCoreRuntime.AsyncAction_DelayUntilMidiNoteEvent.DelayUntilMidiNoteEvent
// 0x0020 (0x0020 - 0x0000)
struct AsyncAction_DelayUntilMidiNoteEvent_DelayUntilMidiNoteEvent final
{
public:
	class UPilgrimGame*                           PilgrimGame;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         EventNote;                                         // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEventStart;                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEventEnd;                             // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_DelayUntilMidiNoteEvent*   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.AsyncAction_DelayUntilMidiNoteEvent.DelayUntilMidiNoteEvents
// 0x0030 (0x0030 - 0x0000)
struct AsyncAction_DelayUntilMidiNoteEvent_DelayUntilMidiNoteEvents final
{
public:
	class UPilgrimGame*                           PilgrimGame;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 EventNotes;                                        // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEventStart;                           // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEventEnd;                             // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_DelayUntilMidiNoteEvent*   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.AsyncAction_DelayUntilMidiTextEvent.DelayUntilMidiTextEvent
// 0x0030 (0x0030 - 0x0000)
struct AsyncAction_DelayUntilMidiTextEvent_DelayUntilMidiTextEvent final
{
public:
	class UPilgrimGame*                           PilgrimGame;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 EventString;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEventStart;                           // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAsyncAction_DelayUntilMidiTextEvent*   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.AsyncAction_DelayUntilMidiTextEvent.DelayUntilMidiTextEvents
// 0x0030 (0x0030 - 0x0000)
struct AsyncAction_DelayUntilMidiTextEvent_DelayUntilMidiTextEvents final
{
public:
	class UPilgrimGame*                           PilgrimGame;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         EventStrings;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEventStart;                           // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAsyncAction_DelayUntilMidiTextEvent*   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.AsyncAction_DelayUntilMidiStrikeEvent.DelayUntilMidiStrikeEvent
// 0x0020 (0x0020 - 0x0000)
struct AsyncAction_DelayUntilMidiStrikeEvent_DelayUntilMidiStrikeEvent final
{
public:
	class UPilgrimGame*                           PilgrimGame;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SecondsBeforeEventStart;                           // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEventEnd;                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAsyncAction_DelayUntilMidiStrikeEvent* ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.AsyncAction_ListenForMidiNotePools.ListenForMidiNotePoolsEvent
// 0x0038 (0x0038 - 0x0000)
struct AsyncAction_ListenForMidiNotePools_ListenForMidiNotePoolsEvent final
{
public:
	class UPilgrimGame*                           InPilgrimGame;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             InTrackType;                                       // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         InEventNote;                                       // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 InWatchNotes;                                      // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMidiNoteEventDelayPool>        InDelayPools;                                      // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAsyncAction_ListenForMidiNotePools*    ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.AsyncAction_ListenForMidiNotePools.ListenForMidiNotePoolsEvents
// 0x0048 (0x0048 - 0x0000)
struct AsyncAction_ListenForMidiNotePools_ListenForMidiNotePoolsEvents final
{
public:
	class UPilgrimGame*                           InPilgrimGame;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             InTrackType;                                       // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 InEventNotes;                                      // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 InWatchNotes;                                      // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMidiNoteEventDelayPool>        InDelayPools;                                      // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAsyncAction_ListenForMidiNotePools*    ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.OnBar
// 0x0004 (0x0004 - 0x0000)
struct NetworkedMusicClockManager_OnBar final
{
public:
	int32                                         BarNumber;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.OnBeat
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_OnBeat final
{
public:
	int32                                         BeatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.PlayServerAuthoritativeSong
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_PlayServerAuthoritativeSong final
{
public:
	class UPilgrimSongMetadata*                   SongToPlay;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.SetClientAudioComponentsToUse
// 0x0010 (0x0010 - 0x0000)
struct NetworkedMusicClockManager_SetClientAudioComponentsToUse final
{
public:
	class UAudioComponent*                        InMetasoundPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        InMetasoundMixer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.GetOwnedMusicClock
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_GetOwnedMusicClock final
{
public:
	class UMusicClockComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBars.WaitForBars
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForBars_WaitForBars final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BarsToWaitFor;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopFor;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForBars*        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBeats.WaitForBeats
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForBeats_WaitForBeats final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatsToWaitFor;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopFor;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForBeats*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForSection.WaitForSection
// 0x0028 (0x0028 - 0x0000)
struct PilgrimAbilityTask_WaitForSection_WaitForSection final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldWaitForNextSection;                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 SectionName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForSection*     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForSection.OnSectionEvent
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForSection_OnSectionEvent final
{
public:
	class FString                                 SectionName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectionStartMs;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectionLengthMs;                                   // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimActorPool.InitPool
// 0x0010 (0x0010 - 0x0000)
struct PilgrimActorPool_InitPool final
{
public:
	struct FPilgrimActorPoolParams                PilgrimActorPoolParams;                            // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimActorPool.TryReturnItem
// 0x0010 (0x0010 - 0x0000)
struct PilgrimActorPool_TryReturnItem final
{
public:
	class AActor*                                 ActorToPutBack;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimCoreRuntime.PilgrimActorPool.GetNumAvailableItems
// 0x0004 (0x0004 - 0x0000)
struct PilgrimActorPool_GetNumAvailableItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimActorPool.GetNumInUseItems
// 0x0004 (0x0004 - 0x0000)
struct PilgrimActorPool_GetNumInUseItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestLeaderboard.PilgrimRequestLeaderboard
// 0x0048 (0x0048 - 0x0000)
struct PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 SpotlightGroup;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimLeaderboardType                       LeaderboardType;                                   // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFriendsOnly;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenteredOnRequestingPlayer;                       // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Page;                                              // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSpotlightCompetition;                           // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UPilgrimAsyncAction_RequestLeaderboard* ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestPersonalBest.PilgrimRequestPersonalBest
// 0x0060 (0x0060 - 0x0000)
struct PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerAccountId;                                   // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             InstrumentType;                                    // 0x0044(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         BandSize;                                          // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SetlistIndex;                                      // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCache;                                         // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UPilgrimAsyncAction_RequestPersonalBest* ReturnValue;                                      // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestPlayerFeed.PilgrimRequestPlayerFeed
// 0x00A0 (0x00A0 - 0x0000)
struct PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SongQuery;                                         // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSongShortNameMatcher                  SongShortNameMatcher;                              // 0x0058(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EPilgrimLeaderboardType>               Leaderboards;                                      // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FUniqueNetIdRepl>               FriendIds;                                         // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPilgrimPlayerFeedSortType                    SortType;                                          // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllScores;                                        // 0x0091(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequirePlayerScore;                               // 0x0092(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class UPilgrimAsyncAction_RequestPlayerFeed*  ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimBeatMarker.SetupNumLanes
// 0x0004 (0x0004 - 0x0000)
struct PilgrimBeatMarker_SetupNumLanes final
{
public:
	int32                                         NumLanes;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimBeatValidatedAbility.OnBeatAbilityActivated
// 0x0001 (0x0001 - 0x0000)
struct PilgrimBeatValidatedAbility_OnBeatAbilityActivated final
{
public:
	bool                                          bOnBeat;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetPilgrimCorePlayerStateComponent
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimCorePlayerStateComponent*       ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_InstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice final
{
public:
	EPilgrimTrackType                             PrevInstrument;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_IsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_IsReady final
{
public:
	bool                                          bPrevIsReady;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_SongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_SongDifficulty final
{
public:
	EPilgrimSongDifficulty                        PrevDifficulty;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.ServerSetIsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_ServerSetIsReady final
{
public:
	bool                                          bInIsReady;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.ServerSetIsUsingPlasticInstruments
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments final
{
public:
	bool                                          bIsPlasticAvailable;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.SetInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_SetInstrumentChoice final
{
public:
	EPilgrimTrackType                             Instrument;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.SetSongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_SetSongDifficulty final
{
public:
	EPilgrimSongDifficulty                        Difficulty;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetInstrumentChoice final
{
public:
	EPilgrimTrackType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetIsPlasticInstrumentAvailable
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetIsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetIsReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetSongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetSongDifficulty final
{
public:
	EPilgrimSongDifficulty                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetTrackTypeForGameplay
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay final
{
public:
	EPilgrimTrackType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.InstrumentTypesAreEqual
// 0x0003 (0x0003 - 0x0000)
struct PilgrimCore_BPFL_InstrumentTypesAreEqual final
{
public:
	ESparksInstrumentType                         SparksType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             PilgrimType;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.MidiTrackNameToPilgrimTrackType
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCore_BPFL_MidiTrackNameToPilgrimTrackType final
{
public:
	class FString                                 MidiTrackName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.PilgrimTrackTypeToMidiTrackName
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCore_BPFL_PilgrimTrackTypeToMidiTrackName final
{
public:
	EPilgrimTrackType                             PilgrimType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.PilgrimTrackTypeToSparksInstrument
// 0x0002 (0x0002 - 0x0000)
struct PilgrimCore_BPFL_PilgrimTrackTypeToSparksInstrument final
{
public:
	EPilgrimTrackType                             PilgrimType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.ShouldUseTouchUIForLocalPlayer
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCore_BPFL_ShouldUseTouchUIForLocalPlayer final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.SparksInstrumentToPilgrimTrackType
// 0x0002 (0x0002 - 0x0000)
struct PilgrimCore_BPFL_SparksInstrumentToPilgrimTrackType final
{
public:
	ESparksInstrumentType                         SparksType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.OnRep_MaxSongsPerPlayer
// 0x0004 (0x0004 - 0x0000)
struct PilgrimCustomSetlist_OnRep_MaxSongsPerPlayer final
{
public:
	int32                                         PrevMax;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerAddSongForPlayer
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCustomSetlist_ServerAddSongForPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerRemoveAllSongsForPlayer
// 0x0008 (0x0008 - 0x0000)
struct PilgrimCustomSetlist_ServerRemoveAllSongsForPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerRemoveSongAtIndex
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCustomSetlist_ServerRemoveSongAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerRemoveSongForPlayer
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_ServerRemoveSongForPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAll;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerSetIsSetlistLocked
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCustomSetlist_ServerSetIsSetlistLocked final
{
public:
	bool                                          bInIsLocked;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerSetMaxSongsPerPlayer
// 0x0004 (0x0004 - 0x0000)
struct PilgrimCustomSetlist_ServerSetMaxSongsPerPlayer final
{
public:
	int32                                         NewMax;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.CanAddSongForPlayer
// 0x0028 (0x0028 - 0x0000)
struct PilgrimCustomSetlist_CanAddSongForPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimCantAddSongReason                     OutReason;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerState*                           OutAddedByPlayer;                                  // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.FindEntriesForPlayer
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_FindEntriesForPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutMatchingEntryIndicies;                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.FindEntriesForSong
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_FindEntriesForSong final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 OutMatchingEntryIndicies;                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.FindEntriesForSongAndPlayer
// 0x0020 (0x0020 - 0x0000)
struct PilgrimCustomSetlist_FindEntriesForSongAndPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutMatchingEntryIndicies;                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetIsSetlistLocked
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCustomSetlist_GetIsSetlistLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetMaxSongsPerPlayer
// 0x0004 (0x0004 - 0x0000)
struct PilgrimCustomSetlist_GetMaxSongsPerPlayer final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetSetlistEntryAtIndex
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCustomSetlist_GetSetlistEntryAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutSongShortName;                                  // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           OutAddedByPlayer;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetSongsAddedByPlayer
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_GetSongsAddedByPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.HasAnyoneAddedSong
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_HasAnyoneAddedSong final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerState*                           OutAddedByPlayer;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.HasPlayerAddedSong
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_HasPlayerAddedSong final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimCoreRuntime.PilgrimDelayUntilTimeBeforeMidiTick.PilgrimDelayUntilTimeBeforeMidiTick
// 0x0028 (0x0028 - 0x0000)
struct PilgrimDelayUntilTimeBeforeMidiTick_PilgrimDelayUntilTimeBeforeMidiTick final
{
public:
	class UObject*                                PassthroughObject;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimGame*                           PilgrimGameContext;                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MidiTick;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeTick;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibratedMusicTimebase                      Timebase;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UPilgrimDelayUntilTimeBeforeMidiTick*   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimEventRouterLibrary.GetGameplayEventRouter
// 0x0010 (0x0010 - 0x0000)
struct PilgrimEventRouterLibrary_GetGameplayEventRouter final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayEventRouterComponent*          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.AddScoreMod
// 0x0010 (0x0010 - 0x0000)
struct PilgrimGame_AddScoreMod final
{
public:
	EPilgrimScoringTarget                         Target;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UPilgrimScoringModifier*                ScoringModifier;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.AddTrack
// 0x0008 (0x0008 - 0x0000)
struct PilgrimGame_AddTrack final
{
public:
	class APilgrimTrack*                          Track;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.ApplyRawScoreModifier
// 0x0004 (0x0004 - 0x0000)
struct PilgrimGame_ApplyRawScoreModifier final
{
public:
	float                                         Score;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.ApplySettingsFromConfig
// 0x0018 (0x0018 - 0x0000)
struct PilgrimGame_ApplySettingsFromConfig final
{
public:
	const class UPilgrimGameConfig*               GameConfig;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimScoreMultiplierInfo>    ScoreMultiplierDefinitions;                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.CheatSetJumpMarkers
// 0x0020 (0x0020 - 0x0000)
struct PilgrimGame_CheatSetJumpMarkers final
{
public:
	class FString                                 FromTime;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ToTime;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.CheatSetPerformanceData
// 0x000C (0x000C - 0x0000)
struct PilgrimGame_CheatSetPerformanceData final
{
public:
	struct FPilgrimCheatPerformanceArgument       PerformanceArgument;                               // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.EndGame
// 0x0008 (0x0008 - 0x0000)
struct PilgrimGame_EndGame final
{
public:
	bool                                          bFadeOut;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         FadeOutDurationSeconds;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.GetGameConfigSettings
// 0x0298 (0x0298 - 0x0000)
struct PilgrimGame_GetGameConfigSettings final
{
public:
	struct FPilgrimGameConfigSettings             ReturnValue;                                       // 0x0000(0x0298)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.GetNumLanes
// 0x0004 (0x0004 - 0x0000)
struct PilgrimGame_GetNumLanes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct PilgrimGame_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreRuntime.PilgrimGame.PlaySong
// 0x0020 (0x0020 - 0x0000)
struct PilgrimGame_PlaySong final
{
public:
	class UAudioComponent*                        InMetasoundPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        InMetasoundMixer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
