#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PilgrimQuickplayRuntime

#include "Basic.hpp"

#include "PilgrimQuickplayRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PilgrimQPSharedRuntime_structs.hpp"
#include "PilgrimCoreRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function PilgrimQuickplayRuntime.PilgrimGreenRoomLayoutSwitcher.OnLayoutChanged
// 0x0004 (0x0004 - 0x0000)
struct PilgrimGreenRoomLayoutSwitcher_OnLayoutChanged final
{
public:
	int32                                         NewLayout;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimGreenRoomLayoutSwitcher.SetLayout
// 0x0004 (0x0004 - 0x0000)
struct PilgrimGreenRoomLayoutSwitcher_SetLayout final
{
public:
	int32                                         NewLayout;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimPlayspaceComponent_IntroDirector.StartPlayerIntro
// 0x0008 (0x0008 - 0x0000)
struct PilgrimPlayspaceComponent_IntroDirector_StartPlayerIntro final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetBandState
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetBandState final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimQuickplayBandStateComponent*    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.OnRep_CurrentSetlistIndex
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayBandStateComponent_OnRep_CurrentSetlistIndex final
{
public:
	int32                                         PrevSetlistIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.OnRep_SetlistVoteWinner
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayBandStateComponent_OnRep_SetlistVoteWinner final
{
public:
	class UPilgrimPremadeSetlist*                 PrevSetlist;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.AreAllPlayersReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayBandStateComponent_AreAllPlayersReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetCurrentSetlist
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetCurrentSetlist final
{
public:
	TScriptInterface<class IPilgrimSetlistInterface> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetCurrentSetlistIndex
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetCurrentSetlistIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetCurrentSetlistLength
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetCurrentSetlistLength final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetCurrentSong
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetCurrentSong final
{
public:
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetNextSong
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetNextSong final
{
public:
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetPlayersInBand
// 0x0018 (0x0018 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetPlayersInBand final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class APlayerState*>                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetPlayersInBandByController
// 0x0018 (0x0018 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetPlayersInBandByController final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetSetlistVoteWinner
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetSetlistVoteWinner final
{
public:
	class UPilgrimPremadeSetlist*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetSongAtIndex
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetSongAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetVoteCountForSetlist
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetVoteCountForSetlist final
{
public:
	class UPilgrimPremadeSetlist*                 Setlist;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent.GetVotersForSetlist
// 0x0018 (0x0018 - 0x0000)
struct PilgrimQuickplayBandStateComponent_GetVotersForSetlist final
{
public:
	class UPilgrimPremadeSetlist*                 Setlist;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayEmoteBPFL.GetEmoteActionBinding
// 0x0030 (0x0030 - 0x0000)
struct PilgrimQuickplayEmoteBPFL_GetEmoteActionBinding final
{
public:
	class FString                                 EmoteTemplateID;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEmoteActionBinding                    OutCreatedEmote;                                   // 0x0010(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetPilgrimQuickplayPlayerStateComponent
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetPilgrimQuickplayPlayerStateComponent final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimQuickplayPlayerStateComponent*  ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetSongVote
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetSongVote final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.BroadcastEvent_SongResultDataChanged
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_BroadcastEvent_SongResultDataChanged final
{
public:
	int32                                         SetlistIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.ClientMatchRecorded
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_ClientMatchRecorded final
{
public:
	int32                                         SetlistIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSoloMatch;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.MulticastBroadcastNewHighscore
// 0x000C (0x000C - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_MulticastBroadcastNewHighscore final
{
public:
	int32                                         TotalScore;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeltaScore;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimPersonalBestType                      BestType;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.OnRep_SetlistVote
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_OnRep_SetlistVote final
{
public:
	class UPilgrimPremadeSetlist*                 PrevSetlistVote;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.OnRep_SongVote
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_OnRep_SongVote final
{
public:
	class UPilgrimSongMetadata*                   PrevSongVote;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SendHighscoreToServer
// 0x01A0 (0x01A0 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SendHighscoreToServer final
{
public:
	struct FPilgrimPersonalBestResult             Highscore;                                         // 0x0000(0x0198)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SetlistIndex;                                      // 0x0198(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoaded;                                           // 0x019C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SendToClientsPerformanceData
// 0x0050 (0x0050 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SendToClientsPerformanceData final
{
public:
	int32                                         SetlistIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPilgrimQuickplayPlayerPerformanceData NewPerformanceData;                                // 0x0008(0x0048)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SendToClientsSongResultData
// 0x0078 (0x0078 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SendToClientsSongResultData final
{
public:
	int32                                         SetlistIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPilgrimQuickplaySongResultData        NewPerformanceData;                                // 0x0008(0x0070)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SendToServerAllIntrosFinished
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SendToServerAllIntrosFinished final
{
public:
	class UPilgrimQuickplayState_Intro*           IntroState;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SendToServerPerformanceData
// 0x0048 (0x0048 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SendToServerPerformanceData final
{
public:
	struct FPilgrimQuickplayPlayerPerformanceData NewPerformanceData;                                // 0x0000(0x0048)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.ServerSetHighscore
// 0x0098 (0x0098 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_ServerSetHighscore final
{
public:
	struct FPilgrimPersonalBestResultRpl          Highscore;                                         // 0x0000(0x0090)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SetlistIndex;                                      // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoaded;                                           // 0x0094(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SetCloseupCameraTime
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SetCloseupCameraTime final
{
public:
	float                                         TotalTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SetHighscore
// 0x0098 (0x0098 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SetHighscore final
{
public:
	struct FPilgrimPersonalBestResultRpl          Highscore;                                         // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SetlistIndex;                                      // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoaded;                                           // 0x0094(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SetPerformanceData
// 0x0048 (0x0048 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SetPerformanceData final
{
public:
	struct FPilgrimQuickplayPlayerPerformanceData NewPerformanceData;                                // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SetReachedNewHighscore
// 0x000C (0x000C - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SetReachedNewHighscore final
{
public:
	int32                                         TotalScore;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeltaScore;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimPersonalBestType                      BestType;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SetSetlistVote
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SetSetlistVote final
{
public:
	class UPilgrimPremadeSetlist*                 PlayerChosenSetlist;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SetSongResultData
// 0x0070 (0x0070 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SetSongResultData final
{
public:
	struct FPilgrimQuickplaySongResultData        NewSongResultData;                                 // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.SetSongVote
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_SetSongVote final
{
public:
	class UPilgrimSongMetadata*                   PlayerChosenSong;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetBandState
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetBandState final
{
public:
	class UPilgrimQuickplayBandStateComponent*    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetCloseupCameraTime
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetCloseupCameraTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetCurrentSetlistVote
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetCurrentSetlistVote final
{
public:
	class UPilgrimPremadeSetlist*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetCurrentSongVote
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetCurrentSongVote final
{
public:
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetHighscoreResult
// 0x0098 (0x0098 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetHighscoreResult final
{
public:
	struct FPilgrimPersonalBestResultRpl          OutResult;                                         // 0x0000(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         SetlistIndex;                                      // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoaded;                                           // 0x0094(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0095(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetMainStateMachine
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetMainStateMachine final
{
public:
	class UGameplayStateMachine*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetPerformanceData
// 0x0048 (0x0048 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetPerformanceData final
{
public:
	struct FPilgrimQuickplayPlayerPerformanceData ReturnValue;                                       // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetReachedNewHighscore
// 0x000C (0x000C - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetReachedNewHighscore final
{
public:
	EPilgrimPersonalBestType                      BestType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SetlistIndex;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetSetlistResultDataByIndex
// 0x00C8 (0x00C8 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetSetlistResultDataByIndex final
{
public:
	int32                                         SetlistIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPilgrimQuickplaySetlistResultData     ReturnValue;                                       // 0x0008(0x00C0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetSetlistResultProxies
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetSetlistResultProxies final
{
public:
	TArray<class UPilgrimQuickplaySetlistResultProxyInstance*> SetlistProxy;                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent.GetSongResultData
// 0x0070 (0x0070 - 0x0000)
struct PilgrimQuickplayPlayerStateComponent_GetSongResultData final
{
public:
	struct FPilgrimQuickplaySongResultData        ReturnValue;                                       // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayspace.GetActivePilgrimQuickplayState
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayspace_GetActivePilgrimQuickplayState final
{
public:
	class UPilgrimQuickplayStateBase*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayspace.GetActivePilgrimStateId
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayPlayspace_GetActivePilgrimStateId final
{
public:
	EPilgrimQuickplayState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayPlayspace.GetPilgrimQuickplayStateMachine
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayPlayspace_GetPilgrimQuickplayStateMachine final
{
public:
	class UPilgrimQuickplayStateMachine*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateBase.MarkStateDone
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayStateBase_MarkStateDone final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateBase.GetEventRouter
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateBase_GetEventRouter final
{
public:
	class UGameplayEventRouterComponent*          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateBase.GetPilgrimPlayspace
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateBase_GetPilgrimPlayspace final
{
public:
	class APilgrimQuickplayPlayspace*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateBase.GetPilgrimStateId
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayStateBase_GetPilgrimStateId final
{
public:
	EPilgrimQuickplayState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateBase.GetPilgrimStateMachine
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateBase_GetPilgrimStateMachine final
{
public:
	class UPilgrimQuickplayStateMachine*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateBPFL.GetPilgrimState
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateBPFL_GetPilgrimState final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimQuickplayState                        ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateBPFL.GetStateTag
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateBPFL_GetStateTag final
{
public:
	EPilgrimQuickplayState                        State;                                             // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.CleanUpStageForPlayer
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateMachine_CleanUpStageForPlayer final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.GetPlayerPawnsInPlayspace
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayStateMachine_GetPlayerPawnsInPlayspace final
{
public:
	TArray<class AFortPlayerPawn*>                PlayerPawns;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.PrepareStageForPlayer
// 0x0038 (0x0038 - 0x0000)
struct PilgrimQuickplayStateMachine_PrepareStageForPlayer final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TeleportLocation;                                  // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TeleportRotation;                                  // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.TeleportAllPlayers
// 0x0020 (0x0020 - 0x0000)
struct PilgrimQuickplayStateMachine_TeleportAllPlayers final
{
public:
	struct FGameplayTagContainer                  TeleportTagRequirements;                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.GetActivePilgrimStateId
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayStateMachine_GetActivePilgrimStateId final
{
public:
	EPilgrimQuickplayState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.GetActivePilgrimStateObject
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateMachine_GetActivePilgrimStateObject final
{
public:
	class UPilgrimQuickplayStateBase*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.GetDailyQuests
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayStateMachine_GetDailyQuests final
{
public:
	TArray<class UFortQuestItemDefinition*>       OutDailyQuests;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine.GetEventRouter
// 0x0008 (0x0008 - 0x0000)
struct PilgrimQuickplayStateMachine_GetEventRouter final
{
public:
	class UGameplayEventRouterComponent*          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayState_Intro.UpdateCameraWaitTime
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayState_Intro_UpdateCameraWaitTime final
{
public:
	float                                         NewWaitTime;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayState_SongGameplay.OnMusicBattleFinished
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayState_SongGameplay_OnMusicBattleFinished final
{
public:
	EMusicBattleEndReason                         EndReason;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayState_SongGameplay.OnMusicBattleStoppedEarly
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayState_SongGameplay_OnMusicBattleStoppedEarly final
{
public:
	EMusicBattleEndReason                         EndReason;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayState_SongGameplay.GetPilgrimMusicBattleInstances
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuickplayState_SongGameplay_GetPilgrimMusicBattleInstances final
{
public:
	TArray<class APilgrimMusicBattleInstance*>    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimQuickplayState_SongResults.GetTimerRemaining
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplayState_SongResults_GetTimerRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimStandinDirector.SetupListeners
// 0x0008 (0x0008 - 0x0000)
struct PilgrimStandinDirector_SetupListeners final
{
public:
	class UGameplayEventRouterComponent*          EventRouter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimStandinDirector.TeleportSpawnedStandins
// 0x0010 (0x0010 - 0x0000)
struct PilgrimStandinDirector_TeleportSpawnedStandins final
{
public:
	TArray<class AFortPlayerStart*>               Destinations;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimStandinPawnComponent.SetupListeners
// 0x0008 (0x0008 - 0x0000)
struct PilgrimStandinPawnComponent_SetupListeners final
{
public:
	class UGameplayEventRouterComponent*          EventRouter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayRuntime.PilgrimStandinPawnComponent.StartInstrumentAnimation
// 0x0010 (0x0010 - 0x0000)
struct PilgrimStandinPawnComponent_StartInstrumentAnimation final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASparksMusicPlayspace*                  Playspace;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

