#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PlayerRiderComponent

#include "Basic.hpp"

#include "RidingCodeRuntime_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerRiderComponent.PlayerRiderComponent_C
// 0x0110 (0x07D8 - 0x06C8)
class UPlayerRiderComponent_C final : public UControllingRiderComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  T_PlayerIsRiding;                                  // 0x06D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_PlayerIsRiding;                                 // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        FortPlayerRef;                                     // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        JumpOnMountDistanceCheck;                          // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FText Name, const struct FSlateBrush& Icon, class AActor* RidableActor)> RiderUINewStats; // 0x0708(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class AActor* RidableActor)> RiderUIEnd;                           // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        targetEnergy;                                      // 0x0728(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                        targetHealth;                                      // 0x0730(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_CannotRideBucket;                                // 0x0738(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(double Energy)> RiderUIUpdateEnergy;                               // 0x0758(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(double Health)> RiderUIUpdateHealth;                               // 0x0768(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AActor*                                 CachedRidableActor;                                // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Cannot_Ride_Rider_Bucket;                          // 0x0780(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           JumpOnCreature_Cue_Tag;                            // 0x07A0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UGameplayEffect>            GE_PlayerPetting;                                  // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_Quests_Wildlife_Pet;                           // 0x07B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityAsync_WaitGameplayTagAdded*     ActiveRidableBlockRidingGameplayTagAsyncAction;    // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_42EF586645CCFF06FFA4D9A5D59B1298();
	void Added_A83C775344FE0F6BDAAC4B971F57425E();
	void Added_D3DFE4374EED456A4C597E95375A2028();
	void EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6(const struct FGameplayEventData& Payload);
	void EventReceived_E5B5FB5340DB5660002329825657B406(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_PlayerRiderComponent(int32 EntryPoint);
	void GetJumpInfo(class AActor* TargetActor, class UActorComponent** TargetActorComponent, double* JumpAttach_GroundHeightMin, double* JumpAttach_GroundHeightBuffer, bool* UseAltRidingMessage);
	void GetRidingInfoFromTarget(double* JumpAttachGroundHeightMin, double* JumpAttachGroundHeightBuffer, bool* UsesAltRidingMessage);
	void HandleRequestPettingStart();
	void HandleRequestPettingStop();
	void HandleRidableFound(const struct FHitResult& HitResult);
	void HandleStartedRiding(class URidableComponent* Ridable);
	void HandleStoppedRiding(class URidableComponent* Ridable);
	void MountLanded(const struct FHitResult& Hit);
	void MovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnRep_targetEnergy();
	void OnRep_targetHealth();
	void ReceiveBeginPlay();
	void RiderUIEndClient(class AActor* Ridable);
	void RiderUIStartClient(const class FText& Name_0, const struct FSlateBrush& Icon, class AActor* Ridable);
	void SetTargetHealth(double targetHealth_0);
	void TestIfValidForRidingAttempt(class UObject* Object, bool* Success, class UObject** TargetObject, bool* UseAltRidingMessage);
	void ToggleRiding(class AActor* PlayerPawn, class AActor* Target, bool ShouldRide, bool* bChangedRiding);
	void ToggleRidingAlternative();
	void ToggleRidingOnServer(class UObject* TargetObject, bool UseAltRidingMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerRiderComponent_C">();
	}
	static class UPlayerRiderComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerRiderComponent_C>();
	}
};

}

