#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ProgressiveSetDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CrewUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveSetDetails.ProgressiveSetDetails_C
// 0x0080 (0x0370 - 0x02F0)
class UProgressiveSetDetails_C final : public UFortProgressiveSetDetailsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressiveTagsBase_C*                 Tag_ItemSetState;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_HeaderSetName;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoTimeLimit;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0310(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Completed_BG;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_BG;                                        // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Completed_FG;                                      // 0x0348(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Default_FG;                                        // 0x035C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Update_Tag(const class FText& Expiring_Text, const bool Completed);
	void ExecuteUbergraph_ProgressiveSetDetails(int32 EntryPoint);
	void BP_OnUpdateSetDetails(const class FText& SetName, const class FText& ExpiringText, const bool bCompleted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveSetDetails_C">();
	}
	static class UProgressiveSetDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveSetDetails_C>();
	}
};

}

