#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Prop_PhysicsBoulder_Granite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_PhysicsBoulder_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_PhysicsBoulder_Granite.Prop_PhysicsBoulder_Granite_C
// 0x0028 (0x0C60 - 0x0C38)
class AProp_PhysicsBoulder_Granite_C final : public AProp_PhysicsBoulder_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_PhysicsBoulder_Granite_C;      // 0x0C38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystem*                         NS_RollingEffects;                                 // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   RollingEffectsVector3VarName;                      // 0x0C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4C[0x4];                                      // 0x0C4C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UNiagaraSystem*                         OnSpawnFX_One;                                     // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         OnSpawnFX_Two;                                     // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prop_PhysicsBoulder_Granite(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_PhysicsBoulder_Granite_C">();
	}
	static class AProp_PhysicsBoulder_Granite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_PhysicsBoulder_Granite_C>();
	}
};

}

