#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: QuestMapProductButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function QuestMapProductButton.QuestMapProductButton_C.ExecuteUbergraph_QuestMapProductButton
// 0x0068 (0x0068 - 0x0000)
struct QuestMapProductButton_C_ExecuteUbergraph_QuestMapProductButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Event_DisplayName;                          // 0x0008(0x0018)(ConstParm)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_Icon;                                 // 0x0020(0x0020)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Event_bExpanded;                            // 0x0040(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function QuestMapProductButton.QuestMapProductButton_C.BP_ProductExpanded
// 0x0001 (0x0001 - 0x0000)
struct QuestMapProductButton_C_BP_ProductExpanded final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function QuestMapProductButton.QuestMapProductButton_C.BP_Populate
// 0x0038 (0x0038 - 0x0000)
struct QuestMapProductButton_C_BP_Populate final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0018(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};

}

