#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RandomPrefabSpawningRuntime

#include "Basic.hpp"

#include "ModularGameplay_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "RandomPrefabSpawningRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class RandomPrefabSpawningRuntime.FortPrefabSpawner
// 0x0030 (0x02C0 - 0x0290)
class AFortPrefabSpawner final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  RequiredProperties;                                // 0x0298(0x0020)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bWorldReadyCalled;                                 // 0x02B8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPrefabSpawner">();
	}
	static class AFortPrefabSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortPrefabSpawner>();
	}
};

// Class RandomPrefabSpawningRuntime.FortRandomPrefabSpawnHelper
// 0x0060 (0x0100 - 0x00A0)
class UFortRandomPrefabSpawnHelper final : public UGameStateComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFortRandomPrefabData>          AllPrefabs;                                        // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortRandomPrefabData>          PrefabPool;                                        // 0x00C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         bAcceptDuplicatesWhenOutOfUniquePrefabs;           // 0x00D8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRandomPrefabSpawnHelper">();
	}
	static class UFortRandomPrefabSpawnHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRandomPrefabSpawnHelper>();
	}
};

}

