#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RockVehicleRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum RockVehicleRuntime.ERockBoostLogic
// NumValues: 0x0004
enum class ERockBoostLogic : uint8
{
	Standard                                 = 0,
	Recharge                                 = 1,
	Infinite                                 = 2,
	ERockBoostLogic_MAX                      = 3,
};

// ScriptStruct RockVehicleRuntime.RockRuntimeConfigOverrides
// 0x0004 (0x0004 - 0x0000)
struct FRockRuntimeConfigOverrides final
{
public:
	bool                                          bDamageFriendlyVehicles;                           // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDamageOtherVehicles;                              // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDamageOwnVehicle;                                 // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDamageAllowedFromOtherVehicle;                    // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleState
// 0x00E0 (0x00E0 - 0x0000)
struct FRockVehicleState final
{
public:
	struct FReplicatedPhysicsPawnState            RigidBodyState;                                    // 0x0000(0x0080)(NoDestructor, NativeAccessSpecifierPublic)
	struct FFortAthenaVehicleInputState           PrevDriverInput;                                   // 0x0080(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bWheelsOnGround;                                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyWheelsOnGround;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                AverageSpringNormal;                               // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockScalableFloat
// 0x0008 (0x0030 - 0x0028)
struct FRockScalableFloat final : public FScalableFloat
{
public:
	float                                         CachedValue;                                       // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.BouncyChassisState
// 0x000C (0x000C - 0x0000)
struct FBouncyChassisState final
{
public:
	float                                         PitchDegrees;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollDegrees;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TranslationZ;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.AnimNode_RockVehicleController
// 0x0018 (0x00E0 - 0x00C8)
struct FAnimNode_RockVehicleController final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         ChassisBone;                                       // 0x00C8(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBouncyChassisState                    BouncyChassis;                                     // 0x00D4(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockBoxSpringSetup
// 0x0050 (0x0050 - 0x0000)
struct FRockBoxSpringSetup final
{
public:
	struct FVector                                Strength;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Damping;                                           // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxDisplacement;                                   // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mass;                                              // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockBoxSpring
// 0x00B0 (0x00B0 - 0x0000)
struct FRockBoxSpring final
{
public:
	struct FRockBoxSpringSetup                    Setup;                                             // 0x0000(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x60];                                      // 0x0050(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.SpringSettings
// 0x0008 (0x0008 - 0x0000)
struct FSpringSettings final
{
public:
	float                                         Strength;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damping;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.BouncyChassisSetup
// 0x0058 (0x0058 - 0x0000)
struct FBouncyChassisSetup final
{
public:
	struct FSpringSettings                        PitchSpring;                                       // 0x0000(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PitchMaxAngleDegrees;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpringSettings                        RollSpring;                                        // 0x000C(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RollMaxAngleDegrees;                               // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpringSettings                        ZSpring;                                           // 0x0018(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ZMaxDrop;                                          // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZMaxRaise;                                         // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxDisplacement;                                   // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MassOffset;                                        // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.BouncyChassisInstance
// 0x0118 (0x0118 - 0x0000)
struct FBouncyChassisInstance final
{
public:
	struct FRockBoxSpring                         Spring;                                            // 0x0000(0x00B0)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x68];                                      // 0x00B0(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FRockVehicleAbilityInPersistent
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent_AirControl
// 0x0038 (0x0040 - 0x0008)
struct FRockVehicleAbilityInPersistent_AirControl final : public FRockVehicleAbilityInPersistent
{
public:
	struct FVector                                TorqueAccel;                                       // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TorqueDamping;                                     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisableForDodgeTime;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInContinuous
// 0x0040 (0x0040 - 0x0000)
struct FRockVehicleAbilityInContinuous
{
public:
	struct FFortAthenaVehicleInputState           InputState;                                        // 0x0000(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInContinuous_AirControl
// 0x0008 (0x0048 - 0x0040)
struct FRockVehicleAbilityInContinuous_AirControl final : public FRockVehicleAbilityInContinuous
{
public:
	bool                                          bAnyWheelsOnGround;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDodgeActive;                                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoUprightActive;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent_AutoUpright
// 0x0010 (0x0018 - 0x0008)
struct FRockVehicleAbilityInPersistent_AutoUpright final : public FRockVehicleAbilityInPersistent
{
public:
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInContinuous_AutoUpright
// 0x0010 (0x0050 - 0x0040)
struct FRockVehicleAbilityInContinuous_AutoUpright final : public FRockVehicleAbilityInContinuous
{
public:
	int32                                         LastWorldContactFrame;                             // 0x0040(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWheelsOnGround;                                   // 0x0044(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyWheelsOnGround;                                // 0x0045(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDodgeActive;                                      // 0x0046(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBodyContact;                                      // 0x0047(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeSinceLastBodyContact;                          // 0x0048(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent_Boost
// 0x0008 (0x0010 - 0x0008)
struct FRockVehicleAbilityInPersistent_Boost final : public FRockVehicleAbilityInPersistent
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInContinuous_Boost
// 0x0008 (0x0048 - 0x0040)
struct FRockVehicleAbilityInContinuous_Boost final : public FRockVehicleAbilityInContinuous
{
public:
	bool                                          bHasBoost;                                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockDodgeImpulse_PhysicsThread
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FRockDodgeImpulse_PhysicsThread final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockDodgeImpulse
// 0x0060 (0x0060 - 0x0000)
struct FRockDodgeImpulse final
{
public:
	struct FRockScalableFloat                     VelocityChange;                                    // 0x0000(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxSpeedScale;                                     // 0x0030(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent_Dodge
// 0x0040 (0x0048 - 0x0008)
struct FRockVehicleAbilityInPersistent_Dodge final : public FRockVehicleAbilityInPersistent
{
public:
	uint8                                         Pad_8[0x40];                                       // 0x0008(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInContinuous_Dodge
// 0x0008 (0x0048 - 0x0040)
struct FRockVehicleAbilityInContinuous_Dodge final : public FRockVehicleAbilityInContinuous
{
public:
	bool                                          bWheelsOnGround;                                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent_DoubleJump
// 0x0008 (0x0010 - 0x0008)
struct FRockVehicleAbilityInPersistent_DoubleJump final : public FRockVehicleAbilityInPersistent
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent_Flip
// 0x0010 (0x0018 - 0x0008)
struct FRockVehicleAbilityInPersistent_Flip final : public FRockVehicleAbilityInPersistent
{
public:
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInContinuous_Flip
// 0x0008 (0x0048 - 0x0040)
struct FRockVehicleAbilityInContinuous_Flip final : public FRockVehicleAbilityInContinuous
{
public:
	bool                                          bWheelsOnGround;                                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.GroundTrailsData
// 0x0010 (0x0010 - 0x0000)
struct FGroundTrailsData final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UNiagaraSystem*                         NiagaraFX;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.GroundTrailsMap
// 0x0018 (0x0018 - 0x0000)
struct FGroundTrailsMap final
{
public:
	class UNiagaraSystem*                         DefaultTrails;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGroundTrailsData>              GroundTrails;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityInPersistent_Jump
// 0x0010 (0x0018 - 0x0008)
struct FRockVehicleAbilityInPersistent_Jump final : public FRockVehicleAbilityInPersistent
{
public:
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityOutContinuous
// 0x0001 (0x0001 - 0x0000)
struct FRockVehicleAbilityOutContinuous final
{
public:
	bool                                          bShouldStayActive;                                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleAbilityOutPersistent
// 0x0004 (0x0004 - 0x0000)
struct FRockVehicleAbilityOutPersistent final
{
public:
	float                                         ActiveSeconds;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehileAbilityInContinous_StickyWheels
// 0x0020 (0x0060 - 0x0040)
struct FRockVehileAbilityInContinous_StickyWheels final : public FRockVehicleAbilityInContinuous
{
public:
	struct FVector                                ContactNormal;                                     // 0x0040(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0058(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyWheelsOnGround;                                // 0x005C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleAnalyticsSession
// 0x0028 (0x0028 - 0x0000)
struct FRockVehicleAnalyticsSession final
{
public:
	class AFortPlayerController*                  DriverPC;                                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockVehicleWheelAnimInfo
// 0x0014 (0x0014 - 0x0000)
struct FRockVehicleWheelAnimInfo final
{
public:
	float                                         SpringToWheelOffsetZ;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         SpringTravelRange;                                 // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRadius;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct RockVehicleRuntime.RockCameraSettings
// 0x001C (0x001C - 0x0000)
struct FRockCameraSettings final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         pitch;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwivelSpeed;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionSpeed;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockThrottledValue
// 0x0008 (0x0008 - 0x0000)
struct FRockThrottledValue final
{
public:
	float                                         RiseRate;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallRate;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleDriveConfig
// 0x0510 (0x0510 - 0x0000)
struct FRockVehicleDriveConfig final
{
public:
	struct FRockScalableFloat                     DriveAccel;                                        // 0x0000(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     DriveTopSpeed;                                     // 0x0030(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     BrakeAccel;                                        // 0x0060(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     StopSpeed;                                         // 0x0090(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         IdleBrakeFactor;                                   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRuntimeFloatCurve                     DriveAccelCurve;                                   // 0x00C8(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     SteerAngleCurve;                                   // 0x0150(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     LatFrictionCurve;                                  // 0x01D8(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     LongFrictionCurve;                                 // 0x0260(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WallFrictionCurve;                                 // 0x02E8(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HandbrakeSteerAngleCurve;                          // 0x0370(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HandbrakeLatFrictionCurve;                         // 0x03F8(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HandbrakeLongFrictionCurve;                        // 0x0480(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockThrottledValue                    HandbrakeRate;                                     // 0x0508(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleSuspensionConfig
// 0x0020 (0x0020 - 0x0000)
struct FRockVehicleSuspensionConfig final
{
public:
	float                                         MaxRaise;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDrop;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingCompression;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRelaxation;                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RockDampingCompression;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RockDampingRelaxation;                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleAxleConfig
// 0x0034 (0x0034 - 0x0000)
struct FRockVehicleAxleConfig final
{
public:
	float                                         TranslateX;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TranslateY;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TranslateZ;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRadius;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RestDistanceZ;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRockVehicleSuspensionConfig           Suspension;                                        // 0x0014(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct RockVehicleRuntime.RockVehicleDemoConfig
// 0x0028 (0x0028 - 0x0000)
struct FRockVehicleDemoConfig final
{
public:
	struct FGameplayTagContainer                  VehiclesThatCanBeDemolished;                       // 0x0000(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         DemolishAngleYaw;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DemolishAnglePitch;                                // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

