#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RopeAndChainsRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RopeAndChainsRuntime.FortPhysicsChainConstraint.DestroyAttachPoint
// 0x0008 (0x0008 - 0x0000)
struct FortPhysicsChainConstraint_DestroyAttachPoint final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainConstraint.DestroyAttachPointConstraint
// 0x0001 (0x0001 - 0x0000)
struct FortPhysicsChainConstraint_DestroyAttachPointConstraint final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainConstraint.DestroyAttachPointConstraintForComponent
// 0x0008 (0x0008 - 0x0000)
struct FortPhysicsChainConstraint_DestroyAttachPointConstraintForComponent final
{
public:
	class UPrimitiveComponent*                    DamagedComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainConstraint.DestroyBuildingPoint
// 0x0060 (0x0060 - 0x0000)
struct FortPhysicsChainConstraint_DestroyBuildingPoint final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainConstraint.DestroyGCBuildingPoint
// 0x0078 (0x0078 - 0x0000)
struct FortPhysicsChainConstraint_DestroyGCBuildingPoint final
{
public:
	struct FChaosBreakEvent                       BreakEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainConstraint.LandscapeCheck
// 0x0001 (0x0001 - 0x0000)
struct FortPhysicsChainConstraint_LandscapeCheck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainConstraint.OnPhysicsStateChange
// 0x0010 (0x0010 - 0x0000)
struct FortPhysicsChainConstraint_OnPhysicsStateChange final
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentPhysicsStateChange                  StateChange;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function RopeAndChainsRuntime.FortPhysicsChainWeaponComponent.EstablishChainConnectionPoint
// 0x0040 (0x0040 - 0x0000)
struct FortPhysicsChainWeaponComponent_EstablishChainConnectionPoint final
{
public:
	class UPrimitiveComponent*                    RootPoint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    GCComponent;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AttachPosition;                                    // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AttachPointNormal;                                 // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainWeaponComponent.GetChainConnectionPoint
// 0x0018 (0x0018 - 0x0000)
struct FortPhysicsChainWeaponComponent_GetChainConnectionPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainWeaponComponent.GetChainLinkMeshLength
// 0x0004 (0x0004 - 0x0000)
struct FortPhysicsChainWeaponComponent_GetChainLinkMeshLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainWeaponComponent.GetCreateChainBool
// 0x0001 (0x0001 - 0x0000)
struct FortPhysicsChainWeaponComponent_GetCreateChainBool final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainWeaponComponent.GetMaxChainLength
// 0x0004 (0x0004 - 0x0000)
struct FortPhysicsChainWeaponComponent_GetMaxChainLength final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RopeAndChainsRuntime.FortPhysicsChainWeaponComponent.SetCreateChainBool
// 0x0001 (0x0001 - 0x0000)
struct FortPhysicsChainWeaponComponent_SetCreateChainBool final
{
public:
	bool                                          bSetCreateChain;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

