#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RufusRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RufusRuntime.FortPOIInjector.FortPlayerControllerEndingPlay
// 0x0010 (0x0010 - 0x0000)
struct FortPOIInjector_FortPlayerControllerEndingPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function RufusRuntime.FortPOIInjector.HandleActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortPOIInjector_HandleActorSpawned final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RufusRuntime.FortPOIInjector.HandleControllerComponentAttached
// 0x0010 (0x0010 - 0x0000)
struct FortPOIInjector_HandleControllerComponentAttached final
{
public:
	class AFortPlayerController*                  FortPlayerController;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortControllerComponent*               ControllerComponent;                               // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RufusRuntime.RufusWeeklyMapUpdater.OverrideDiscoverabilityTexture
// 0x0008 (0x0008 - 0x0000)
struct RufusWeeklyMapUpdater_OverrideDiscoverabilityTexture final
{
public:
	class UMaterialInstanceDynamic*               InStencilMID;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RufusRuntime.RufusWeeklyMapUpdater.SetActiveWeekByIndex
// 0x0004 (0x0004 - 0x0000)
struct RufusWeeklyMapUpdater_SetActiveWeekByIndex final
{
public:
	int32                                         InWeekIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

