#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RufusRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "RufusRuntime_structs.hpp"


namespace SDK
{

// Class RufusRuntime.FortPOIInjector
// 0x0038 (0x02C8 - 0x0290)
class AFortPOIInjector final : public AActor
{
public:
	uint8                                         Pad_290[0x20];                                     // 0x0290(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class UDataTable*                             ChallengeMapPoiDataToAdd;                          // 0x02B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bStartPOIsDiscovered;                              // 0x02B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNullifyPOIQuestReferences;                        // 0x02B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bWaitForCanRecordPlayerVisits;                     // 0x02BA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     StencilMaterialToUse;                              // 0x02C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void FortPlayerControllerEndingPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void HandleActorSpawned(class AActor* SpawnedActor);
	void HandleControllerComponentAttached(class AFortPlayerController* FortPlayerController, class UFortControllerComponent* ControllerComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPOIInjector">();
	}
	static class AFortPOIInjector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortPOIInjector>();
	}
};

// Class RufusRuntime.RufusWeeklyMapUpdater
// 0x0078 (0x0308 - 0x0290)
class ARufusWeeklyMapUpdater final : public AActor
{
public:
	uint8                                         Pad_290[0x60];                                     // 0x0290(0x0060)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FRufusWeeklyMapUpdaterInfo>     WeeklyMapTextureInfo;                              // 0x02F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     StencilMaterial;                                   // 0x0300(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OverrideDiscoverabilityTexture(class UMaterialInstanceDynamic* InStencilMID);
	void SetActiveWeekByIndex(int32 InWeekIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RufusWeeklyMapUpdater">();
	}
	static class ARufusWeeklyMapUpdater* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARufusWeeklyMapUpdater>();
	}
};

}

