#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: S_UI_Text

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "S_UI_Placement_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UI_Text.S_UI_Text
// 0x00C0 (0x00C0 - 0x0000)
struct FS_UI_Text final
{
public:
	struct FS_UI_Placement                        Placement_67_A94CBD4C4E96C298CF51F6B49895AE3D;     // 0x0000(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font_45_B587C32B43943172D2272F8558ACC8B2;          // 0x0040(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            Color_65_9CB9A5174FD065187E30878106948A3B;         // 0x0098(0x0014)(Edit, BlueprintVisible)
	ETextTransformPolicy                          TransformPolicy_49_52395AC7440E291527A8768E37D08B2A; // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justification_52_5897D4F946C704E9C5D67E9DD207EF16; // 0x00AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        LineHeightPercentage_55_2509C2B04F6144283C7BADBF36AAA8F6; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoWrapText_58_064D5C3A4DD3D362216942A761DDC8D0;  // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         WrapTextAt_68_39091237442DEAE1CAFAE3AB75A757F1;    // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

