#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: S_UI_Backplate

#include "Basic.hpp"

#include "S_UI_Placement_structs.hpp"
#include "E_UI_BackplateBrightness_structs.hpp"
#include "E_UI_BackplateCornerRadius_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UI_Backplate.S_UI_Backplate
// 0x0050 (0x0050 - 0x0000)
struct FS_UI_Backplate final
{
public:
	struct FS_UI_Placement                        Placement_84_BB10D20A41D92A25F6912CB8B8544AD0;     // 0x0000(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateBrightness                      Brightness_85_A94CBD4C4E96C298CF51F6B49895AE3D;    // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    CornerRadius_86_3E7C183E49CE6543B65BBEB8E5C3DEF9;  // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        Blur_81_7A7C63B046ADDD7A04B8F3AB7F3C30C4;          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

