#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SequencerScripting

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SequencerScripting_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SequencerScripting.MovieSceneScriptingKey
// 0x0018 (0x0040 - 0x0028)
class UMovieSceneScriptingKey : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingKey">();
	}
	static class UMovieSceneScriptingKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingActorReferenceKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingActorReferenceKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(const struct FMovieSceneObjectBindingID& InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	struct FMovieSceneObjectBindingID GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingActorReferenceKey">();
	}
	static class UMovieSceneScriptingActorReferenceKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActorReferenceKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingChannel
// 0x0008 (0x0030 - 0x0028)
class UMovieSceneScriptingChannel : public UObject
{
public:
	class FName                                   ChannelName;                                       // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingChannel">();
	}
	static class UMovieSceneScriptingChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingActorReferenceChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingActorReferenceChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingActorReferenceKey* AddKey(const struct FFrameNumber& InTime, const struct FMovieSceneObjectBindingID& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(const struct FMovieSceneObjectBindingID& InDefaultValue);

	struct FMovieSceneObjectBindingID GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingActorReferenceChannel">();
	}
	static class UMovieSceneScriptingActorReferenceChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActorReferenceChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingBoolKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingBoolKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(bool InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	bool GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingBoolKey">();
	}
	static class UMovieSceneScriptingBoolKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingBoolKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingBoolChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingBoolChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingBoolKey* AddKey(const struct FFrameNumber& InTime, bool NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(bool InDefaultValue);

	struct FSequencerScriptingRange ComputeEffectiveRange() const;
	TArray<bool> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const;
	bool GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	int32 GetNumKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingBoolChannel">();
	}
	static class UMovieSceneScriptingBoolChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingBoolChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingByteKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingByteKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(uint8 InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	uint8 GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingByteKey">();
	}
	static class UMovieSceneScriptingByteKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingByteKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingByteChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingByteChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingByteKey* AddKey(const struct FFrameNumber& InTime, uint8 NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(uint8 InDefaultValue);

	uint8 GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingByteChannel">();
	}
	static class UMovieSceneScriptingByteChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingByteChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingDoubleKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingDoubleKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetArriveTangent(float InNewValue);
	void SetArriveTangentWeight(float InNewValue);
	void SetInterpolationMode(ERichCurveInterpMode InNewValue);
	void SetLeaveTangent(float InNewValue);
	void SetLeaveTangentWeight(float InNewValue);
	void SetTangentMode(ERichCurveTangentMode InNewValue);
	void SetTangentWeightMode(ERichCurveTangentWeightMode InNewValue);
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(double InNewValue);

	float GetArriveTangent() const;
	float GetArriveTangentWeight() const;
	ERichCurveInterpMode GetInterpolationMode() const;
	float GetLeaveTangent() const;
	float GetLeaveTangentWeight() const;
	ERichCurveTangentMode GetTangentMode() const;
	ERichCurveTangentWeightMode GetTangentWeightMode() const;
	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	double GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleKey">();
	}
	static class UMovieSceneScriptingDoubleKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingDoubleChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingDoubleChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingDoubleKey* AddKey(const struct FFrameNumber& InTime, double NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(double InDefaultValue);
	void SetPostInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);
	void SetPreInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);

	struct FSequencerScriptingRange ComputeEffectiveRange() const;
	TArray<double> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const;
	double GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	int32 GetNumKeys() const;
	ERichCurveExtrapolation GetPostInfinityExtrapolation() const;
	ERichCurveExtrapolation GetPreInfinityExtrapolation() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleChannel">();
	}
	static class UMovieSceneScriptingDoubleChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingEventKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingEventKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(const struct FMovieSceneEvent& InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	struct FMovieSceneEvent GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingEventKey">();
	}
	static class UMovieSceneScriptingEventKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingEventKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingEventChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingEventChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingEventKey* AddKey(const struct FFrameNumber& InTime, const struct FMovieSceneEvent& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveKey(class UMovieSceneScriptingKey* Key);

	TArray<class UMovieSceneScriptingKey*> GetKeys() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingEventChannel">();
	}
	static class UMovieSceneScriptingEventChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingEventChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingFloatKey
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneScriptingFloatKey : public UMovieSceneScriptingKey
{
public:
	void SetArriveTangent(float InNewValue);
	void SetArriveTangentWeight(float InNewValue);
	void SetInterpolationMode(ERichCurveInterpMode InNewValue);
	void SetLeaveTangent(float InNewValue);
	void SetLeaveTangentWeight(float InNewValue);
	void SetTangentMode(ERichCurveTangentMode InNewValue);
	void SetTangentWeightMode(ERichCurveTangentWeightMode InNewValue);
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(float InNewValue);

	float GetArriveTangent() const;
	float GetArriveTangentWeight() const;
	ERichCurveInterpMode GetInterpolationMode() const;
	float GetLeaveTangent() const;
	float GetLeaveTangentWeight() const;
	ERichCurveTangentMode GetTangentMode() const;
	ERichCurveTangentWeightMode GetTangentWeightMode() const;
	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingFloatKey">();
	}
	static class UMovieSceneScriptingFloatKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingFloatKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingActualFloatKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingActualFloatKey final : public UMovieSceneScriptingFloatKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingActualFloatKey">();
	}
	static class UMovieSceneScriptingActualFloatKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActualFloatKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingDoubleAsFloatKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingDoubleAsFloatKey final : public UMovieSceneScriptingFloatKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleAsFloatKey">();
	}
	static class UMovieSceneScriptingDoubleAsFloatKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleAsFloatKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingFloatChannel
// 0x0040 (0x0070 - 0x0030)
class UMovieSceneScriptingFloatChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingFloatKey* AddKey(const struct FFrameNumber& InTime, float NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(float InDefaultValue);
	void SetPostInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);
	void SetPreInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);

	struct FSequencerScriptingRange ComputeEffectiveRange() const;
	TArray<float> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const;
	float GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	int32 GetNumKeys() const;
	ERichCurveExtrapolation GetPostInfinityExtrapolation() const;
	ERichCurveExtrapolation GetPreInfinityExtrapolation() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingFloatChannel">();
	}
	static class UMovieSceneScriptingFloatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingFloatChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingIntegerKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingIntegerKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(int32 InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	int32 GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingIntegerKey">();
	}
	static class UMovieSceneScriptingIntegerKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingIntegerKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingIntegerChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingIntegerChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingIntegerKey* AddKey(const struct FFrameNumber& InTime, int32 NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(int32 InDefaultValue);

	int32 GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingIntegerChannel">();
	}
	static class UMovieSceneScriptingIntegerChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingIntegerChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingObjectPathKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingObjectPathKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(class UObject* InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	class UObject* GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingObjectPathKey">();
	}
	static class UMovieSceneScriptingObjectPathKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingObjectPathKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingObjectPathChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingObjectPathChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingObjectPathKey* AddKey(const struct FFrameNumber& InTime, class UObject* NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(class UObject* InDefaultValue);

	class UObject* GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingObjectPathChannel">();
	}
	static class UMovieSceneScriptingObjectPathChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingObjectPathChannel>();
	}
};

// Class SequencerScripting.MovieSceneScriptingStringKey
// 0x0018 (0x0058 - 0x0040)
class UMovieSceneScriptingStringKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(const class FString& InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	class FString GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingStringKey">();
	}
	static class UMovieSceneScriptingStringKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingStringKey>();
	}
};

// Class SequencerScripting.MovieSceneScriptingStringChannel
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneScriptingStringChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UMovieSceneScriptingStringKey* AddKey(const struct FFrameNumber& InTime, const class FString& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(const class FString& InDefaultValue);

	class FString GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingStringChannel">();
	}
	static class UMovieSceneScriptingStringChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingStringChannel>();
	}
};

// Class SequencerScripting.MovieSceneBindingExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneBindingExtensions final : public UBlueprintFunctionLibrary
