#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ShowdownRegionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownRegionButton.ShowdownRegionButton_C
// 0x0030 (0x1560 - 0x1530)
class UShowdownRegionButton_C final : public UFortShowdownRegionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Bounce;                                       // 0x1538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x1540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered_Transition;                           // 0x1548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonBackground_CTA_C*      Background;                                        // 0x1550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ShowdownRegionButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnReleased();
	void BP_OnPressed();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownRegionButton_C">();
	}
	static class UShowdownRegionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownRegionButton_C>();
	}
};

}

