#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SidebarVRRVoiceChatDeactivated

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.UpdateText
// 0x0060 (0x0060 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_UpdateText final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Description;                                       // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ButtonText;                                        // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ButtonSecText;                                     // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.ExecuteUbergraph_SidebarVRRVoiceChatDeactivated
// 0x0078 (0x0078 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Title;                                // 0x0018(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Description;                          // 0x0030(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ButtonText;                           // 0x0048(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ButtonSecText;                        // 0x0060(0x0018)(ConstParm)
};

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}

