#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SidebarLfgState_Image

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.SetMaterial
// 0x0028 (0x0028 - 0x0000)
struct SidebarLfgState_Image_C_SetMaterial final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      SoftMaterial;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.SetColor
// 0x0010 (0x0010 - 0x0000)
struct SidebarLfgState_Image_C_SetColor final
{
public:
	struct FLinearColor                           InColorAndOpacity;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SidebarLfgState_Image_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.ExecuteUbergraph_SidebarLfgState_Image
// 0x0008 (0x0008 - 0x0000)
struct SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

