#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SidebarSocialTagCategoryStructure

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct SidebarSocialTagCategoryStructure.SidebarSocialTagCategoryStructure
// 0x0070 (0x0070 - 0x0000)
struct FSidebarSocialTagCategoryStructure final
{
public:
	struct FLinearColor                           TagSkewBoxInnerColor_48_C74E0AB74864DE4E29C3AEBA2ECC7DA4; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagSkewBoxInnerColorHovered_42_7C212CFC4A6078EEE7C986B14E3FEB49; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagSkewBoxInnerColorSelected_45_E34FF8A8455FE97079F6B0A6A31A05AB; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagSkewBoxOuterColor_41_98DDEF0940105128E6C274B11D3A3D5D; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagSkewBoxOuterColorSelected_47_9B952DE4402DE9AFF112F2A20DC4F48C; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      TagCategoryIconMaterial_7_8991D63341121885D70AE09CB10AE389; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TagCategoryBaseColor_19_47DC015C4160F77A7C6E66AEEA302F6A; // 0x0058(0x0014)(Edit, BlueprintVisible)
};

}

