#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SidewaysCodeUI

#include "Basic.hpp"

#include "SidewaysCodeRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SidewaysCodeUI.SidewaysWidgetBase.ConfigureUIFromPlayspace
// 0x0008 (0x0008 - 0x0000)
struct SidewaysWidgetBase_ConfigureUIFromPlayspace final
{
public:
	class ASidewaysPlayspace*                     Playspace;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SidewaysCodeUI.SidewaysWidgetBase.HandleFortPawnChanged
// 0x0008 (0x0008 - 0x0000)
struct SidewaysWidgetBase_HandleFortPawnChanged final
{
public:
	class AFortPawn*                              PossessedPawn;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SidewaysCodeUI.SidewaysWidgetBase.OnEnterSideways
// 0x0008 (0x0008 - 0x0000)
struct SidewaysWidgetBase_OnEnterSideways final
{
public:
	class ASidewaysPlayspace*                     Playspace;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SidewaysCodeUI.SidewaysWidgetBase.OnParamUpdated
// 0x0004 (0x0004 - 0x0000)
struct SidewaysWidgetBase_OnParamUpdated final
{
public:
	struct FGameplayTag                           UpdatedParam;                                      // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SidewaysCodeUI.SidewaysWidgetBase.OnSidewaysStateChanged
// 0x0018 (0x0018 - 0x0000)
struct SidewaysWidgetBase_OnSidewaysStateChanged final
{
public:
	class USidewaysStateComponent*                SidewaysStateComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASidewaysPlayspace*                     NewPlayspace;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESidewaysState                                OldState;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESidewaysState                                NewState;                                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function SidewaysCodeUI.SidewaysWidgetBase.IsValidPlayspace
// 0x0010 (0x0010 - 0x0000)
struct SidewaysWidgetBase_IsValidPlayspace final
{
public:
	class ASidewaysPlayspace*                     Playspace;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

