#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SidebarProfileSubPanelRebootRallyEligible

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarProfileSubPanelRebootRallyEligible.SidebarProfileSubPanelRebootRallyEligible_C.ExecuteUbergraph_SidebarProfileSubPanelRebootRallyEligible
// 0x0020 (0x0020 - 0x0000)
struct SidebarProfileSubPanelRebootRallyEligible_C_ExecuteUbergraph_SidebarProfileSubPanelRebootRallyEligible final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRallied;                             // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalUser_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select_Default;                             // 0x0008(0x0018)(ConstParm)
};

// Function SidebarProfileSubPanelRebootRallyEligible.SidebarProfileSubPanelRebootRallyEligible_C.DisplayText
// 0x0001 (0x0001 - 0x0000)
struct SidebarProfileSubPanelRebootRallyEligible_C_DisplayText final
{
public:
	bool                                          bRallied;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

