#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SlateCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SlateCore.EFontRasterizationMode
// NumValues: 0x0003
enum class EFontRasterizationMode : uint8
{
	Bitmap                                   = 0,
	Msdf                                     = 1,
	EFontRasterizationMode_MAX               = 2,
};

// Enum SlateCore.EUINavigationRule
// NumValues: 0x0008
enum class EUINavigationRule : uint8
{
	Escape                                   = 0,
	Explicit                                 = 1,
	Wrap                                     = 2,
	Stop                                     = 3,
	Custom                                   = 4,
	CustomBoundary                           = 5,
	Invalid                                  = 6,
	EUINavigationRule_MAX                    = 7,
};

// Enum SlateCore.EColorVisionDeficiency
// NumValues: 0x0005
enum class EColorVisionDeficiency : uint8
{
	NormalVision                             = 0,
	Deuteranope                              = 1,
	Protanope                                = 2,
	Tritanope                                = 3,
	EColorVisionDeficiency_MAX               = 4,
};

// Enum SlateCore.EButtonClickMethod
// NumValues: 0x0005
enum class EButtonClickMethod : uint8
{
	DownAndUp                                = 0,
	MouseDown                                = 1,
	MouseUp                                  = 2,
	PreciseClick                             = 3,
	EButtonClickMethod_MAX                   = 4,
};

// Enum SlateCore.EButtonTouchMethod
// NumValues: 0x0004
enum class EButtonTouchMethod : uint8
{
	DownAndUp                                = 0,
	Down                                     = 1,
	PreciseTap                               = 2,
	EButtonTouchMethod_MAX                   = 3,
};

// Enum SlateCore.EButtonPressMethod
// NumValues: 0x0004
enum class EButtonPressMethod : uint8
{
	DownAndUp                                = 0,
	ButtonPress                              = 1,
	ButtonRelease                            = 2,
	EButtonPressMethod_MAX                   = 3,
};

// Enum SlateCore.EUINavigation
// NumValues: 0x0009
enum class EUINavigation : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Up                                       = 2,
	Down                                     = 3,
	Next                                     = 4,
	Previous                                 = 5,
	Num                                      = 6,
	Invalid                                  = 7,
	EUINavigation_MAX                        = 8,
};

// Enum SlateCore.EUINavigationAction
// NumValues: 0x0005
enum class EUINavigationAction : uint8
{
	Accept                                   = 0,
	Back                                     = 1,
	Num                                      = 2,
	Invalid                                  = 3,
	EUINavigationAction_MAX                  = 4,
};

// Enum SlateCore.ENavigationSource
// NumValues: 0x0003
enum class ENavigationSource : uint8
{
	FocusedWidget                            = 0,
	WidgetUnderCursor                        = 1,
	ENavigationSource_MAX                    = 2,
};

// Enum SlateCore.ENavigationGenesis
// NumValues: 0x0004
enum class ENavigationGenesis : uint8
{
	Keyboard                                 = 0,
	Controller                               = 1,
	User                                     = 2,
	ENavigationGenesis_MAX                   = 3,
};

// Enum SlateCore.EHorizontalAlignment
// NumValues: 0x0005
enum class EHorizontalAlignment : uint8
{
	HAlign_Fill                              = 0,
	HAlign_Left                              = 1,
	HAlign_Center                            = 2,
	HAlign_Right                             = 3,
	HAlign_MAX                               = 4,
};

// Enum SlateCore.EVerticalAlignment
// NumValues: 0x0005
enum class EVerticalAlignment : uint8
{
	VAlign_Fill                              = 0,
	VAlign_Top                               = 1,
	VAlign_Center                            = 2,
	VAlign_Bottom                            = 3,
	VAlign_MAX                               = 4,
};

// Enum SlateCore.EMenuPlacement
// NumValues: 0x000E
enum class EMenuPlacement : uint8
{
	MenuPlacement_BelowAnchor                = 0,
	MenuPlacement_CenteredBelowAnchor        = 1,
	MenuPlacement_BelowRightAnchor           = 2,
	MenuPlacement_ComboBox                   = 3,
	MenuPlacement_ComboBoxRight              = 4,
	MenuPlacement_MenuRight                  = 5,
	MenuPlacement_AboveAnchor                = 6,
	MenuPlacement_CenteredAboveAnchor        = 7,
	MenuPlacement_AboveRightAnchor           = 8,
	MenuPlacement_MenuLeft                   = 9,
	MenuPlacement_Center                     = 10,
	MenuPlacement_RightLeftCenter            = 11,
	MenuPlacement_MatchBottomLeft            = 12,
	MenuPlacement_MAX                        = 13,
};

// Enum SlateCore.EOrientation
// NumValues: 0x0003
enum class EOrientation : uint8
{
	Orient_Horizontal                        = 0,
	Orient_Vertical                          = 1,
	Orient_MAX                               = 2,
};

// Enum SlateCore.EScrollDirection
// NumValues: 0x0003
enum class EScrollDirection : uint8
{
	Scroll_Down                              = 0,
	Scroll_Up                                = 1,
	Scroll_MAX                               = 2,
};

// Enum SlateCore.ETextCommit
// NumValues: 0x0005
enum class ETextCommit : uint8
{
	Default                                  = 0,
	OnEnter                                  = 1,
	OnUserMovedFocus                         = 2,
	OnCleared                                = 3,
	ETextCommit_MAX                          = 4,
};

// Enum SlateCore.ESelectInfo
// NumValues: 0x0005
enum class ESelectInfo : uint8
{
	OnKeyPress                               = 0,
	OnNavigation                             = 1,
	OnMouseClick                             = 2,
	Direct                                   = 3,
	ESelectInfo_MAX                          = 4,
};

// Enum SlateCore.EWidgetPixelSnapping
// NumValues: 0x0004
enum class EWidgetPixelSnapping : uint8
{
	Inherit                                  = 0,
	Disabled                                 = 1,
	SnapToPixel                              = 2,
	EWidgetPixelSnapping_MAX                 = 3,
};

// Enum SlateCore.ESlateDebuggingInputEvent
// NumValues: 0x001B
enum class ESlateDebuggingInputEvent : uint8
{
	MouseMove                                = 0,
	MouseEnter                               = 1,
	MouseLeave                               = 2,
	PreviewMouseButtonDown                   = 3,
	MouseButtonDown                          = 4,
	MouseButtonUp                            = 5,
	MouseButtonDoubleClick                   = 6,
	MouseWheel                               = 7,
	TouchStart                               = 8,
	TouchEnd                                 = 9,
	TouchForceChanged                        = 10,
	TouchFirstMove                           = 11,
	TouchMoved                               = 12,
	DragDetected                             = 13,
	DragEnter                                = 14,
	DragLeave                                = 15,
	DragOver                                 = 16,
	DragDrop                                 = 17,
	DropMessage                              = 18,
	PreviewKeyDown                           = 19,
	KeyDown                                  = 20,
	KeyUp                                    = 21,
	KeyChar                                  = 22,
	AnalogInput                              = 23,
	TouchGesture                             = 24,
	MotionDetected                           = 25,
	MAX                                      = 26,
};

// Enum SlateCore.ESlateDebuggingStateChangeEvent
// NumValues: 0x0003
enum class ESlateDebuggingStateChangeEvent : uint8
{
	MouseCaptureGained                       = 0,
	MouseCaptureLost                         = 1,
	ESlateDebuggingStateChangeEvent_MAX      = 2,
};

// Enum SlateCore.ESlateDebuggingNavigationMethod
// NumValues: 0x0007
enum class ESlateDebuggingNavigationMethod : uint8
{
	Unknown                                  = 0,
	Explicit                                 = 1,
	CustomDelegateBound                      = 2,
	CustomDelegateUnbound                    = 3,
	NextOrPrevious                           = 4,
	HitTestGrid                              = 5,
	ESlateDebuggingNavigationMethod_MAX      = 6,
};

// Enum SlateCore.ESlateDebuggingFocusEvent
// NumValues: 0x0004
enum class ESlateDebuggingFocusEvent : uint8
{
	FocusChanging                            = 0,
	FocusLost                                = 1,
	FocusReceived                            = 2,
	MAX                                      = 3,
};

// Enum SlateCore.EFontHinting
// NumValues: 0x0006
enum class EFontHinting : uint8
{
	Default                                  = 0,
	Auto                                     = 1,
	AutoLight                                = 2,
	Monochrome                               = 3,
	None                                     = 4,
	EFontHinting_MAX                         = 5,
};

// Enum SlateCore.EFontLoadingPolicy
// NumValues: 0x0004
enum class EFontLoadingPolicy : uint8
{
	LazyLoad                                 = 0,
	Stream                                   = 1,
	Inline                                   = 2,
	EFontLoadingPolicy_MAX                   = 3,
};

// Enum SlateCore.EFontLayoutMethod
// NumValues: 0x0003
enum class EFontLayoutMethod : uint8
{
	Metrics                                  = 0,
	BoundingBox                              = 1,
	EFontLayoutMethod_MAX                    = 2,
};

// Enum SlateCore.ETextShapingMethod
// NumValues: 0x0004
enum class ETextShapingMethod : uint8
{
	Auto                                     = 0,
	KerningOnly                              = 1,
	FullShaping                              = 2,
	ETextShapingMethod_MAX                   = 3,
};

// Enum SlateCore.EFocusCause
// NumValues: 0x0007
enum class EFocusCause : uint8
{
	Mouse                                    = 0,
	Navigation                               = 1,
	SetDirectly                              = 2,
	Cleared                                  = 3,
	OtherWidgetLostFocus                     = 4,
	WindowActivate                           = 5,
	EFocusCause_MAX                          = 6,
};

// Enum SlateCore.EWidgetClipping
// NumValues: 0x0006
enum class EWidgetClipping : uint8
{
	Inherit                                  = 0,
	ClipToBounds                             = 1,
	ClipToBoundsWithoutIntersecting          = 2,
	ClipToBoundsAlways                       = 3,
	OnDemand                                 = 4,
	EWidgetClipping_MAX                      = 5,
};

// Enum SlateCore.EFlowDirectionPreference
// NumValues: 0x0005
enum class EFlowDirectionPreference : uint8
{
	Inherit                                  = 0,
	Culture                                  = 1,
	LeftToRight                              = 2,
	RightToLeft                              = 3,
	EFlowDirectionPreference_MAX             = 4,
};

// Enum SlateCore.ESlateBrushDrawType
// NumValues: 0x0006
enum class ESlateBrushDrawType : uint8
{
	NoDrawType                               = 0,
	Box                                      = 1,
	Border                                   = 2,
	Image                                    = 3,
	RoundedBox                               = 4,
	ESlateBrushDrawType_MAX                  = 5,
};

// Enum SlateCore.ESlateBrushTileType
// NumValues: 0x0005
enum class ESlateBrushTileType : uint8
{
	NoTile                                   = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
	ESlateBrushTileType_MAX                  = 4,
};

// Enum SlateCore.ESlateBrushMirrorType
// NumValues: 0x0005
enum class ESlateBrushMirrorType : uint8
{
	NoMirror                                 = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
	ESlateBrushMirrorType_MAX                = 4,
};

// Enum SlateCore.ESlateBrushImageType
// NumValues: 0x0005
enum class ESlateBrushImageType : uint8
{
	NoImage                                  = 0,
	FullColor                                = 1,
	Linear                                   = 2,
	Vector                                   = 3,
	ESlateBrushImageType_MAX                 = 4,
};

// Enum SlateCore.ESlateBrushRoundingType
// NumValues: 0x0003
enum class ESlateBrushRoundingType : uint8
{
	FixedRadius                              = 0,
	HalfHeightRadius                         = 1,
	ESlateBrushRoundingType_MAX              = 2,
};

// Enum SlateCore.ESlateColorStylingMode
// NumValues: 0x0006
enum class ESlateColorStylingMode : uint8
{
	UseColor_Specified                       = 0,
	UseColor_ColorTable                      = 1,
	UseColor_Foreground                      = 2,
	UseColor_Foreground_Subdued              = 3,
	UseColor_UseStyle                        = 4,
	UseColor_MAX                             = 5,
};

// Enum SlateCore.EConsumeMouseWheel
// NumValues: 0x0004
enum class EConsumeMouseWheel : uint8
{
	WhenScrollingPossible                    = 0,
	Always                                   = 1,
	Never                                    = 2,
	EConsumeMouseWheel_MAX                   = 3,
};

// Enum SlateCore.ESlateParentWindowSearchMethod
// NumValues: 0x0003
enum class ESlateParentWindowSearchMethod : uint8
{
	ActiveWindow                             = 0,
	MainWindow                               = 1,
	ESlateParentWindowSearchMethod_MAX       = 2,
};

// Enum SlateCore.ESlateCheckBoxType
// NumValues: 0x0003
enum class ESlateCheckBoxType : uint8
{
	CheckBox                                 = 0,
	ToggleButton                             = 1,
	ESlateCheckBoxType_MAX                   = 2,
};

// Enum SlateCore.ECheckBoxState
// NumValues: 0x0004
enum class ECheckBoxState : uint8
{
	Unchecked                                = 0,
	Checked                                  = 1,
	Undetermined                             = 2,
	ECheckBoxState_MAX                       = 3,
};

// Enum SlateCore.ETextOverflowPolicy
// NumValues: 0x0003
enum class ETextOverflowPolicy : uint8
{
	Clip                                     = 0,
	Ellipsis                                 = 1,
	ETextOverflowPolicy_MAX                  = 2,
};

// Enum SlateCore.ETextTransformPolicy
// NumValues: 0x0004
enum class ETextTransformPolicy : uint8
{
	None                                     = 0,
	ToLower                                  = 1,
	ToUpper                                  = 2,
	ETextTransformPolicy_MAX                 = 3,
};

// Enum SlateCore.EStyleColor
// NumValues: 0x003E
enum class EStyleColor : uint8
{
	Black                                    = 0,
	Background                               = 1,
	Title                                    = 2,
	WindowBorder                             = 3,
	Foldout                                  = 4,
	Input                                    = 5,
	InputOutline                             = 6,
	Recessed                                 = 7,
	Panel                                    = 8,
	Header                                   = 9,
	Dropdown                                 = 10,
	DropdownOutline                          = 11,
	Hover                                    = 12,
	Hover2                                   = 13,
	White                                    = 14,
	White25                                  = 15,
	Highlight                                = 16,
	Primary                                  = 17,
	PrimaryHover                             = 18,
	PrimaryPress                             = 19,
	Secondary                                = 20,
	Foreground                               = 21,
	ForegroundHover                          = 22,
	ForegroundInverted                       = 23,
	ForegroundHeader                         = 24,
	Select                                   = 25,
	SelectInactive                           = 26,
	SelectParent                             = 27,
	SelectHover                              = 28,
	Notifications                            = 29,
	AccentBlue                               = 30,
	AccentPurple                             = 31,
	AccentPink                               = 32,
	AccentRed                                = 33,
	AccentOrange                             = 34,
	AccentYellow                             = 35,
	AccentGreen                              = 36,
	AccentBrown                              = 37,
	AccentBlack                              = 38,
	AccentGray                               = 39,
	AccentWhite                              = 40,
	AccentFolder                             = 41,
	Warning                                  = 42,
	Error                                    = 43,
	Success                                  = 44,
	User1                                    = 45,
	User2                                    = 46,
	User3                                    = 47,
	User4                                    = 48,
	User5                                    = 49,
	User6                                    = 50,
	User7                                    = 51,
	User8                                    = 52,
	User9                                    = 53,
	User10                                   = 54,
	User11                                   = 55,
	User12                                   = 56,
	User13                                   = 57,
	User14                                   = 58,
	User15                                   = 59,
	User16                                   = 60,
	MAX                                      = 61,
};

// ScriptStruct SlateCore.InputEvent
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FInputEvent
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.Geometry
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x04) FGeometry final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.DeprecateSlateVector2D
// 0x0000 (0x0008 - 0x0008)
struct FDeprecateSlateVector2D final : public FVector2f
{
};

// ScriptStruct SlateCore.Margin
// 0x0010 (0x0010 - 0x0000)
struct FMargin final
{
public:
	float                                         Left;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bottom;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.SlateColor
// 0x0014 (0x0014 - 0x0000)
struct FSlateColor final
{
public:
	struct FLinearColor                           SpecifiedColor;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateColorStylingMode                        ColorUseRule;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.SlateBrushOutlineSettings
// 0x0040 (0x0040 - 0x0000)
struct FSlateBrushOutlineSettings final
{
public:
	struct FVector4                               CornerRadii;                                       // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            Color;                                             // 0x0020(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushRoundingType                       RoundingType;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBrushTransparency;                             // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.SlateBrush
// 0x00C0 (0x00C0 - 0x0000)
struct FSlateBrush final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	uint8                                         bIsDynamicallyLoaded : 1;                          // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasUObject : 1;                                   // 0x0010(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	ESlateBrushDrawType                           DrawAs;                                            // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushTileType                           Tiling;                                            // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushMirrorType                         Mirroring;                                         // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushImageType                          ImageType;                                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDeprecateSlateVector2D                ImageSize;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Margin;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateColor                            TintColor;                                         // 0x0030(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrushOutlineSettings             OutlineSettings;                                   // 0x0050(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UObject*                                ResourceObject;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ResourceName;                                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox2f                                 UVRegion;                                          // 0x009C(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.SlateSound
// 0x0018 (0x0018 - 0x0000)
struct FSlateSound final
{
public:
	class UObject*                                ResourceObject;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.SlateWidgetStyle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSlateWidgetStyle
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.ButtonStyle
// 0x03A8 (0x03B0 - 0x0008)
struct FButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            Normal;                                            // 0x0010(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Hovered;                                           // 0x00D0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Pressed;                                           // 0x0190(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Disabled;                                          // 0x0250(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            NormalForeground;                                  // 0x0310(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            HoveredForeground;                                 // 0x0324(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            PressedForeground;                                 // 0x0338(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            DisabledForeground;                                // 0x034C(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FMargin                                NormalPadding;                                     // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                PressedPadding;                                    // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            PressedSlateSound;                                 // 0x0380(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            HoveredSlateSound;                                 // 0x0398(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.FontOutlineSettings
// 0x0020 (0x0020 - 0x0000)
struct FFontOutlineSettings final
{
public:
	int32                                         OutlineSize;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMiteredCorners;                                   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparateFillAlpha;                                // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyOutlineToDropShadows;                        // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                OutlineMaterial;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutlineColor;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.SlateFontInfo
// 0x0058 (0x0058 - 0x0000)
struct FSlateFontInfo final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                FontMaterial;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFontOutlineSettings                   OutlineSettings;                                   // 0x0010(0x0020)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   TypefaceFontName;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LetterSpacing;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkewAmount;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x1];                                       // 0x0050(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bForceMonospaced;                                  // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MonospacedWidth;                                   // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.TextBlockStyle
// 0x0308 (0x0310 - 0x0008)
struct FTextBlockStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0008(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ColorAndOpacity;                                   // 0x0060(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDeprecateSlateVector2D                ShadowOffset;                                      // 0x0074(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x007C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            SelectedBackgroundColor;                           // 0x008C(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            HighlightColor;                                    // 0x00A0(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            HighlightShape;                                    // 0x00C0(0x00C0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StrikeBrush;                                       // 0x0180(0x00C0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UnderlineBrush;                                    // 0x0240(0x00C0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          TransformPolicy;                                   // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextOverflowPolicy                           OverflowPolicy;                                    // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_302[0xE];                                      // 0x0302(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.DockTabStyle
// 0x0C98 (0x0CA0 - 0x0008)
struct FDockTabStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FButtonStyle                           CloseButtonStyle;                                  // 0x0010(0x03B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NormalBrush;                                       // 0x03C0(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ColorOverlayTabBrush;                              // 0x0480(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ColorOverlayIconBrush;                             // 0x0540(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ForegroundBrush;                                   // 0x0600(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HoveredBrush;                                      // 0x06C0(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ContentAreaBrush;                                  // 0x0780(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TabWellBrush;                                      // 0x0840(0x00C0)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TabTextStyle;                                      // 0x0900(0x0310)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                TabPadding;                                        // 0x0C10(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FDeprecateSlateVector2D                IconSize;                                          // 0x0C20(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverlapWidth;                                      // 0x0C28(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            FlashColor;                                        // 0x0C2C(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            NormalForegroundColor;                             // 0x0C40(0x0014)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            HoveredForegroundColor;                            // 0x0C54(0x0014)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            ActiveForegroundColor;                             // 0x0C68(0x0014)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundForegroundColor;                         // 0x0C7C(0x0014)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         IconBorderPadding;                                 // 0x0C90(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C94[0xC];                                      // 0x0C94(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.PointerEvent
// 0x0058 (0x0078 - 0x0020)
struct FPointerEvent final : public FInputEvent
{
public:
	uint8                                         Pad_20[0x58];                                      // 0x0020(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.CheckBoxStyle
// 0x0A08 (0x0A10 - 0x0008)
struct FCheckBoxStyle final : public FSlateWidgetStyle
{
public:
	ESlateCheckBoxType                            CheckBoxType;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            UncheckedImage;                                    // 0x0010(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UncheckedHoveredImage;                             // 0x00D0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UncheckedPressedImage;                             // 0x0190(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedImage;                                      // 0x0250(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedHoveredImage;                               // 0x0310(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedPressedImage;                               // 0x03D0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UndeterminedImage;                                 // 0x0490(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UndeterminedHoveredImage;                          // 0x0550(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UndeterminedPressedImage;                          // 0x0610(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x06D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImage;                                   // 0x06E0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundHoveredImage;                            // 0x07A0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundPressedImage;                            // 0x0860(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0920(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            HoveredForeground;                                 // 0x0934(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            PressedForeground;                                 // 0x0948(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            CheckedForeground;                                 // 0x095C(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            CheckedHoveredForeground;                          // 0x0970(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            CheckedPressedForeground;                          // 0x0984(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            UndeterminedForeground;                            // 0x0998(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            BorderBackgroundColor;                             // 0x09AC(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateSound                            CheckedSlateSound;                                 // 0x09C0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            UncheckedSlateSound;                               // 0x09D8(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            HoveredSlateSound;                                 // 0x09F0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A08[0x8];                                      // 0x0A08(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.ScrollBarStyle
// 0x06D8 (0x06E0 - 0x0008)
struct FScrollBarStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            HorizontalBackgroundImage;                         // 0x0010(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBackgroundImage;                           // 0x00D0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalTopSlotImage;                              // 0x0190(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalTopSlotImage;                            // 0x0250(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBottomSlotImage;                           // 0x0310(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalBottomSlotImage;                         // 0x03D0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NormalThumbImage;                                  // 0x0490(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HoveredThumbImage;                                 // 0x0550(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DraggedThumbImage;                                 // 0x0610(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x06D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D4[0xC];                                      // 0x06D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.TableRowStyle
// 0x0C48 (0x0C50 - 0x0008)
struct FTableRowStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            SelectorFocusedBrush;                              // 0x0010(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActiveHoveredBrush;                                // 0x00D0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActiveBrush;                                       // 0x0190(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            InactiveHoveredBrush;                              // 0x0250(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            InactiveBrush;                                     // 0x0310(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bUseParentRowBrush;                                // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D1[0xF];                                      // 0x03D1(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            ParentRowBackgroundBrush;                          // 0x03E0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ParentRowBackgroundHoveredBrush;                   // 0x04A0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EvenRowBackgroundHoveredBrush;                     // 0x0560(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EvenRowBackgroundBrush;                            // 0x0620(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OddRowBackgroundHoveredBrush;                      // 0x06E0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OddRowBackgroundBrush;                             // 0x07A0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            TextColor;                                         // 0x0860(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            SelectedTextColor;                                 // 0x0874(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_888[0x8];                                      // 0x0888(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            DropIndicator_Above;                               // 0x0890(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DropIndicator_Onto;                                // 0x0950(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DropIndicator_Below;                               // 0x0A10(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActiveHighlightedBrush;                            // 0x0AD0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            InactiveHighlightedBrush;                          // 0x0B90(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.FontData
// 0x0028 (0x0028 - 0x0000)
struct FFontData final
{
public:
	class FString                                 FontFilename;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	EFontHinting                                  Hinting;                                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFontLoadingPolicy                            LoadingPolicy;                                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SubFaceIndex;                                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                FontFaceAsset;                                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SlateCore.TypefaceEntry
// 0x0030 (0x0030 - 0x0000)
struct FTypefaceEntry final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFontData                              Font;                                              // 0x0008(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.Typeface
// 0x0010 (0x0010 - 0x0000)
struct FTypeface final
{
public:
	TArray<struct FTypefaceEntry>                 Fonts;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.CompositeFallbackFont
// 0x0018 (0x0018 - 0x0000)
struct FCompositeFallbackFont
{
public:
	struct FTypeface                              Typeface;                                          // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	float                                         ScalingFactor;                                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.ComboButtonStyle
// 0x0598 (0x05A0 - 0x0008)
struct FComboButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FButtonStyle                           ButtonStyle;                                       // 0x0010(0x03B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DownArrowImage;                                    // 0x03C0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDeprecateSlateVector2D                ShadowOffset;                                      // 0x0480(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            MenuBorderBrush;                                   // 0x04A0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                MenuBorderPadding;                                 // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ContentPadding;                                    // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                DownArrowPadding;                                  // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EVerticalAlignment                            DownArrowAlign;                                    // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0xF];                                      // 0x0591(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SlateCore.ComboBoxStyle
// 0x05F8 (0x0600 - 0x0008)
struct FComboBoxStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FComboButtonStyle                      ComboButtonStyle;                                  // 0x0010(0x05A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateSound                            PressedSlateSound;                                 // 0x05B0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            SelectionChangeSlateSound;                         // 0x05C8(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ContentPadding;                                    // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                MenuRowPadding;                                    // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SlateCore.EditableTextBoxStyle
// 0x0D78 (0x0D80 - 0x0008)
struct FEditableTextBoxStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            BackgroundImageNormal;                             // 0x0010(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageHovered;                            // 0x00D0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageFocused;                            // 0x0190(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageReadOnly;                           // 0x0250(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TextStyle;                                         // 0x0320(0x0310)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0630(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            BackgroundColor;                                   // 0x0644(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ReadOnlyForegroundColor;                           // 0x0658(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            FocusedForegroundColor;                            // 0x066C(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                HScrollBarPadding;                                 // 0x0680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
