#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct SocialUMG.SocialChatMessageEntryTextStyle
// 0x0068 (0x0068 - 0x0000)
struct FSocialChatMessageEntryTextStyle final
{
public:
	struct FSlateFontInfo                         FontInfo;                                          // 0x0000(0x0058)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialUMG.SocialChatMessageEntryStyle
// 0x0138 (0x0138 - 0x0000)
struct FSocialChatMessageEntryStyle final
{
public:
	struct FSocialChatMessageEntryTextStyle       SenderNameStyle;                                   // 0x0000(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       ChannelNameStyle;                                  // 0x0068(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       MessageTextStyle;                                  // 0x00D0(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

