#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SparksCommonRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct SparksCommonRuntime.SparksCommonAllPlayersReadyEvent
// 0x0001 (0x0001 - 0x0000)
struct FSparksCommonAllPlayersReadyEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SparksCommonRuntime.SparksCommonStartCameraEvent
// 0x0001 (0x0001 - 0x0000)
struct FSparksCommonStartCameraEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SparksCommonRuntime.SparksCommonCameraFinishedEvent
// 0x0001 (0x0001 - 0x0000)
struct FSparksCommonCameraFinishedEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SparksCommonRuntime.SparksCommonEnableCameraDirectorEvent
// 0x0001 (0x0001 - 0x0000)
struct FSparksCommonEnableCameraDirectorEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SparksCommonRuntime.SparksCommonCameraDirectorFinishedEvent
// 0x0001 (0x0001 - 0x0000)
struct FSparksCommonCameraDirectorFinishedEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SparksCommonRuntime.CrowdMemberToSpawn
// 0x0040 (0x0040 - 0x0000)
struct FCrowdMemberToSpawn final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UInstancedStaticMeshComponent*          Mesh;                                              // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

