#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SpatialMetrics

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetrics.ActorCountMetric
// 0x0060 (0x00A0 - 0x0040)
class UActorCountMetric final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorCountMetric">();
	}
	static class UActorCountMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorCountMetric>();
	}
};

// Class SpatialMetrics.ActorResourceSizeMetric
// 0x00E8 (0x0128 - 0x0040)
class UActorResourceSizeMetric final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0xE0];                                      // 0x0040(0x00E0)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         UpdateTimeThresholdInMs;                           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorResourceSizeMetric">();
	}
	static class UActorResourceSizeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorResourceSizeMetric>();
	}
};

// Class SpatialMetrics.ProxyMetric
// 0x0050 (0x0090 - 0x0040)
class UProxyMetric final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyMetric">();
	}
	static class UProxyMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyMetric>();
	}
};

}

