#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SpatialMetricsExperimental

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "SpatialMetricsExperimental_structs.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetricsExperimental.ActorPackageDependencyARDiskSizeMetric_Archive
// 0x02D8 (0x0318 - 0x0040)
class UActorPackageDependencyARDiskSizeMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x2D8];                                     // 0x0040(0x02D8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyARDiskSizeMetric_Archive">();
	}
	static class UActorPackageDependencyARDiskSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyARDiskSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyCountMetric_Archive
// 0x02D0 (0x0310 - 0x0040)
class UActorPackageDependencyCountMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x2D0];                                     // 0x0040(0x02D0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyCountMetric_Archive">();
	}
	static class UActorPackageDependencyCountMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyCountMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyIoDispatcherSizeMetric_Archive
// 0x02E0 (0x0320 - 0x0040)
class UActorPackageDependencyIoDispatcherSizeMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x2D8];                                     // 0x0040(0x02D8)(Fixing Size After Last Property [ Dumper-8 ])
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyIoDispatcherSizeMetric_Archive">();
	}
	static class UActorPackageDependencyIoDispatcherSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyIoDispatcherSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyResourceSizeMetric_Archive
// 0x02E0 (0x0320 - 0x0040)
class UActorPackageDependencyResourceSizeMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x2D8];                                     // 0x0040(0x02D8)(Fixing Size After Last Property [ Dumper-8 ])
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyResourceSizeMetric_Archive">();
	}
	static class UActorPackageDependencyResourceSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyResourceSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.LevelPackageDependencyIoDispatcherSizeMetric_IoStore
// 0x0360 (0x03A0 - 0x0040)
class ULevelPackageDependencyIoDispatcherSizeMetric_IoStore final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x358];                                     // 0x0040(0x0358)(Fixing Size After Last Property [ Dumper-8 ])
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelPackageDependencyIoDispatcherSizeMetric_IoStore">();
	}
	static class ULevelPackageDependencyIoDispatcherSizeMetric_IoStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelPackageDependencyIoDispatcherSizeMetric_IoStore>();
	}
};

}

