#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SpecialEventGameplayRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum SpecialEventGameplayRuntime.ESpecialEventTODMModifyType
// NumValues: 0x0009
enum class ESpecialEventTODMModifyType : uint8
{
	Keep                                     = 0,
	Hide                                     = 1,
	Show                                     = 2,
	Spawn                                    = 3,
	Persistent                               = 4,
	Destroy                                  = 5,
	DestroyAll                               = 6,
	DestroyAllButGameState                   = 7,
	ESpecialEventTODMModifyType_MAX          = 8,
};

// Enum SpecialEventGameplayRuntime.EDestroyActorsAndComponentsMutator_ComponentNameComparisonType
// NumValues: 0x0007
enum class EDestroyActorsAndComponentsMutator_ComponentNameComparisonType : uint8
{
	NameEquals                               = 0,
	NameStartsWith                           = 1,
	NameContains                             = 2,
	AdditionalStatNameEquals                 = 3,
	AdditionalStatNameStartsWith             = 4,
	AdditionalStatNameContains               = 5,
	EDestroyActorsAndComponentsMutator_MAX   = 6,
};

// Enum SpecialEventGameplayRuntime.EFakeKillRelevancyPlayerKillStep
// NumValues: 0x0004
enum class EFakeKillRelevancyPlayerKillStep : uint8
{
	Initiated                                = 0,
	BlueprintNotified                        = 1,
	VisualsPerformed                         = 2,
	EFakeKillRelevancyPlayerKillStep_MAX     = 3,
};

// Enum SpecialEventGameplayRuntime.EMutatorMovementMode
// NumValues: 0x0007
enum class EMutatorMovementMode : uint8
{
	None                                     = 0,
	BuffetBubbles                            = 25,
	BuffetBubblesIntro                       = 26,
	BuffetFlying                             = 27,
	BuffetFlyingRicochet                     = 28,
	Rewind                                   = 29,
	EMutatorMovementMode_MAX                 = 30,
};

// Enum SpecialEventGameplayRuntime.EFortCustomTickComponentCondition
// NumValues: 0x0005
enum class EFortCustomTickComponentCondition : uint8
{
	WasRecentlyRendered                      = 0,
	CameraDistance                           = 1,
	LocalPlayerDistance                      = 2,
	Count                                    = 3,
	EFortCustomTickComponentCondition_MAX    = 4,
};

// Enum SpecialEventGameplayRuntime.ESpecialEventGameUserSettingsResult
// NumValues: 0x0003
enum class ESpecialEventGameUserSettingsResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	ESpecialEventGameUserSettingsResult_MAX  = 2,
};

// Enum SpecialEventGameplayRuntime.ESpecialEventPhaseState
// NumValues: 0x0005
enum class ESpecialEventPhaseState : uint8
{
	Unregistered                             = 0,
	Inactive                                 = 1,
	Active                                   = 2,
	Deactivated                              = 3,
	ESpecialEventPhaseState_MAX              = 4,
};

// Enum SpecialEventGameplayRuntime.ESpecialEventPhaseComponentNetModeType
// NumValues: 0x0004
enum class ESpecialEventPhaseComponentNetModeType : uint8
{
	ClientControlled                         = 0,
	Client                                   = 1,
	DedicatedServer                          = 2,
	ESpecialEventPhaseComponentNetModeType_MAX = 3,
};

// Enum SpecialEventGameplayRuntime.ESpecialEventRewindComponentState
// NumValues: 0x0004
enum class ESpecialEventRewindComponentState : uint8
{
	Stop                                     = 0,
	Record                                   = 1,
	Rewind                                   = 2,
	ESpecialEventRewindComponentState_MAX    = 3,
};

// ScriptStruct SpecialEventGameplayRuntime.DestroyActorsAndComponentsMutator_ComponentDefinition
// 0x0018 (0x0018 - 0x0000)
struct FDestroyActorsAndComponentsMutator_ComponentDefinition final
{
public:
	class FString                                 ComponentName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDestroyActorsAndComponentsMutator_ComponentNameComparisonType NameComparisonType;               // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyOnServer;                                  // 0x0011(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyOnClient;                                  // 0x0012(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPromoteChildrenOfDestroyedComponents;             // 0x0013(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialClientEvent
// 0x0018 (0x0018 - 0x0000)
struct FSpecialClientEvent final
{
public:
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeSeconds;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventTag;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventStatDefinition
// 0x0010 (0x0010 - 0x0000)
struct FSpecialEventStatDefinition final
{
public:
	struct FGameplayTag                           LookupTag;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Min;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultValue;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventStatArrayEntry
// 0x0034 (0x0040 - 0x000C)
struct FSpecialEventStatArrayEntry final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class USpecialEventStatComponent*             StatComponent;                                     // 0x0010(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 Owner;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         StatDefinitionIndex;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSpecialEventStatDefinition            StatDefinitionCopy;                                // 0x0024(0x0010)(BlueprintVisible, BlueprintReadOnly, RepSkip, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         Value;                                             // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventTODMSubphaseData
// 0x0018 (0x0018 - 0x0000)
struct FSpecialEventTODMSubphaseData final
{
public:
	float                                         PhaseTime;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpecialEventTODMModifyType                   ModifyType;                                        // 0x0004(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class AActor>                     SpawnClass;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeOfDay;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedFactor;                                       // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventTODMPhaseData
// 0x0020 (0x0020 - 0x0000)
struct FSpecialEventTODMPhaseData final
{
public:
	struct FGameplayTag                           PhaseTag;                                          // 0x0000(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FSpecialEventTODMSubphaseData>  SubphaseDataArray;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventMathEaseData
// 0x000C (0x000C - 0x0000)
struct FSpecialEventMathEaseData final
{
public:
	EEasingFunc                                   EasingFunc;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BlendExp;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Steps;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.DestroyActorsAndComponentsMutator_ActorDefinition
// 0x0070 (0x0070 - 0x0000)
struct FDestroyActorsAndComponentsMutator_ActorDefinition final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, DisableEditOnInstance, RepSkip, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   SoftActorClass;                                    // 0x0020(0x0020)(Edit, DisableEditOnInstance, RepSkip, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartEnabled;                                     // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyActorOnServer;                             // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyActorOnClient;                             // 0x0042(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNetForceOnActorDestroy;                           // 0x0043(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldModifyLevelOnActorDestroy;                  // 0x0044(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDestroyActorsAndComponentsMutator_ComponentDefinition> ComponentDefinitions;      // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, RepSkip, NativeAccessSpecifierPublic)
	bool                                          bCurrentlyEnabled;                                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPermanentlyDisabled;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AActor*>                         ActorsToProcess;                                   // 0x0060(0x0010)(ZeroConstructor, RepSkip, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.FakeKillRelevancyVictim
// 0x0020 (0x0020 - 0x0000)
struct FFakeKillRelevancyVictim final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DeathLocation;                                     // 0x0008(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.FakeKillRelevancyPlayerDataEntry
// 0x002C (0x0038 - 0x000C)
struct FFakeKillRelevancyPlayerDataEntry final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFakeKillRelevancyVictim>       Victims;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PhaseNum;                                          // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WaveNum;                                           // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyChangeServerWorldTime;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.FakeKillRelevancyPlayerDataArray
// 0x0018 (0x0120 - 0x0108)
struct FFakeKillRelevancyPlayerDataArray final : public FFastArraySerializer
{
public:
	TArray<struct FFakeKillRelevancyPlayerDataEntry> Entries;                                        // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UFortControllerComponent_FakeKillRelevancy* ControllerComponent;                           // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.FakeKillRelevancyPhaseData
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FFakeKillRelevancyPhaseData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Reason;                                            // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumWavesExpected;                                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WaveNum;                                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.FakeKillRelevancyBucket
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FFakeKillRelevancyBucket final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.FakeKillRelevancySupergroup
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FFakeKillRelevancySupergroup final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.FakeKillRelevancyTestParameters
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FFakeKillRelevancyTestParameters final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventMapData
// 0x0020 (0x0020 - 0x0000)
struct FSpecialEventMapData final
{
public:
	struct FGameplayTag                           MapTag;                                            // 0x0000(0x0004)(Edit, DisableEditOnInstance, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FName>                           MapNames;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, RepSkip, NativeAccessSpecifierPublic)
	bool                                          bReplicatedHasBeenUnloaded;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenUnloaded;                                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.FortDelayRTMMData
// 0x0010 (0x0010 - 0x0000)
struct FFortDelayRTMMData final
{
public:
	bool                                          bDelayRTTM;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MinRTTMDelay;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRTTMDelay;                                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timestamp;                                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.FortSpecialEventGEData
// 0x0010 (0x0010 - 0x0000)
struct FFortSpecialEventGEData final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffect;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.FortSpecialEventOverrideParts
// 0x0020 (0x0020 - 0x0000)
struct FFortSpecialEventOverrideParts final
{
public:
	TArray<class UCustomCharacterPart*>           OverrideParts;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FFortSpecialEventGEData                GameplayEffectToApplyOnSwap;                       // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.BuffetBubblesReplicatedData
// 0x0080 (0x0080 - 0x0000)
struct FBuffetBubblesReplicatedData final
{
public:
	struct FTransform                             RelativeTransform;                                 // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RelativeVelocity;                                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.BuffetBubblesDebugData
// 0x00F0 (0x00F0 - 0x0000)
struct alignas(0x10) FBuffetBubblesDebugData final
{
public:
	uint8                                         Pad_0[0xF0];                                       // 0x0000(0x00F0)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.BuffetFlyingRicochetReplicatedData
// 0x0020 (0x0020 - 0x0000)
struct FBuffetFlyingRicochetReplicatedData final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Velocity;                                          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.CustomTickComonentQualitySettings
// 0x0014 (0x0014 - 0x0000)
struct FCustomTickComonentQualitySettings final
{
public:
	int32                                         NumFramesToSkipBetweenEvaluations;                 // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinFramesToSkipBetweenCustomTicks;                 // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxFramesToSkipBetweenCustomTicks;                 // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerDistance;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterDistance;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventAudioHapticsAction
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FSpecialEventAudioHapticsAction final
{
public:
	float                                         LoudnessFloor;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoudnessCeiling;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HapticsIntensity;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelIndex;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAffectsLeftLarge : 1;                             // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectsLeftSmall : 1;                             // 0x0010(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectsRightLarge : 1;                            // 0x0010(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectsRightSmall : 1;                            // 0x0010(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventCursorMode
// 0x02E8 (0x02E8 - 0x0000)
struct FSpecialEventCursorMode final
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowDebugCursorDrawing;                          // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpecialEventMathEaseData              GamepadMoveEaseData;                               // 0x000C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FScalableFloat                         GamepadMoveSpeed;                                  // 0x0018(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSpecialEventMathEaseData              TouchMoveEaseData;                                 // 0x0040(0x000C)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         TouchMoveSpeed;                                    // 0x0050(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         TouchDeadzoneTreshold;                             // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TouchAttenuator;                                   // 0x007C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinCursorPercentForAdditiveRotationPitch;          // 0x0080(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinCursorPercentForAdditiveRotationYaw;            // 0x00A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxAdditiveRotationPitch;                          // 0x00D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxAdditiveRotationYaw;                            // 0x00F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         AdditiveRotationInterpSpeed;                       // 0x0120(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ZoomInInterpSpeed;                                 // 0x0148(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ZoomOutInterpSpeed;                                // 0x0170(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ZoomAdditiveFOV;                                   // 0x0198(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         GamepadZoomMoveSpeed;                              // 0x01C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         TouchZoomMoveSpeed;                                // 0x01E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bAllowTrace;                                       // 0x0210(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             TraceChannel;                                      // 0x0211(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SweepRadius;                                       // 0x0218(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         TraceDistance;                                     // 0x0240(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bTraceComplex;                                     // 0x0268(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RecenterAfterNoInputDelay;                         // 0x0290(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RecenterInterpSpeed;                               // 0x02B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventCursorStackEntry
// 0x000C (0x000C - 0x0000)
struct FSpecialEventCursorStackEntry final
{
public:
	struct FGameplayTag                           CursorModeTag;                                     // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                 InstigatingObject;                                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventPhaseComponentNetModeInfo
// 0x0010 (0x0010 - 0x0000)
struct FSpecialEventPhaseComponentNetModeInfo final
{
public:
	ESpecialEventPhaseComponentNetModeType        NetModeType;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventRewindComponentStateData
// 0x0008 (0x0008 - 0x0000)
struct FSpecialEventRewindComponentStateData final
{
public:
	ESpecialEventRewindComponentState             State;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         StateChangedCount;                                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ServerWorldTime;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventRewindComponentFrame
// 0x0004 (0x0010 - 0x000C)
struct FSpecialEventRewindComponentFrame : public FFastArraySerializerItem
{
public:
	float                                         ServerWorldTime;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventRewindComponentRecording
// 0x0020 (0x0020 - 0x0000)
struct FSpecialEventRewindComponentRecording
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class USpecialEventRewindComponent*           RewindComponent;                                   // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         StartFrameIndex;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         EndFrameIndex;                                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventRewindComponentFrame_PlayerPawn
// 0x0020 (0x0030 - 0x0010)
struct FSpecialEventRewindComponentFrame_PlayerPawn final : public FSpecialEventRewindComponentFrame
{
public:
	struct FVector_NetQuantize                    Location;                                          // 0x0010(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CompressedYaw;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         CompressedControlRotationPitch;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventRewindComponentRecordingFastArray_PlayerPawn
// 0x0010 (0x0118 - 0x0108)
struct FSpecialEventRewindComponentRecordingFastArray_PlayerPawn final : public FFastArraySerializer
{
public:
	TArray<struct FSpecialEventRewindComponentFrame_PlayerPawn> Frames;                              // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventRewindComponentRecording_PlayerPawn
// 0x0000 (0x0020 - 0x0020)
struct FSpecialEventRewindComponentRecording_PlayerPawn final : public FSpecialEventRewindComponentRecording
{
};

// ScriptStruct SpecialEventGameplayRuntime.PhaseLevelEntryBase
// 0x0060 (0x0060 - 0x0000)
struct FPhaseLevelEntryBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bLoadLevelOnScriptStart;                           // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLevelStartsVisible;                               // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnloadLevelOnPhaseEnd;                            // 0x000A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeVisibleOnPhaseStart;                          // 0x000B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  MakeVisibleAtPhaseTags;                            // 0x0010(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UnloadLevelAtPhaseTags;                            // 0x0030(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.PhaseLevelEntry
// 0x0070 (0x00D0 - 0x0060)
struct FPhaseLevelEntry final : public FPhaseLevelEntryBase
{
public:
	TSoftObjectPtr<class UWorld>                  LevelToLoad;                                       // 0x0060(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LevelName;                                         // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExcludeFromServerPreload;                         // 0x0090(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Location;                                          // 0x0098(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               Rotation;                                          // 0x00B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class ULevelStreamingDynamic*                 LevelInstance;                                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SpecialEventGameplayRuntime.PhaseDataLayerEntry
// 0x0020 (0x0080 - 0x0060)
struct FPhaseDataLayerEntry final : public FPhaseLevelEntryBase
{
public:
	class UDataLayerAsset*                        DataLayerAsset;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRecursive;                                      // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x17];                                      // 0x0069(0x0017)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SpecialEventGameplayRuntime.PhaseInfo
// 0x0060 (0x0060 - 0x0000)
struct FPhaseInfo final
{
public:
	struct FGameplayTag                           PhaseTag;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhaseDuration;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetRelevancyMode;                                 // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpecialRelevancyMode                         RelevancyMode;                                     // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NumOfSquadsInRelevancyGroup;                       // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequireLevelsFromPhaseTags;                        // 0x0010(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bStartNextPhaseOnPhaseFinished;                    // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGarbageCollectAtPhaseStartOnServer;               // 0x0031(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGarbageCollectAtPhaseStartOnClient;               // 0x0032(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class ASpecialEventPhase*                     PhaseActor;                                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPhaseLevelEntry>               Levels;                                            // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FPhaseDataLayerEntry>           DataLayers;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct SpecialEventGameplayRuntime.SpecialEventStatArray
// 0x0018 (0x0120 - 0x0108)
struct FSpecialEventStatArray final : public FFastArraySerializer
{
public:
	TArray<struct FSpecialEventStatArrayEntry>    Stats;                                             // 0x0108(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class USpecialEventStatComponent*             StatComponent;                                     // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

}

