#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SportbikeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MotorcycleRuntime_classes.hpp"


namespace SDK
{

// Class SportbikeRuntime.FortSportbikeAnimInstance
// 0x0020 (0x0690 - 0x0670)
class UFortSportbikeAnimInstance final : public UFortMotorcycleVehicleAnimInstance
{
public:
	struct FRotator                               LimitedWheelRotationFR;                            // 0x0668(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          HasPassenger;                                      // 0x0680(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldPlayGroundTrick;                             // 0x0681(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWheelie;                                         // 0x0682(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StateRuleFromWheelieToGroundTrickOutro;            // 0x0683(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SportBikeWheelieEarlyOut;                          // 0x0684(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldExitFromLocomotion;                          // 0x0685(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangingGear;                                    // 0x0686(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_687[0x9];                                      // 0x0687(0x0009)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSportbikeAnimInstance">();
	}
	static class UFortSportbikeAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSportbikeAnimInstance>();
	}
};

// Class SportbikeRuntime.FortSportbikeDriverAnimInstance
// 0x0030 (0x0950 - 0x0920)
class UFortSportbikeDriverAnimInstance final : public UFortPlayerAnimInstance_MotorcycleDriver
{
public:
	bool                                          SportBikeWheelieEarlyOut;                          // 0x0920(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StateRuleFromWheelieToGroundTrickOutro;            // 0x0921(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EarlyExitFromGroundTrick;                          // 0x0922(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBoostingWithNoPassenger;                         // 0x0923(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MotorcycleGear;                                    // 0x0924(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentGear;                                       // 0x0928(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreviousGear;                                      // 0x092C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangingGear;                                    // 0x0930(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_931[0x3];                                      // 0x0931(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SuperSlideBlendAlpha;                              // 0x0934(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuperSlideBlendStart;                              // 0x0938(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuperSlideBlendEnd;                                // 0x093C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSuperSliding;                                    // 0x0940(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_941[0xF];                                      // 0x0941(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSportbikeDriverAnimInstance">();
	}
	static class UFortSportbikeDriverAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSportbikeDriverAnimInstance>();
	}
};

// Class SportbikeRuntime.FortSportbikeVehicle
// 0x0010 (0x20A0 - 0x2090)
class AFortSportbikeVehicle final : public AFortMotorcycleVehicle
{
public:
	uint8                                         Pad_2090[0x10];                                    // 0x2090(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSportbikeVehicle">();
	}
	static class AFortSportbikeVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortSportbikeVehicle>();
	}
};

// Class SportbikeRuntime.FortSportbikeVehicleConfigs
// 0x0000 (0x0B80 - 0x0B80)
class UFortSportbikeVehicleConfigs final : public UFortMotorcycleVehicleConfigs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSportbikeVehicleConfigs">();
	}
	static class UFortSportbikeVehicleConfigs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSportbikeVehicleConfigs>();
	}
};

}

