#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SqueegeeUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK
{

// Enum SqueegeeUI.EFortContentManagementState
// NumValues: 0x0004
enum class EFortContentManagementState : uint8
{
	Locked                                   = 0,
	Unlocked                                 = 1,
	WaitingForResponse                       = 2,
	EFortContentManagementState_MAX          = 3,
};

// ScriptStruct SqueegeeUI.SqueegeeInjectionData
// 0x0028 (0x0028 - 0x0000)
struct FSqueegeeInjectionData final
{
public:
	ESqueegeeWidgetInjection                      WidgetType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0008(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SqueegeeUI.SqueegeeTextData
// 0x0020 (0x0020 - 0x0000)
struct FSqueegeeTextData final
{
public:
	ESqueegeeText                                 TextType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   DesiredText;                                       // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
};

}

