#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "SrirachaRanch_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio.HandleRadioPlaying
// 0x0060 (0x0060 - 0x0000)
struct FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio.HandleRadioStopped
// 0x0060 (0x0060 - 0x0000)
struct FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.GetRadioStatusOnScreenTime
// 0x0004 (0x0004 - 0x0000)
struct RadioPlayerWidgetBase_GetRadioStatusOnScreenTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.HaveToChangeSongInfo
// 0x0098 (0x0098 - 0x0000)
struct RadioPlayerWidgetBase_HaveToChangeSongInfo final
{
public:
	struct FFortMediaInBandMetadata               MediaMetadata;                                     // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.IsMetadataEmpty
// 0x0098 (0x0098 - 0x0000)
struct RadioPlayerWidgetBase_IsMetadataEmpty final
{
public:
	struct FFortMediaInBandMetadata               MediaMetadata;                                     // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnControllerGainedNewFortPawn
// 0x0008 (0x0008 - 0x0000)
struct RadioPlayerWidgetBase_OnControllerGainedNewFortPawn final
{
public:
	class AFortPawn*                              FortPawn;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnFailedToOpenSource
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnFailedToOpenSource final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnLoadingNewSource
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnLoadingNewSource final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnMetadataChanged
// 0x0090 (0x0090 - 0x0000)
struct RadioPlayerWidgetBase_OnMetadataChanged final
{
public:
	struct FFortMediaInBandMetadata               MediaMetadata;                                     // 0x0000(0x0090)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnRadioStopped
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnRadioStopped final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    LastSource;                                        // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnSourceFinished
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnSourceFinished final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnSourcePlaying
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnSourcePlaying final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.SetControllable
// 0x0001 (0x0001 - 0x0000)
struct RadioPlayerWidgetBase_SetControllable final
{
public:
	bool                                          bCanControl;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

