#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: StateTreeModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Enum StateTreeModule.EStateTreeBreakpointType
// NumValues: 0x0005
enum class EStateTreeBreakpointType : uint8
{
	Unset                                    = 0,
	OnEnter                                  = 1,
	OnExit                                   = 2,
	OnTransition                             = 3,
	EStateTreeBreakpointType_MAX             = 4,
};

// Enum StateTreeModule.EStateTreeUpdatePhase
// NumValues: 0x0010
enum class EStateTreeUpdatePhase : uint8
{
	Unset                                    = 0,
	StartTree                                = 1,
	StopTree                                 = 2,
	StartGlobalTasks                         = 3,
	StopGlobalTasks                          = 4,
	TickStateTree                            = 5,
	ApplyTransitions                         = 6,
	TriggerTransitions                       = 7,
	TickingGlobalTasks                       = 8,
	TickingTasks                             = 9,
	TransitionConditions                     = 10,
	StateSelection                           = 11,
	EnterConditions                          = 12,
	EnterStates                              = 13,
	ExitStates                               = 14,
	EStateTreeUpdatePhase_MAX                = 15,
};

// Enum StateTreeModule.EStateTreeRunStatus
// NumValues: 0x0006
enum class EStateTreeRunStatus : uint8
{
	Running                                  = 0,
	Failed                                   = 1,
	Succeeded                                = 2,
	Stopped                                  = 3,
	Unset                                    = 4,
	EStateTreeRunStatus_MAX                  = 5,
};

// Enum StateTreeModule.EStateTreeStateChangeType
// NumValues: 0x0004
enum class EStateTreeStateChangeType : uint8
{
	None                                     = 0,
	Changed                                  = 1,
	Sustained                                = 2,
	EStateTreeStateChangeType_MAX            = 3,
};

// Enum StateTreeModule.EStateTreeConditionEvaluationMode
// NumValues: 0x0004
enum class EStateTreeConditionEvaluationMode : uint8
{
	Evaluated                                = 0,
	ForcedTrue                               = 1,
	ForcedFalse                              = 2,
	EStateTreeConditionEvaluationMode_MAX    = 3,
};

// Enum StateTreeModule.EStateTreeTransitionSourceType
// NumValues: 0x0005
enum class EStateTreeTransitionSourceType : uint8
{
	Unset                                    = 0,
	Asset                                    = 1,
	ExternalRequest                          = 2,
	Internal                                 = 3,
	EStateTreeTransitionSourceType_MAX       = 4,
};

// Enum StateTreeModule.EStateTreeLinkerStatus
// NumValues: 0x0003
enum class EStateTreeLinkerStatus : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	EStateTreeLinkerStatus_MAX               = 2,
};

// Enum StateTreeModule.EStateTreeTraceEventType
// NumValues: 0x0013
enum class EStateTreeTraceEventType : uint8
{
	Unset                                    = 0,
	OnEntering                               = 1,
	OnEntered                                = 2,
	OnExiting                                = 3,
	OnExited                                 = 4,
	Push                                     = 5,
	Pop                                      = 6,
	OnStateSelected                          = 7,
	OnStateCompleted                         = 8,
	OnTicking                                = 9,
	OnTaskCompleted                          = 10,
	OnTicked                                 = 11,
	Passed                                   = 12,
	Failed                                   = 13,
	OnEvaluating                             = 14,
	OnTransition                             = 15,
	OnTreeStarted                            = 16,
	OnTreeStopped                            = 17,
	EStateTreeTraceEventType_MAX             = 18,
};

// Enum StateTreeModule.EStateTreeBlueprintPropertyCategory
// NumValues: 0x0006
enum class EStateTreeBlueprintPropertyCategory : uint8
{
	NotSet                                   = 0,
	Input                                    = 1,
	Parameter                                = 2,
	Output                                   = 3,
	ContextObject                            = 4,
	EStateTreeBlueprintPropertyCategory_MAX  = 5,
};

// Enum StateTreeModule.EStateTreeLoopEvents
// NumValues: 0x0003
enum class EStateTreeLoopEvents : uint8
{
	Next                                     = 0,
	Break                                    = 1,
	EStateTreeLoopEvents_MAX                 = 2,
};

// Enum StateTreeModule.EStateTreeBindableStructSource
// NumValues: 0x0008
enum class EStateTreeBindableStructSource : uint8
{
	Context                                  = 0,
	Parameter                                = 1,
	Evaluator                                = 2,
	GlobalTask                               = 3,
	State                                    = 4,
	Task                                     = 5,
	Condition                                = 6,
	EStateTreeBindableStructSource_MAX       = 7,
};

// Enum StateTreeModule.EStateTreePropertyAccessType
// NumValues: 0x0008
enum class EStateTreePropertyAccessType : uint8
{
	Offset                                   = 0,
	Object                                   = 1,
	WeakObject                               = 2,
	SoftObject                               = 3,
	ObjectInstance                           = 4,
	StructInstance                           = 5,
	IndexArray                               = 6,
	EStateTreePropertyAccessType_MAX         = 7,
};

// Enum StateTreeModule.EStateTreePropertyCopyType
// NumValues: 0x0021
enum class EStateTreePropertyCopyType : uint8
{
	None                                     = 0,
	CopyPlain                                = 1,
	CopyComplex                              = 2,
	CopyBool                                 = 3,
	CopyStruct                               = 4,
	CopyObject                               = 5,
	CopyName                                 = 6,
	CopyFixedArray                           = 7,
	StructReference                          = 8,
	PromoteBoolToByte                        = 9,
	PromoteBoolToInt32                       = 10,
	PromoteBoolToUInt32                      = 11,
	PromoteBoolToInt64                       = 12,
	PromoteBoolToFloat                       = 13,
	PromoteBoolToDouble                      = 14,
	PromoteByteToInt32                       = 15,
	PromoteByteToUInt32                      = 16,
	PromoteByteToInt64                       = 17,
	PromoteByteToFloat                       = 18,
	PromoteByteToDouble                      = 19,
	PromoteInt32ToInt64                      = 20,
	PromoteInt32ToFloat                      = 21,
	PromoteInt32ToDouble                     = 22,
	PromoteUInt32ToInt64                     = 23,
	PromoteUInt32ToFloat                     = 24,
	PromoteUInt32ToDouble                    = 25,
	PromoteFloatToInt32                      = 26,
	PromoteFloatToInt64                      = 27,
	PromoteFloatToDouble                     = 28,
	DemoteDoubleToInt32                      = 29,
	DemoteDoubleToInt64                      = 30,
	DemoteDoubleToFloat                      = 31,
	EStateTreePropertyCopyType_MAX           = 32,
};

// Enum StateTreeModule.EStateTreeTransitionType
// NumValues: 0x0007
enum class EStateTreeTransitionType : uint8
{
	None                                     = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	GotoState                                = 3,
	NextState                                = 4,
	NotSet                                   = 5,
	EStateTreeTransitionType_MAX             = 6,
};

// Enum StateTreeModule.EStateTreeConditionOperand
// NumValues: 0x0004
enum class EStateTreeConditionOperand : uint8
{
	Copy                                     = 0,
	And                                      = 1,
	Or                                       = 2,
	EStateTreeConditionOperand_MAX           = 3,
};

// Enum StateTreeModule.EStateTreeStateType
// NumValues: 0x0005
enum class EStateTreeStateType : uint8
{
	State                                    = 0,
	Group                                    = 1,
	Linked                                   = 2,
	Subtree                                  = 3,
	EStateTreeStateType_MAX                  = 4,
};

// Enum StateTreeModule.EStateTreeStateSelectionBehavior
// NumValues: 0x0005
enum class EStateTreeStateSelectionBehavior : uint8
{
	None                                     = 0,
	TryEnterState                            = 1,
	TrySelectChildrenInOrder                 = 2,
	TryFollowTransitions                     = 3,
	EStateTreeStateSelectionBehavior_MAX     = 4,
};

// Enum StateTreeModule.EStateTreeTransitionTrigger
// NumValues: 0x0007
enum class EStateTreeTransitionTrigger : uint8
{
	None                                     = 0,
	OnStateCompleted                         = 3,
	OnStateSucceeded                         = 1,
	OnStateFailed                            = 2,
	OnTick                                   = 4,
	OnEvent                                  = 8,
	MAX                                      = 9,
};

// Enum StateTreeModule.EStateTreeTransitionPriority
// NumValues: 0x0006
enum class EStateTreeTransitionPriority : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Medium                                   = 2,
	High                                     = 3,
	Critical                                 = 4,
	EStateTreeTransitionPriority_MAX         = 5,
};

// Enum StateTreeModule.EStateTreeExternalDataRequirement
// NumValues: 0x0003
enum class EStateTreeExternalDataRequirement : uint8
{
	Required                                 = 0,
	Optional                                 = 1,
	EStateTreeExternalDataRequirement_MAX    = 2,
};

// Enum StateTreeModule.EStateTreePropertyUsage
// NumValues: 0x0006
enum class EStateTreePropertyUsage : uint8
{
	Invalid                                  = 0,
	Context                                  = 1,
	Input                                    = 2,
	Parameter                                = 3,
	Output                                   = 4,
	EStateTreePropertyUsage_MAX              = 5,
};

// ScriptStruct StateTreeModule.StateTreeAnyEnum
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeAnyEnum final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UEnum*                                  Enum;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeIndex16
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeIndex16 final
{
public:
	uint16                                        Value;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeExternalDataHandle
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeExternalDataHandle final
{
public:
	struct FStateTreeIndex16                      DataViewIndex;                                     // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeExternalDataDesc
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeExternalDataDesc final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeExternalDataHandle           Handle;                                            // 0x000C(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeExternalDataRequirement             Requirement;                                       // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeStateHandle
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeStateHandle final
{
public:
	uint16                                        Index;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeTransitionRequest
// 0x0006 (0x0006 - 0x0000)
struct FStateTreeTransitionRequest final
{
public:
	struct FStateTreeStateHandle                  SourceState;                                       // 0x0000(0x0002)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  TargetState;                                       // 0x0002(0x0002)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0004(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x1];                                        // 0x0005(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeActiveStates
// 0x0012 (0x0012 - 0x0000)
struct FStateTreeActiveStates final
{
public:
	struct FStateTreeStateHandle                  States[0x8];                                       // 0x0000(0x0002)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         NumStates;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x1];                                       // 0x0011(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeTransitionSource
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x02) FStateTreeTransitionSource final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeTransitionResult
// 0x002E (0x002E - 0x0000)
struct FStateTreeTransitionResult final
{
public:
	struct FStateTreeActiveStates                 CurrentActiveStates;                               // 0x0000(0x0012)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           CurrentRunStatus;                                  // 0x0012(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	struct FStateTreeStateHandle                  SourceState;                                       // 0x0014(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  TargetState;                                       // 0x0016(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeActiveStates                 NextActiveStates;                                  // 0x0018(0x0012)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  CurrentState;                                      // 0x002A(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeStateChangeType                     ChangeType;                                        // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x002D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeExecutionState
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FStateTreeExecutionState final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeIndex8
// 0x0001 (0x0001 - 0x0000)
struct FStateTreeIndex8 final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeNodeBase
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FStateTreeNodeBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      BindingsBatch;                                     // 0x000C(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      DataViewIndex;                                     // 0x000E(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      InstanceIndex;                                     // 0x0010(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bInstanceIsObject : 1;                             // 0x0012(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeConditionBase
// 0x0008 (0x0020 - 0x0018)
struct FStateTreeConditionBase : public FStateTreeNodeBase
{
public:
	EStateTreeConditionOperand                    Operand;                                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DeltaIndent;                                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeConditionEvaluationMode             EvaluationMode;                                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeBlueprintConditionWrapper
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeBlueprintConditionWrapper final : public FStateTreeConditionBase
{
public:
	TSubclassOf<class UStateTreeConditionBlueprintBase> ConditionClass;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeEvaluatorBase
// 0x0000 (0x0018 - 0x0018)
struct FStateTreeEvaluatorBase : public FStateTreeNodeBase
{
};

// ScriptStruct StateTreeModule.StateTreeBlueprintEvaluatorWrapper
// 0x0008 (0x0020 - 0x0018)
struct FStateTreeBlueprintEvaluatorWrapper final : public FStateTreeEvaluatorBase
{
public:
	TSubclassOf<class UStateTreeEvaluatorBlueprintBase> EvaluatorClass;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeTaskBase
// 0x0008 (0x0020 - 0x0018)
struct FStateTreeTaskBase : public FStateTreeNodeBase
{
public:
	uint8                                         BitPad_18_0 : 6;                                   // 0x0018(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-8 ])
	uint8                                         bTaskEnabled : 1;                                  // 0x0018(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeBlueprintTaskWrapper
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeBlueprintTaskWrapper final : public FStateTreeTaskBase
{
public:
	TSubclassOf<class UStateTreeTaskBlueprintBase> TaskClass;                                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareIntConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeCompareIntConditionInstanceData final
{
public:
	int32                                         Left;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Right;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeConditionCommonBase
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeConditionCommonBase : public FStateTreeConditionBase
{
};

// ScriptStruct StateTreeModule.StateTreeCompareIntCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareIntCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               Operator;                                          // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareFloatConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeCompareFloatConditionInstanceData final
{
public:
	double                                        Left;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Right;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareFloatCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareFloatCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               Operator;                                          // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareBoolConditionInstanceData
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeCompareBoolConditionInstanceData final
{
public:
	bool                                          bLeft;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRight;                                            // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareBoolCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareBoolCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareEnumConditionInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeCompareEnumConditionInstanceData final
{
public:
	struct FStateTreeAnyEnum                      Left;                                              // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeAnyEnum                      Right;                                             // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareEnumCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareEnumCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareDistanceConditionInstanceData
// 0x0038 (0x0038 - 0x0000)
struct FStateTreeCompareDistanceConditionInstanceData final
{
public:
	struct FVector                                Source;                                            // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Target;                                            // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Distance;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareDistanceCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareDistanceCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               Operator;                                          // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeRandomConditionInstanceData
// 0x0004 (0x0004 - 0x0000)
struct FStateTreeRandomConditionInstanceData final
{
public:
	float                                         Threshold;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeRandomCondition
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeRandomCondition final : public FStateTreeConditionCommonBase
{
};

// ScriptStruct StateTreeModule.GameplayTagMatchConditionInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FGameplayTagMatchConditionInstanceData final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTag                           tag;                                               // 0x0020(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.GameplayTagMatchCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayTagMatchCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bExactMatch;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.GameplayTagContainerMatchConditionInstanceData
// 0x0040 (0x0040 - 0x0000)
struct FGameplayTagContainerMatchConditionInstanceData final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  OtherContainer;                                    // 0x0020(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.GameplayTagContainerMatchCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayTagContainerMatchCondition final : public FStateTreeConditionCommonBase
{
public:
	EGameplayContainerMatchType                   MatchType;                                         // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.GameplayTagQueryConditionInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FGameplayTagQueryConditionInstanceData final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.GameplayTagQueryCondition
// 0x0050 (0x0070 - 0x0020)
struct FGameplayTagQueryCondition final : public FStateTreeConditionCommonBase
{
public:
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeObjectIsValidConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeObjectIsValidConditionInstanceData final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeObjectIsValidCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeObjectIsValidCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeObjectEqualsConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeObjectEqualsConditionInstanceData final
{
public:
	class UObject*                                Left;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Right;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeObjectEqualsCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeObjectEqualsCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeObjectIsChildOfClassConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeObjectIsChildOfClassConditionInstanceData final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    Class;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeObjectIsChildOfClassCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeObjectIsChildOfClassCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeEvaluatorCommonBase
// 0x0000 (0x0018 - 0x0018)
struct FStateTreeEvaluatorCommonBase final : public FStateTreeEvaluatorBase
{
};

// ScriptStruct StateTreeModule.StateTreeEvent
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeEvent final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedStruct                       Payload;                                           // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FName                                   Origin;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeEventQueue
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeEventQueue final
{
public:
	TArray<struct FStateTreeEvent>                Events;                                            // 0x0000(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeInstanceStorage
// 0x0040 (0x0040 - 0x0000)
struct FStateTreeInstanceStorage final
{
public:
	struct FInstancedStructContainer              InstanceStructs;                                   // 0x0000(0x0010)(Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        InstanceObjects;                                   // 0x0010(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FStateTreeEventQueue                   EventQueue;                                        // 0x0020(0x0010)(Protected, NativeAccessSpecifierProtected)
	TArray<struct FStateTreeTransitionRequest>    TransitionRequests;                                // 0x0030(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeInstanceData final
{
public:
	struct FInstancedStruct                       InstanceStorage;                                   // 0x0000(0x0010)(Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeBindableStructDesc
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeBindableStructDesc final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeBindableStructSource                DataSource;                                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyPathSegment
// 0x0010 (0x0010 - 0x0000)
struct FStateTreePropertyPathSegment final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ArrayIndex;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStruct*                                InstanceStruct;                                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeModule.StateTreePropertyPath
// 0x0010 (0x0010 - 0x0000)
struct FStateTreePropertyPath final
{
public:
	TArray<struct FStateTreePropertyPathSegment>  Segments;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeModule.StateTreeEditorPropertyPath
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeEditorPropertyPath final
{
public:
	struct FGuid                                  StructID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Path;                                              // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreePropertyPathBinding
// 0x0028 (0x0028 - 0x0000)
struct FStateTreePropertyPathBinding final
{
public:
	struct FStateTreePropertyPath                 SourcePropertyPath;                                // 0x0000(0x0010)(NativeAccessSpecifierPrivate)
	struct FStateTreePropertyPath                 TargetPropertyPath;                                // 0x0010(0x0010)(NativeAccessSpecifierPrivate)
	struct FStateTreeIndex16                      CompiledSourceStructIndex;                         // 0x0020(0x0002)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreePropertySegment
// 0x000C (0x000C - 0x0000)
struct FStateTreePropertySegment final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      ArrayIndex;                                        // 0x0004(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      NextIndex;                                         // 0x0006(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreePropertyAccessType                  Type;                                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyBinding
// 0x001C (0x001C - 0x0000)
struct FStateTreePropertyBinding final
{
public:
	struct FStateTreePropertySegment              SourcePath;                                        // 0x0000(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreePropertySegment              TargetPath;                                        // 0x000C(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      SourceStructIndex;                                 // 0x0018(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreePropertyCopyType                    CopyType;                                          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyIndirection
// 0x0018 (0x0018 - 0x0000)
struct FStateTreePropertyIndirection final
{
public:
	struct FStateTreeIndex16                      ArrayIndex;                                        // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint16                                        Offset;                                            // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      NextIndex;                                         // 0x0004(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreePropertyAccessType                  Type;                                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	class UStruct*                                InstanceStruct;                                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyCopy
// 0x0048 (0x0048 - 0x0000)
struct FStateTreePropertyCopy final
{
public:
	struct FStateTreePropertyIndirection          SourceIndirection;                                 // 0x0000(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreePropertyIndirection          TargetIndirection;                                 // 0x0018(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         CopySize;                                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      SourceStructIndex;                                 // 0x0044(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreePropertyCopyType                    Type;                                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyCopyBatch
// 0x0018 (0x0018 - 0x0000)
struct FStateTreePropertyCopyBatch final
{
public:
	struct FStateTreeBindableStructDesc           TargetStruct;                                      // 0x0000(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	uint16                                        BindingsBegin;                                     // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        BindingsEnd;                                       // 0x0012(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyBindings
// 0x0058 (0x0058 - 0x0000)
struct FStateTreePropertyBindings final
{
public:
	TArray<struct FStateTreeBindableStructDesc>   SourceStructs;                                     // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FStateTreePropertyCopyBatch>    CopyBatches;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FStateTreePropertyPathBinding>  PropertyPathBindings;                              // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FStateTreePropertyCopy>         PropertyCopies;                                    // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FStateTreePropertyIndirection>  PropertyIndirections;                              // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeReference
// 0x0018 (0x0018 - 0x0000)
struct FStateTreeReference final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0008(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeTaskCommonBase
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeTaskCommonBase : public FStateTreeTaskBase
{
};

// ScriptStruct StateTreeModule.StateTreeRandomTimeDuration
// 0x0004 (0x0004 - 0x0000)
struct FStateTreeRandomTimeDuration final
{
public:
	uint16                                        duration;                                          // 0x0000(0x0002)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                        RandomVariance;                                    // 0x0002(0x0002)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.CompactStateTransition
// 0x0010 (0x0010 - 0x0000)
struct FCompactStateTransition final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ConditionsBegin;                                   // 0x0004(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  State;                                             // 0x0006(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeRandomTimeDuration           Delay;                                             // 0x0008(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeTransitionTrigger                   Trigger;                                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ConditionsNum;                                     // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bTransitionEnabled : 1;                            // 0x000F(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};

// ScriptStruct StateTreeModule.CompactStateTreeState
// 0x0020 (0x0020 - 0x0000)
struct FCompactStateTreeState final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  LinkedState;                                       // 0x0004(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  Parent;                                            // 0x0006(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint16                                        ChildrenBegin;                                     // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ChildrenEnd;                                       // 0x000A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        EnterConditionsBegin;                              // 0x000C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        TransitionsBegin;                                  // 0x000E(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        TasksBegin;                                        // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      ParameterInstanceIndex;                            // 0x0012(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      ParameterDataViewIndex;                            // 0x0014(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         EnterConditionsNum;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TransitionsNum;                                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TasksNum;                                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TaskInstanceStructNum;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TaskInstanceObjectNum;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeStateType                           Type;                                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeStateSelectionBehavior              SelectionBehavior;                                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasTransitionTasks : 1;                           // 0x001D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnabled : 1;                                      // 0x001D(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.CompactStateTreeParameters
// 0x0018 (0x0018 - 0x0000)
struct FCompactStateTreeParameters final
{
public:
	struct FStateTreeIndex16                      BindingsBatch;                                     // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0008(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeStateIdToHandle
// 0x0014 (0x0014 - 0x0000)
struct FStateTreeStateIdToHandle final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  Handle;                                            // 0x0010(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeNodeIdToIndex
// 0x0014 (0x0014 - 0x0000)
struct FStateTreeNodeIdToIndex final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      Index;                                             // 0x0010(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateTreeModule.StateTreeTransitionIdToIndex
// 0x0014 (0x0014 - 0x0000)
struct FStateTreeTransitionIdToIndex final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
