#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: StateDrivenActorRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "StructUtils_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum StateDrivenActorRuntime.EStateDrivenStateID
// NumValues: 0x000E
enum class EStateDrivenStateID : uint8
{
	Invalid                                  = 0,
	Success                                  = 1,
	Failure                                  = 2,
	State_A                                  = 3,
	State_B                                  = 4,
	State_C                                  = 5,
	State_D                                  = 6,
	State_E                                  = 7,
	State_F                                  = 8,
	State_G                                  = 9,
	State_H                                  = 10,
	State_I                                  = 11,
	State_J                                  = 12,
	EStateDrivenStateID_MAX                  = 13,
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenStateTransitions
// 0x0018 (0x0018 - 0x0000)
struct FStateDrivenStateTransitions final
{
public:
	struct FGameplayTag                           TransitionTag;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FInstancedStruct>               TransitionEvents;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenState
// 0x00E0 (0x00E0 - 0x0000)
struct FStateDrivenState final
{
public:
	class FString                                 DevNotes;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyMeshTransform;                               // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             StaticMeshTransform;                               // 0x0020(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInstance>> MaterialInstances;                               // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayCueTag                        LoopingGameplayCueTag;                             // 0x0090(0x0004)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         OverlapRadius;                                     // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InteractionStringOverride;                         // 0x0098(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   InteractionFailedStringOverride;                   // 0x00B0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FStateDrivenStateTransitions>   Transitions;                                       // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent
// 0x0028 (0x0028 - 0x0000)
struct FStateDrivenEvent
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayCueTag                        BurstGameplayCue;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UGameplayEffect>            GameplayEffect;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortActorComponent_StateDriven*        StateDrivenOwner;                                  // 0x0020(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery
// 0x0018 (0x0018 - 0x0000)
struct FStateDrivenTagQuery final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedStruct                       InstancedTagQuery;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_BeginOverlap
// 0x0018 (0x0040 - 0x0028)
struct FStateDrivenEvent_BeginOverlap : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   OverlappingActorTagQuery;                          // 0x0028(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_InteractionBase
// 0x0030 (0x0058 - 0x0028)
struct FStateDrivenEvent_InteractionBase : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   PlayerTagQuery;                                    // 0x0028(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   InteractionStringOverride;                         // 0x0040(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Conversation
// 0x0010 (0x0068 - 0x0058)
struct FStateDrivenEvent_Conversation final : public FStateDrivenEvent_InteractionBase
{
public:
	struct FGameplayTag                           ConversationEntryTag;                              // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UFortNonPlayerConversationParticipantComponent> ConversationComponentPtr;   // 0x005C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_CustomEvent
// 0x0008 (0x0030 - 0x0028)
struct FStateDrivenEvent_CustomEvent final : public FStateDrivenEvent
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_DamageInstance
// 0x0038 (0x0060 - 0x0028)
struct FStateDrivenEvent_DamageInstance final : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   InstigatorTagQuery;                                // 0x0028(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStateDrivenTagQuery                   DamageInstanceTagQuery;                            // 0x0040(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         MinimumInstanceDamage;                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_DepositResource
// 0x0028 (0x0080 - 0x0058)
struct FStateDrivenEvent_DepositResource final : public FStateDrivenEvent_InteractionBase
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     DepositItem;                                       // 0x0058(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DepositAmount;                                     // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Destroy
// 0x0030 (0x0058 - 0x0028)
struct FStateDrivenEvent_Destroy final : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   InstigatorTagQuery;                                // 0x0028(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStateDrivenTagQuery                   DamageInstanceTagQuery;                            // 0x0040(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_EndOverlap
// 0x0018 (0x0040 - 0x0028)
struct FStateDrivenEvent_EndOverlap final : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   OverlappingActorTagQuery;                          // 0x0028(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_InsertItem
// 0x0018 (0x0070 - 0x0058)
struct FStateDrivenEvent_InsertItem final : public FStateDrivenEvent_InteractionBase
{
public:
	struct FStateDrivenTagQuery                   EquippedItemTagQuery;                              // 0x0058(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Interaction
// 0x0000 (0x0058 - 0x0058)
struct FStateDrivenEvent_Interaction final : public FStateDrivenEvent_InteractionBase
{
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_PickupItem
// 0x0000 (0x0040 - 0x0040)
struct FStateDrivenEvent_PickupItem final : public FStateDrivenEvent_BeginOverlap
{
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat
// 0x0018 (0x0018 - 0x0000)
struct FStateDrivenFloat final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedStruct                       InstancedFloat;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Timer
// 0x0020 (0x0048 - 0x0028)
struct FStateDrivenEvent_Timer final : public FStateDrivenEvent
{
public:
	struct FStateDrivenFloat                      duration;                                          // 0x0028(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTimerHandle                           TimerTransitionEventHandle;                        // 0x0040(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_WithdrawItem
// 0x0000 (0x0058 - 0x0058)
struct FStateDrivenEvent_WithdrawItem final : public FStateDrivenEvent_InteractionBase
{
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat_Base
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FStateDrivenFloat_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat_Simple
// 0x0008 (0x0010 - 0x0008)
struct FStateDrivenFloat_Simple final : public FStateDrivenFloat_Base
{
public:
	float                                         Value;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat_Variable
// 0x0008 (0x0010 - 0x0008)
struct FStateDrivenFloat_Variable final : public FStateDrivenFloat_Base
{
public:
	int32                                         VariableIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery_Base
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FStateDrivenTagQuery_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery_Simple
// 0x0048 (0x0050 - 0x0008)
struct FStateDrivenTagQuery_Simple final : public FStateDrivenTagQuery_Base
{
public:
	struct FGameplayTagQuery                      Query;                                             // 0x0008(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery_Variable
// 0x0008 (0x0010 - 0x0008)
struct FStateDrivenTagQuery_Variable final : public FStateDrivenTagQuery_Base
{
public:
	int32                                         VariableIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

