#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: StoreSelectionUI

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "StoreSelectionUI_structs.hpp"


namespace SDK
{

// Class StoreSelectionUI.FortStoreSelectionData
// 0x0050 (0x04F0 - 0x04A0)
class UFortStoreSelectionData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   StoreSelectionScreenClass;                         // 0x04A0(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   RegularStoreSelectedText;                          // 0x04C0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NonRegularStoreSelectedText;                       // 0x04D8(0x0018)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStoreSelectionData">();
	}
	static class UFortStoreSelectionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreSelectionData>();
	}
};

// Class StoreSelectionUI.FortStoreSelectionOptionEntry
// 0x0020 (0x1500 - 0x14E0)
class UFortStoreSelectionOptionEntry final : public UCommonButtonLegacy
{
public:
	class UFortLazyImage*                         Image_Icon;                                        // 0x14E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Description;                                  // 0x14E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Price;                                        // 0x14F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Label;                                    // 0x14F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStoreSelectionOptionEntry">();
	}
	static class UFortStoreSelectionOptionEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreSelectionOptionEntry>();
	}
};

// Class StoreSelectionUI.FortStoreSelectionScreen
// 0x03B8 (0x08F0 - 0x0538)
class UFortStoreSelectionScreen final : public UCommonActivatablePanelLegacy
{
public:
	uint8                                         Pad_538[0x8];                                      // 0x0538(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonGroupLegacy*               EntryBoxButtonGroup;                               // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortRealMoneyOffer*                    StoreOffer;                                        // 0x0548(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLoadGuard*                       StoreOfferLoadGuard;                               // 0x0550(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Header;                                       // 0x0558(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       DynamicEntryBox_Options;                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Continue;                                   // 0x0568(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Cancel;                                     // 0x0570(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_InitiallySelectedHint;                    // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IPurchaseChoiceRequesterInterface> PurchaseChoiceOwner;                   // 0x0580(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FItemData>                      StoreOptions;                                      // 0x0590(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFortMtxOfferData>       SoftDisplayAsset;                                  // 0x05A0(0x0020)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FItemData                              ItemData[0xC];                                     // 0x05C0(0x0040)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   OptionalLabels[0x2];                               // 0x08C0(0x0018)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStoreSelectionScreen">();
	}
	static class UFortStoreSelectionScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreSelectionScreen>();
	}
};

}

