#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: StructUtils

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum StructUtils.EPropertyBagPropertyType
// NumValues: 0x0014
enum class EPropertyBagPropertyType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	Byte                                     = 2,
	Int32                                    = 3,
	Int64                                    = 4,
	Float                                    = 5,
	Double                                   = 6,
	Name                                     = 7,
	String                                   = 8,
	Text                                     = 9,
	Enum                                     = 10,
	Struct                                   = 11,
	Object                                   = 12,
	SoftObject                               = 13,
	Class                                    = 14,
	SoftClass                                = 15,
	UInt32                                   = 16,
	UInt64                                   = 17,
	Count                                    = 18,
	EPropertyBagPropertyType_MAX             = 19,
};

// Enum StructUtils.EPropertyBagContainerType
// NumValues: 0x0004
enum class EPropertyBagContainerType : uint8
{
	None                                     = 0,
	Array                                    = 1,
	Count                                    = 2,
	EPropertyBagContainerType_MAX            = 3,
};

// Enum StructUtils.EPropertyBagResult
// NumValues: 0x0005
enum class EPropertyBagResult : uint8
{
	Success                                  = 0,
	TypeMismatch                             = 1,
	OutOfBounds                              = 2,
	PropertyNotFound                         = 3,
	EPropertyBagResult_MAX                   = 4,
};

// Enum StructUtils.EPropertyBagMissingEnum
// NumValues: 0x0002
enum class EPropertyBagMissingEnum : uint8
{
	Missing                                  = 0,
	EPropertyBagMissingEnum_MAX              = 1,
};

// ScriptStruct StructUtils.InstancedStructContainer
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FInstancedStructContainer final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StructUtils.InstancedStruct
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FInstancedStruct final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StructUtils.InstancedPropertyBag
// 0x0010 (0x0010 - 0x0000)
struct FInstancedPropertyBag
{
public:
	struct FInstancedStruct                       Value;                                             // 0x0000(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StructUtils.PropertyBagContainerTypes
// 0x0003 (0x0003 - 0x0000)
struct FPropertyBagContainerTypes final
{
public:
	uint8                                         Pad_0[0x3];                                        // 0x0000(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StructUtils.PropertyBagPropertyDescMetaData
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBagPropertyDescMetaData final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtils.PropertyBagPropertyDesc
// 0x0028 (0x0028 - 0x0000)
struct FPropertyBagPropertyDesc final
{
public:
	class UObject*                                ValueTypeObject;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPropertyBagPropertyType                      ValueType;                                         // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyBagContainerTypes             ContainerTypes;                                    // 0x001D(0x0003)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StructUtils.PropertyBagMissingStruct
// 0x0001 (0x0001 - 0x0000)
struct FPropertyBagMissingStruct final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StructUtils.SharedStruct
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSharedStruct final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct StructUtils.ConstSharedStruct
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FConstSharedStruct final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

