#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: StyleSheets

#include "Basic.hpp"

#include "GameFeatures_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "StyleSheets_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class StyleSheets.GameFeatureAction_ActivateStyleTheme
// 0x0008 (0x0030 - 0x0028)
class UGameFeatureAction_ActivateStyleTheme final : public UGameFeatureAction
{
public:
	class FName                                   ThemeName;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_ActivateStyleTheme">();
	}
	static class UGameFeatureAction_ActivateStyleTheme* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_ActivateStyleTheme>();
	}
};

// Class StyleSheets.GameFeatureAction_RegisterStyleThemes
// 0x0020 (0x0048 - 0x0028)
class UGameFeatureAction_RegisterStyleThemes final : public UGameFeatureAction
{
public:
	TSoftObjectPtr<class UStyleThemeConfig>       StyleThemeConfig;                                  // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterStyleThemes">();
	}
	static class UGameFeatureAction_RegisterStyleThemes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterStyleThemes>();
	}
};

// Class StyleSheets.PropertyTweenContext
// 0x0008 (0x0030 - 0x0028)
class UPropertyTweenContext final : public UObject
{
public:
	class FName                                   PropertyPath;                                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyTweenContext">();
	}
	static class UPropertyTweenContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyTweenContext>();
	}
};

// Class StyleSheets.StyleAnimationProvider
// 0x0050 (0x0078 - 0x0028)
class UStyleAnimationProvider final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleAnimationProvider">();
	}
	static class UStyleAnimationProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleAnimationProvider>();
	}
};

// Class StyleSheets.StyleProvider
// 0x00E8 (0x0110 - 0x0028)
class UStyleProvider final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class UStyleRuleTree>          StyleRuleTree;                                     // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UStyleAnimationProvider> StyleAnimationProvider;                            // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0xB8];                                      // 0x0058(0x00B8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleProvider">();
	}
	static class UStyleProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleProvider>();
	}
};

// Class StyleSheets.StyleRule
// 0x0138 (0x0160 - 0x0028)
class UStyleRule final : public UObject
{
public:
	TArray<class UStyleRule*>                     Children;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FStyleSelectorItem                     StyleSelectorItem;                                 // 0x0038(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UStyleRule>              Parent;                                            // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStyleClass                            style;                                             // 0x0050(0x0108)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleRule">();
	}
	static class UStyleRule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleRule>();
	}
};

// Class StyleSheets.StyleRuleTree
// 0x0040 (0x0068 - 0x0028)
class UStyleRuleTree final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleRuleTree">();
	}
	static class UStyleRuleTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleRuleTree>();
	}
};

// Class StyleSheets.StyleSheet
// 0x0020 (0x0048 - 0x0028)
class UStyleSheet final : public UObject
{
public:
	TArray<class UStyleRule*>                     StyleRules;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FStyleSheetSettings                    Settings;                                          // 0x0038(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleSheet">();
	}
	static class UStyleSheet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleSheet>();
	}
};

// Class StyleSheets.StyleSheetCollection
// 0x0010 (0x0040 - 0x0030)
class UStyleSheetCollection final : public UDataAsset
{
public:
	TArray<class UStyleSheet*>                    StyleSheets;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleSheetCollection">();
	}
	static class UStyleSheetCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleSheetCollection>();
	}
};

// Class StyleSheets.StyleTagFinder
// 0x0000 (0x0028 - 0x0028)
class UStyleTagFinder final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleTagFinder">();
	}
	static class UStyleTagFinder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleTagFinder>();
	}
};

// Class StyleSheets.StyleThemeConfig
// 0x0010 (0x0040 - 0x0030)
class UStyleThemeConfig final : public UDataAsset
{
public:
	TArray<struct FStyleThemeConfigEntry>         Entries;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleThemeConfig">();
	}
	static class UStyleThemeConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleThemeConfig>();
	}
};

// Class StyleSheets.StyleThemeProvider
// 0x00A8 (0x00D0 - 0x0028)
class UStyleThemeProvider final : public UObject
{
public:
	TWeakObjectPtr<class UStyleRuleTree>          StyleRuleTree;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TWeakObjectPtr<class UObject>, class UStyleThemeConfig*> ThemeConfigSourceMap;              // 0x0030(0x0050)(Edit, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSet<class FName>                             ActiveThemeNames;                                  // 0x0080(0x0050)(Edit, EditConst, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleThemeProvider">();
	}
	static class UStyleThemeProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleThemeProvider>();
	}
};

// Class StyleSheets.WidgetBlueprintGeneratedClassExtension_StyleClass
// 0x0050 (0x0078 - 0x0028)
class UWidgetBlueprintGeneratedClassExtension_StyleClass final : public UWidgetBlueprintGeneratedClassExtension
{
public:
	TMap<class FName, struct FStyleTag>           WidgetStyleTagMap;                                 // 0x0028(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBlueprintGeneratedClassExtension_StyleClass">();
	}
	static class UWidgetBlueprintGeneratedClassExtension_StyleClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBlueprintGeneratedClassExtension_StyleClass>();
	}
};

// Class StyleSheets.StylableWidget
// 0x0000 (0x0000 - 0x0000)
class IStylableWidget final
{
public:
	void BP_OnWidgetStyled();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StylableWidget">();
	}
	static class IStylableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IStylableWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class StyleSheets.StyleSheetsSettings
// 0x0038 (0x0060 - 0x0028)
class UStyleSheetsSettings final : public UObject
{
public:
	TArray<struct FWidgetTypeEntry>               WidgetTypes;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UStyleThemeConfig>       StyleThemeConfig;                                  // 0x0038(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowAssigningStyleTagsToWidgets;                 // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleSheetsSettings">();
	}
	static class UStyleSheetsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleSheetsSettings>();
	}
};

// Class StyleSheets.StyleSheetsSubsystem
// 0x0030 (0x0060 - 0x0030)
class UStyleSheetsSubsystem final : public UEngineSubsystem
{
public:
	class UStyleTagFinder*                        EditorStyleTagFinder;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStyleRuleTree*                         StyleRuleTree;                                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStyleAnimationProvider*                StyleAnimationProvider;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStyleProvider*                         StyleProvider;                                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStyleThemeProvider*                    StyleThemeProvider;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStyleTagFinder*                        StyleTagFinder;                                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleSheetsSubsystem">();
	}
	static class UStyleSheetsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleSheetsSubsystem>();
	}
};

}

