#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SuperstormRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function SuperstormRuntime.TempestLightningComponent.GetCloudHeight
// 0x0004 (0x0004 - 0x0000)
struct TempestLightningComponent_GetCloudHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SuperstormRuntime.TempestLightningComponent.GetLightningRadius
// 0x0004 (0x0004 - 0x0000)
struct TempestLightningComponent_GetLightningRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SuperstormRuntime.TempestTornadoForcesComponent.OnVehicleInTornadoPlayerExit
// 0x0010 (0x0010 - 0x0000)
struct TempestTornadoForcesComponent_OnVehicleInTornadoPlayerExit final
{
public:
	const class AFortPlayerControllerAthena*      PlayerController;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SuperstormRuntime.TempestTornadoForcesComponent.IsActorInTornado
// 0x0010 (0x0010 - 0x0000)
struct TempestTornadoForcesComponent_IsActorInTornado final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

