#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: TempestRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum TempestRuntime.ETempestState
// NumValues: 0x0006
enum class ETempestState : uint8
{
	Unformed                                 = 0,
	Forming                                  = 1,
	Active                                   = 2,
	Dissipating                              = 3,
	Complete                                 = 4,
	ETempestState_MAX                        = 5,
};

// Enum TempestRuntime.ETempestMovementMode
// NumValues: 0x0003
enum class ETempestMovementMode : uint8
{
	EnvQuery                                 = 0,
	Path                                     = 1,
	ETempestMovementMode_MAX                 = 2,
};

// ScriptStruct TempestRuntime.TempestStateInfo
// 0x000C (0x000C - 0x0000)
struct FTempestStateInfo final
{
public:
	ETempestState                                 CurrentState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TempestRuntime.TempestReplicatedMovementData
// 0x0050 (0x0050 - 0x0000)
struct FTempestReplicatedMovementData final
{
public:
	struct FVector                                TargetServerLocation;                              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LastServerLocation;                                // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  LastServerRotation;                                // 0x0030(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TempestRuntime.TempestStateChangeTimerInfo
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTempestStateChangeTimerInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

