#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_728444048e50a811
// 0x0014 (0x0014 - 0x0000)
struct FPropertyBag_728444048e50a811 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         LineHeightPercentage;                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_95eae4f0b76bf8f9
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_95eae4f0b76bf8f9 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         LineHeightPercentage;                              // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// PropertyBag Transient.PropertyBag_3b8d792c3fb4b919
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_3b8d792c3fb4b919 final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_1d576f0bf0a0bc27
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_1d576f0bf0a0bc27 final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_2aa7b5f76e31ee34
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_2aa7b5f76e31ee34 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// PropertyBag Transient.PropertyBag_166374e43dafbaf4
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_166374e43dafbaf4 final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_95eae6f61e8f9bf6
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_95eae6f61e8f9bf6 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// PropertyBag Transient.PropertyBag_39828d2ae4c7e294
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_39828d2ae4c7e294 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_701940fca96571dc
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_701940fca96571dc final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_bec14812243683f0
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_bec14812243683f0 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontObject_0;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_0;                                // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_0;                                            // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing_0;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount_0;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_18fb1b5328f99e09
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_18fb1b5328f99e09 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         LineHeightPercentage;                              // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_515fd8a60d91e2b2
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_515fd8a60d91e2b2 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_265543d4637fa027
// 0x000C (0x000C - 0x0000)
struct FPropertyBag_265543d4637fa027 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_b6fa43c0283b7ed3
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_b6fa43c0283b7ed3 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_a1c0c264cd9a9c7b
// 0x000C (0x000C - 0x0000)
struct FPropertyBag_a1c0c264cd9a9c7b final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_575fb98e50bd42c6
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_575fb98e50bd42c6 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_be9b4f366ff2506a
// 0x0090 (0x0090 - 0x0000)
struct FPropertyBag_be9b4f366ff2506a final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontObject_0;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_0;                                // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_0;                                            // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing_0;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount_0;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontObject_1;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_1;                                // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_1;                                            // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing_1;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount_1;                                      // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontObject_2;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_2;                                // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_2;                                            // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing_2;                                   // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount_2;                                      // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontObject_3;                                      // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_3;                                // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_3;                                            // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing_3;                                   // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount_3;                                      // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontObject_4;                                      // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_4;                                // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_4;                                            // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing_4;                                   // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount_4;                                      // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_f9b351b9cdc0ddc
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_f9b351b9cdc0ddc final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_f0826efa15184af
// 0x1188 (0x1188 - 0x0000)
struct FPropertyBag_f0826efa15184af final
{
public:
	bool                                          RigVMModel___get_largest_val_index_FNC_2_2_1_1_1_is_activated; // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RigVMModel___get_largest_val_index_FNC_2_2_1_1_1_out_index; // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GetCurveValue_Value; // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x000C(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GetCurveValue_Curve; // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GetCurveValue_Valid; // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GetCurveValue_CachedCurveIndex; // 0x0020(0x0010)(Edit)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_RigVMFunction_MathBoolAnd_Result; // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GreaterEqual_Result; // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GreaterEqual_A; // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GreaterEqual_1_Result; // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_GreaterEqual_1_A; // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalVariable__get_largest_val_index_FNC_tmp_val;  // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_4_1_2_2_1_1_1_BlockToRun; // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___get_largest_val_index_FNC_2_2_1_1_is_activated; // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RigVMModel___get_largest_val_index_FNC_2_2_1_1_out_index; // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GetCurveValue_Value; // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0080(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GetCurveValue_Curve; // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GetCurveValue_Valid; // 0x008C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GetCurveValue_CachedCurveIndex; // 0x0090(0x0010)(Edit)
	bool                                          get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_RigVMFunction_MathBoolAnd_Result; // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GreaterEqual_Result; // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GreaterEqual_A; // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GreaterEqual_1_Result; // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_GreaterEqual_1_A; // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_4_1_2_2_1_1_BlockToRun; // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___is_expr_activated_FNC_11_2_2_1_1_2_3_1_Output; // 0x00DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_GetCurveValue_Value; // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x00E4(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_GetCurveValue_Curve; // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_GetCurveValue_Valid; // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x00F8(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_Less_Result; // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_Less_A; // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_GreaterEqual_Result; // 0x011C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_GreaterEqual_A; // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0134(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___get_largest_val_index_FNC_2_2_1_is_activated; // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RigVMModel___get_largest_val_index_FNC_2_2_1_out_index; // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GetCurveValue_Value; // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x014C(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GetCurveValue_Curve; // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GetCurveValue_Valid; // 0x0158(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GetCurveValue_CachedCurveIndex; // 0x0160(0x0010)(Edit)
	bool                                          get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_RigVMFunction_MathBoolAnd_Result; // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GreaterEqual_Result; // 0x0171(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GreaterEqual_A; // 0x0178(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GreaterEqual_1_Result; // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_GreaterEqual_1_A; // 0x0188(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0198(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x019C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x01A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x01A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_4_1_2_2_1_BlockToRun; // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_4_2_2_1_1_2_3_1_BlockToRun; // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___is_expr_activated_FNC_11_2_2_1_1_2_3_Output; // 0x01B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_GetCurveValue_Value; // 0x01B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x01B8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_GetCurveValue_Curve; // 0x01C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_GetCurveValue_Valid; // 0x01C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x01C8(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_Less_Result; // 0x01D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_Less_A; // 0x01E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x01E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_GreaterEqual_Result; // 0x01EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_GreaterEqual_A; // 0x01F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x01F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x01FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0200(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0204(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x020C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___get_largest_val_index_FNC_2_2_is_activated; // 0x0210(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RigVMModel___get_largest_val_index_FNC_2_2_out_index; // 0x0214(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GetCurveValue_Value; // 0x0218(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x021C(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GetCurveValue_Curve; // 0x0224(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GetCurveValue_Valid; // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GetCurveValue_CachedCurveIndex; // 0x0230(0x0010)(Edit)
	bool                                          get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_RigVMFunction_MathBoolAnd_Result; // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GreaterEqual_Result; // 0x0241(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GreaterEqual_A; // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GreaterEqual_1_Result; // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_GreaterEqual_1_A; // 0x0258(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0264(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0268(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x026C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x0274(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_4_1_2_2_BlockToRun; // 0x0278(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_4_2_2_1_1_2_3_BlockToRun; // 0x027C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___get_largest_val_index_FNC_2_2_1_1_1_1_is_activated; // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RigVMModel___get_largest_val_index_FNC_2_2_1_1_1_1_out_index; // 0x0284(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GetCurveValue_Value; // 0x0288(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x028C(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GetCurveValue_Curve; // 0x0294(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GetCurveValue_Valid; // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GetCurveValue_CachedCurveIndex; // 0x02A0(0x0010)(Edit)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_RigVMFunction_MathBoolAnd_Result; // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GreaterEqual_Result; // 0x02B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GreaterEqual_A; // 0x02B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GreaterEqual_1_Result; // 0x02C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_GreaterEqual_1_A; // 0x02C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x02D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x02D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x02DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_1_1___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_4_1_2_2_1_1_1_1_BlockToRun; // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___get_largest_val_index_FNC_2_2_1_1_2_is_activated; // 0x02EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RigVMModel___get_largest_val_index_FNC_2_2_1_1_2_out_index; // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GetCurveValue_Value; // 0x02F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x02F8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GetCurveValue_Curve; // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GetCurveValue_Valid; // 0x0304(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCachedRigElement>              get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GetCurveValue_CachedCurveIndex; // 0x0308(0x0010)(Edit)
	bool                                          get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_RigVMFunction_MathBoolAnd_Result; // 0x0318(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GreaterEqual_Result; // 0x0319(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GreaterEqual_A; // 0x0320(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GreaterEqual_1_Result; // 0x0328(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_GreaterEqual_1_A; // 0x0330(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0338(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x033C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0344(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC_2_2_1_1_2___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
