#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UIChart

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum UIChart.EWidgetStateComponentUnloadDefaultBehavior
// NumValues: 0x0003
enum class EWidgetStateComponentUnloadDefaultBehavior : uint32
{
	WaitForAnimations                        = 0,
	DoNotWaitForAnimations                   = 1,
	EWidgetStateComponentUnloadDefaultBehavior_MAX = 2,
};

// Enum UIChart.EUIStateTransitionUrgency
// NumValues: 0x0003
enum class EUIStateTransitionUrgency : uint8
{
	Normal                                   = 0,
	High                                     = 1,
	EUIStateTransitionUrgency_MAX            = 2,
};

// Enum UIChart.EUIStateAutomationType
// NumValues: 0x0003
enum class EUIStateAutomationType : uint8
{
	Initial                                  = 0,
	Continual                                = 1,
	EUIStateAutomationType_MAX               = 2,
};

// Enum UIChart.EUIStateChartContextConditionType
// NumValues: 0x000E
enum class EUIStateChartContextConditionType : uint32
{
	IsEmpty                                  = 0,
	IsNotEmpty                               = 1,
	IsEqualTo                                = 2,
	IsNotEqualTo                             = 3,
	IsGreaterThan                            = 4,
	IsGreaterThanOrEqualTo                   = 5,
	IsLessThan                               = 6,
	IsLessThanOrEqualTo                      = 7,
	IsTrue                                   = 8,
	IsNotTrue                                = 9,
	StartsWith                               = 10,
	EndsWith                                 = 11,
	Contains                                 = 12,
	EUIStateChartContextConditionType_MAX    = 13,
};

// Enum UIChart.EUIChartRegionTransitionScope
// NumValues: 0x0003
enum class EUIChartRegionTransitionScope : uint8
{
	ThisRegionOnly                           = 0,
	ThisRegionOrChildRegions                 = 1,
	EUIChartRegionTransitionScope_MAX        = 2,
};

// Enum UIChart.EStateComponentStatus
// NumValues: 0x0009
enum class EStateComponentStatus : uint32
{
	Inactive                                 = 0,
	PreparingForLoad                         = 1,
	Loading                                  = 2,
	DoneLoading                              = 3,
	Operational                              = 4,
	PreparingForUnload                       = 5,
	Unloading                                = 6,
	DoneUnloading                            = 7,
	EStateComponentStatus_MAX                = 8,
};

// Enum UIChart.EStateChartResourceScope
// NumValues: 0x0004
enum class EStateChartResourceScope : uint32
{
	StateChart                               = 0,
	Player                                   = 1,
	Global                                   = 2,
	EStateChartResourceScope_MAX             = 3,
};

// ScriptStruct UIChart.UIStateChartTransitionOperationParameters
// 0x0028 (0x0028 - 0x0000)
struct FUIStateChartTransitionOperationParameters final
{
public:
	struct FGameplayTagContainer                  AnimationHints;                                    // 0x0000(0x0020)(Protected, NativeAccessSpecifierProtected)
	EUIStateTransitionUrgency                     Urgency;                                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIChart.ContextSetterSetEntry
// 0x0018 (0x0018 - 0x0000)
struct FContextSetterSetEntry final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.ContextSetterClearEntry
// 0x0004 (0x0004 - 0x0000)
struct FContextSetterClearEntry final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.ContextSetterChanges
// 0x0020 (0x0020 - 0x0000)
struct FContextSetterChanges final
{
public:
	TArray<struct FContextSetterSetEntry>         ValuesToSet;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FContextSetterClearEntry>       ValuesToClear;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.UIStateComponentInstanceStack
// 0x0010 (0x0010 - 0x0000)
struct FUIStateComponentInstanceStack final
{
public:
	TArray<class UStackingUIStateComponent*>      InstanceStack;                                     // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.UIStateConfigurationChildReference
// 0x0004 (0x0004 - 0x0000)
struct FUIStateConfigurationChildReference final
{
public:
	int32                                         ChildStateId;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.UIStateChartContextCondition
// 0x0018 (0x0018 - 0x0000)
struct FUIStateChartContextCondition final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIStateChartContextConditionType             ConditionType;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ComparisonConstant;                                // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.UIStateAutomationRule
// 0x0018 (0x0018 - 0x0000)
struct FUIStateAutomationRule final
{
public:
	TArray<struct FUIStateChartContextCondition>  ContextConditions;                                 // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FUIStateConfigurationChildReference    ChildStateReference;                               // 0x0010(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIChart.UIStateTransitionData
// 0x000C (0x000C - 0x0000)
struct FUIStateTransitionData final
{
public:
	struct FGameplayTag                           TriggerTag;                                        // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SourceStateId;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetStateId;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.UIStateChartContextChangeSet
// 0x0050 (0x0050 - 0x0000)
struct FUIStateChartContextChangeSet final
{
public:
	TMap<struct FGameplayTag, class FString>      Changes;                                           // 0x0000(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct UIChart.UIStateChartContextEntryOverride
// 0x0028 (0x0028 - 0x0000)
struct FUIStateChartContextEntryOverride final
{
public:
	class FString                                 OverrideValue;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIChart.UIStateChartManagerChartDeactivationRequest
// 0x0088 (0x0088 - 0x0000)
struct alignas(0x08) FUIStateChartManagerChartDeactivationRequest final
{
public:
	uint8                                         Pad_0[0x88];                                       // 0x0000(0x0088)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIChart.UIStateRelayBaton
// 0x0028 (0x0028 - 0x0000)
struct FUIStateRelayBaton final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UUIStateComponent*                      OfferingComponent;                                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUIStateComponent>          OfferingComponentType;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIStateComponentConfiguration*         OfferingComponentConfiguration;                    // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIChart.UIStateRelay
// 0x0028 (0x0028 - 0x0000)
struct FUIStateRelay final
{
public:
	TArray<struct FUIStateRelayBaton>             AvailableBatons;                                   // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FUIStateRelayBaton>             ClaimedBatons;                                     // 0x0010(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

