#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UIFramework

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// Enum UIFramework.EUIFrameworkGameLayerType
// NumValues: 0x0003
enum class EUIFrameworkGameLayerType : uint8
{
	Viewport                                 = 0,
	PlayerScreen                             = 1,
	EUIFrameworkGameLayerType_MAX            = 2,
};

// Enum UIFramework.EUIFrameworkInputMode
// NumValues: 0x0003
enum class EUIFrameworkInputMode : uint8
{
	UI                                       = 0,
	Game                                     = 1,
	EUIFrameworkInputMode_MAX                = 2,
};

// ScriptStruct UIFramework.UIFrameworkSimpleEventArgument
// 0x0010 (0x0010 - 0x0000)
struct FUIFrameworkSimpleEventArgument
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIFrameworkWidget*                     Sender;                                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIFramework.UIFrameworkClickEventArgument
// 0x0000 (0x0010 - 0x0010)
struct FUIFrameworkClickEventArgument final : public FUIFrameworkSimpleEventArgument
{
};

// ScriptStruct UIFramework.UIFrameworkWidgetOwner
// 0x0018 (0x0018 - 0x0000)
struct FUIFrameworkWidgetOwner final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameInstance*                          GameInstance;                                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIFramework.UIFrameworkParentWidget
// 0x0010 (0x0010 - 0x0000)
struct FUIFrameworkParentWidget final
{
public:
	class UObject*                                Parent;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIFramework.UIFrameworkWidgetId
// 0x0008 (0x0008 - 0x0000)
struct FUIFrameworkWidgetId final
{
public:
	int64                                         Key;                                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkSlotBase
// 0x001C (0x0028 - 0x000C)
struct FUIFrameworkSlotBase : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUIFrameworkWidget*                     Widget;                                            // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUIFrameworkWidgetId                   WidgetId;                                          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUIFrameworkWidgetId                   LocalPreviousWidgetId;                             // 0x0020(0x0008)(RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkSimpleSlot
// 0x0018 (0x0040 - 0x0028)
struct FUIFrameworkSimpleSlot final : public FUIFrameworkSlotBase
{
public:
	struct FMargin                                Padding;                                           // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIFramework.UIFrameworkWidgetTreeEntry
// 0x0024 (0x0030 - 0x000C)
struct FUIFrameworkWidgetTreeEntry final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUIFrameworkWidget*                     Parent;                                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIFrameworkWidget*                     Child;                                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUIFrameworkWidgetId                   ParentID;                                          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUIFrameworkWidgetId                   ChildId;                                           // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UIFramework.UIFrameworkWidgetTree
// 0x00F0 (0x01F8 - 0x0108)
struct FUIFrameworkWidgetTree final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x30];                                     // 0x0108(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUIFrameworkWidgetTreeEntry>    Entries;                                           // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class AActor*                                 ReplicatedOwner;                                   // 0x0148(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0xA8];                                     // 0x0150(0x00A8)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIFramework.UIFrameworkGameLayerSlot
// 0x0008 (0x0030 - 0x0028)
struct FUIFrameworkGameLayerSlot final : public FUIFrameworkSlotBase
{
public:
	int32                                         ZOrder;                                            // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIFrameworkInputMode                         InputMode;                                         // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIFrameworkGameLayerType                     Type;                                              // 0x002D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIFramework.UIFrameworkGameLayerSlotList
// 0x0018 (0x0120 - 0x0108)
struct FUIFrameworkGameLayerSlotList final : public FFastArraySerializer
{
public:
	TArray<struct FUIFrameworkGameLayerSlot>      Entries;                                           // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UUIFrameworkPlayerComponent*            Owner;                                             // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkCanvasBoxSlot
// 0x0048 (0x0070 - 0x0028)
struct FUIFrameworkCanvasBoxSlot final : public FUIFrameworkSlotBase
{
public:
	struct FAnchors                               Anchors;                                           // 0x0028(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                Offsets;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              Alignment;                                         // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZOrder;                                            // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSizeToContent;                                    // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIFramework.UIFrameworkCanvasBoxSlotList
// 0x0018 (0x0120 - 0x0108)
struct FUIFrameworkCanvasBoxSlotList final : public FFastArraySerializer
{
public:
	TArray<struct FUIFrameworkCanvasBoxSlot>      Slots;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UUIFrameworkCanvasBox*                  Owner;                                             // 0x0118(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkImageBlockData
// 0x0040 (0x0040 - 0x0000)
struct FUIFrameworkImageBlockData final
{
public:
	struct FLinearColor                           Tint;                                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ResourceObject;                                    // 0x0010(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              DesiredSize;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushTileType                           Tiling;                                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTextureSize;                                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIFramework.UIFrameworkOverlaySlot
// 0x0018 (0x0040 - 0x0028)
struct FUIFrameworkOverlaySlot final : public FUIFrameworkSlotBase
{
public:
	struct FMargin                                Padding;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Index;                                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkOverlaySlotList
// 0x0018 (0x0120 - 0x0108)
struct FUIFrameworkOverlaySlotList final : public FFastArraySerializer
{
public:
	TArray<struct FUIFrameworkOverlaySlot>        Slots;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UUIFrameworkOverlay*                    Owner;                                             // 0x0118(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkStackBoxSlot
// 0x0020 (0x0048 - 0x0028)
struct FUIFrameworkStackBoxSlot final : public FUIFrameworkSlotBase
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMargin                                Padding;                                           // 0x002C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateChildSize                        Size;                                              // 0x003C(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkStackBoxSlotList
// 0x0018 (0x0120 - 0x0108)
struct FUIFrameworkStackBoxSlotList final : public FFastArraySerializer
{
public:
	TArray<struct FUIFrameworkStackBoxSlot>       Slots;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UUIFrameworkStackBox*                   Owner;                                             // 0x0118(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UIFramework.UIFrameworkUserWidgetSlot
// 0x0008 (0x0030 - 0x0028)
struct FUIFrameworkUserWidgetSlot final : public FUIFrameworkSlotBase
{
public:
	class FName                                   SlotName;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UIFramework.UIFrameworkUserWidgetSlotList
// 0x0018 (0x0120 - 0x0108)
struct FUIFrameworkUserWidgetSlotList final : public FFastArraySerializer
{
public:
	TArray<struct FUIFrameworkUserWidgetSlot>     Slots;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UUIFrameworkUserWidget*                 Owner;                                             // 0x0118(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

}

