#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UIFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UIFramework_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ModelViewViewModel_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function UIFramework.UIFrameworkPlayerComponent.AddWidget
// 0x0030 (0x0030 - 0x0000)
struct UIFrameworkPlayerComponent_AddWidget final
{
public:
	struct FUIFrameworkGameLayerSlot              Widget;                                            // 0x0000(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkPlayerComponent.RemoveWidget
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkPlayerComponent_RemoveWidget final
{
public:
	class UUIFrameworkWidget*                     Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkPlayerComponent.ServerRemoveWidgetRootFromTree
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkPlayerComponent_ServerRemoveWidgetRootFromTree final
{
public:
	struct FUIFrameworkWidgetId                   WidgetId;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkButton.ServerClick
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkButton_ServerClick final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkButton.SetContent
// 0x0040 (0x0040 - 0x0000)
struct UIFrameworkButton_SetContent final
{
public:
	struct FUIFrameworkSimpleSlot                 Content;                                           // 0x0000(0x0040)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkButton.GetContent
// 0x0040 (0x0040 - 0x0000)
struct UIFrameworkButton_GetContent final
{
public:
	struct FUIFrameworkSimpleSlot                 ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkCanvasBox.AddWidget
// 0x0070 (0x0070 - 0x0000)
struct UIFrameworkCanvasBox_AddWidget final
{
public:
	struct FUIFrameworkCanvasBoxSlot              Widget;                                            // 0x0000(0x0070)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkCanvasBox.RemoveWidget
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkCanvasBox_RemoveWidget final
{
public:
	class UUIFrameworkWidget*                     Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkColorBlock.SetColor
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkColorBlock_SetColor final
{
public:
	struct FLinearColor                           Tint;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkColorBlock.SetDesiredSize
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkColorBlock_SetDesiredSize final
{
public:
	struct FVector2f                              DesiredSize_0;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkColorBlock.GetColor
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkColorBlock_GetColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkColorBlock.GetDesiredSize
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkColorBlock_GetDesiredSize final
{
public:
	struct FVector2f                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.SetDesiredSize
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkImageBlock_SetDesiredSize final
{
public:
	struct FVector2f                              DesiredSize;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.SetMaterial
// 0x0020 (0x0020 - 0x0000)
struct UIFrameworkImageBlock_SetMaterial final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      Material;                                          // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.SetTexture
// 0x0028 (0x0028 - 0x0000)
struct UIFrameworkImageBlock_SetTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTextureSize;                                   // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UIFramework.UIFrameworkImageBlock.SetTiling
// 0x0001 (0x0001 - 0x0000)
struct UIFrameworkImageBlock_SetTiling final
{
public:
	ESlateBrushTileType                           OverflowPolicy;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.SetTint
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkImageBlock_SetTint final
{
public:
	struct FLinearColor                           Tint;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.GeResourceObject
// 0x0020 (0x0020 - 0x0000)
struct UIFrameworkImageBlock_GeResourceObject final
{
public:
	TSoftObjectPtr<class UObject>                 ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.GetDesiredSize
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkImageBlock_GetDesiredSize final
{
public:
	struct FVector2f                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.GetTiling
// 0x0001 (0x0001 - 0x0000)
struct UIFrameworkImageBlock_GetTiling final
{
public:
	ESlateBrushTileType                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkImageBlock.GetTint
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkImageBlock_GetTint final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkOverlay.AddWidget
// 0x0040 (0x0040 - 0x0000)
struct UIFrameworkOverlay_AddWidget final
{
public:
	struct FUIFrameworkOverlaySlot                Widget;                                            // 0x0000(0x0040)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkOverlay.RemoveWidget
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkOverlay_RemoveWidget final
{
public:
	class UUIFrameworkWidget*                     Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkSimpleButton.OnClick
// 0x0001 (0x0001 - 0x0000)
struct UIFrameworkSimpleButton_OnClick final
{
public:
	struct FMVVMEventField                        Field;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkSimpleButton.ServerClick
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkSimpleButton_ServerClick final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkStackBox.AddWidget
// 0x0048 (0x0048 - 0x0000)
struct UIFrameworkStackBox_AddWidget final
{
public:
	struct FUIFrameworkStackBoxSlot               Widget;                                            // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkStackBox.RemoveWidget
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkStackBox_RemoveWidget final
{
public:
	class UUIFrameworkWidget*                     Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBase.SetJustification
// 0x0001 (0x0001 - 0x0000)
struct UIFrameworkTextBase_SetJustification final
{
public:
	ETextJustify                                  Justification_0;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBase.SetOverflowPolicy
// 0x0001 (0x0001 - 0x0000)
struct UIFrameworkTextBase_SetOverflowPolicy final
{
public:
	ETextOverflowPolicy                           OverflowPolicy_0;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBase.SetTextColor
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkTextBase_SetTextColor final
{
public:
	struct FLinearColor                           TextColor_0;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBase.GetJustification
// 0x0001 (0x0001 - 0x0000)
struct UIFrameworkTextBase_GetJustification final
{
public:
	ETextJustify                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBase.GetOverflowPolicy
// 0x0001 (0x0001 - 0x0000)
struct UIFrameworkTextBase_GetOverflowPolicy final
{
public:
	ETextOverflowPolicy                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBase.GetText
// 0x0018 (0x0018 - 0x0000)
struct UIFrameworkTextBase_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBase.GetTextColor
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkTextBase_GetTextColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBlock.SetShadowColor
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkTextBlock_SetShadowColor final
{
public:
	struct FLinearColor                           ShadowColor_0;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBlock.SetShadowOffset
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkTextBlock_SetShadowOffset final
{
public:
	struct FVector2f                              ShadowOffset_0;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBlock.GetShadowColor
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkTextBlock_GetShadowColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkTextBlock.GetShadowOffset
// 0x0008 (0x0008 - 0x0000)
struct UIFrameworkTextBlock_GetShadowOffset final
{
public:
	struct FVector2f                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkUserWidget.SetNamedSlot
// 0x0010 (0x0010 - 0x0000)
struct UIFrameworkUserWidget_SetNamedSlot final
{
public:
	class FName                                   SlotName;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUIFrameworkWidget*                     Widget;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIFramework.UIFrameworkUserWidget.SetWidgetClass
// 0x0020 (0x0020 - 0x0000)
struct UIFrameworkUserWidget_SetWidgetClass final
{
public:
	TSoftClassPtr<class UClass>                   Value;                                             // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

