#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VaultingCodeRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "VaultingCodeRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function VaultingCodeRuntime.FortMovementMode_ExtLogicHurdle.BP_GetAnimationMontageInformation
// 0x0048 (0x0048 - 0x0000)
struct FortMovementMode_ExtLogicHurdle_BP_GetAnimationMontageInformation final
{
public:
	struct FSynchedActionInfo                     SynchedActionInfo;                                 // 0x0000(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EHurdleType                                   Type;                                              // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNarrowOpening;                                  // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCrouched;                                       // 0x0032(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class UAnimMontage*                           AnimMontage;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSectionName;                                  // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MontageMiddleSectionName;                          // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.FortMovementMode_ExtLogicHurdle.IsContextualActionPrototypeActive
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicHurdle_IsContextualActionPrototypeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_HandleHurdleStarted
// 0x0160 (0x0160 - 0x0000)
struct HurdleComponent_BP_HandleHurdleStarted final
{
public:
	struct FHurdleTargetingData                   TargetingData;                                     // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FSynchedActionInfo                     SynchedActionInfo;                                 // 0x0130(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleOwnerJumpInput
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_HandleOwnerJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleOwnerMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct HurdleComponent_HandleOwnerMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function VaultingCodeRuntime.HurdleComponent.HandleOwnerTeleported
// 0x0008 (0x0008 - 0x0000)
struct HurdleComponent_HandleOwnerTeleported final
{
public:
	class AFortPawn*                              TeleportedOwner;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleTargetingDataValid
// 0x0130 (0x0130 - 0x0000)
struct HurdleComponent_HandleTargetingDataValid final
{
public:
	struct FHurdleTargetingData                   TargetingData;                                     // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.OnPlayerStatePawnSet
// 0x0018 (0x0018 - 0x0000)
struct HurdleComponent_OnPlayerStatePawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.RegisterMutatorUpdatedDelegate
// 0x0008 (0x0008 - 0x0000)
struct HurdleComponent_RegisterMutatorUpdatedDelegate final
{
public:
	class APawn*                                  AffectedPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.ServerStartHurdle
// 0x0078 (0x0078 - 0x0000)
struct HurdleComponent_ServerStartHurdle final
{
public:
	struct FReplicatedHurdleTargetingData         InReplicatedTargetingData;                         // 0x0000(0x0070)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ClientLastTeleportTime;                            // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_CanStartHurdle
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_BP_CanStartHurdle final
{
public:
	bool                                          OutCanStartHurdle;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.IsContextualActionPrototypeActive
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_IsContextualActionPrototypeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.ShouldShowHurdleIndicator
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_ShouldShowHurdleIndicator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleLibrary.PerformHurdleTargeting
// 0x01D0 (0x01D0 - 0x0000)
struct HurdleLibrary_PerformHurdleTargeting final
{
public:
	const class ACharacter*                       Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHurdleInputConfigCache                HurdleInputConfig;                                 // 0x0008(0x008C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHurdleTargetingData                   OutTargetingData;                                  // 0x0098(0x0130)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bIsAutoHurdle;                                     // 0x01C8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01C9(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

