#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseMovement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum VerseMovement.ENetPhysicsMoveTriggerType
// NumValues: 0x0006
enum class ENetPhysicsMoveTriggerType : uint8
{
	Input                                    = 0,
	Constraint                               = 1,
	Physics                                  = 2,
	Trace                                    = 3,
	Constant                                 = 4,
	ENetPhysicsMoveTriggerType_MAX           = 5,
};

// Enum VerseMovement.ENetPhysicsMoveResponseType
// NumValues: 0x0003
enum class ENetPhysicsMoveResponseType : uint8
{
	Linear                                   = 0,
	Angular                                  = 1,
	ENetPhysicsMoveResponseType_MAX          = 2,
};

// Enum VerseMovement.ENetPhysicsMoveResponseFrame
// NumValues: 0x0004
enum class ENetPhysicsMoveResponseFrame : uint8
{
	Absolute                                 = 0,
	Object                                   = 1,
	Camera                                   = 2,
	ENetPhysicsMoveResponseFrame_MAX         = 3,
};

// Enum VerseMovement.ENetPhysicsMoveResponseEffect
// NumValues: 0x0004
enum class ENetPhysicsMoveResponseEffect : uint8
{
	Force                                    = 0,
	VelocityChange                           = 1,
	Transform                                = 2,
	ENetPhysicsMoveResponseEffect_MAX        = 3,
};

// Enum VerseMovement.ENetPhysicsMoveResponseModifier
// NumValues: 0x0006
enum class ENetPhysicsMoveResponseModifier : uint8
{
	Add                                      = 0,
	TargetTransform                          = 1,
	TargetVelocity                           = 2,
	OverrideTransform                        = 3,
	OverrideVelocity                         = 4,
	ENetPhysicsMoveResponseModifier_MAX      = 5,
};

// ScriptStruct VerseMovement.NetPhysicsMoveInputTriggerParams
// 0x0028 (0x0028 - 0x0000)
struct FNetPhysicsMoveInputTriggerParams final
{
public:
	bool                                          bIsAxis;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   Name;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            AxisToMagnitudeCurve;                              // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AccumulateAxisInput;                               // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector2D                              ClampAxis;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMovePhysicsTriggerParams
// 0x0018 (0x0018 - 0x0000)
struct FNetPhysicsMovePhysicsTriggerParams final
{
public:
	struct FVector                                SpeedInDirection;                                  // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMoveTraceTriggerParams
// 0x0050 (0x0050 - 0x0000)
struct FNetPhysicsMoveTraceTriggerParams final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseFrame                  Frame;                                             // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Length;                                            // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollisionResponseContainer            ResponseParams;                                    // 0x0021(0x0020)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bProportionalToHitDistance;                        // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            HitDistanceToMagnitudeCurve;                       // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMoveTrigger
// 0x0098 (0x0098 - 0x0000)
struct FNetPhysicsMoveTrigger final
{
public:
	ENetPhysicsMoveTriggerType                    Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FNetPhysicsMoveInputTriggerParams      InputParams;                                       // 0x0008(0x0028)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FNetPhysicsMovePhysicsTriggerParams    PhysicsParams;                                     // 0x0030(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FNetPhysicsMoveTraceTriggerParams      TraceParams;                                       // 0x0048(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMoveResponse
// 0x0050 (0x0050 - 0x0000)
struct FNetPhysicsMoveResponse final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            MagnitudeCurve;                                    // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseType                   Type;                                              // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseFrame                  Frame;                                             // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseEffect                 Effect;                                            // 0x002A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseModifier               Modifier;                                          // 0x002B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ClampVector;                                       // 0x0030(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetPhysicsMoveResponseFrame                  ClampFrame;                                        // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VerseMovement.NetPhysicsMoveConfigEntry
// 0x0030 (0x0030 - 0x0000)
struct FNetPhysicsMoveConfigEntry final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNetPhysicsMoveTrigger>         Triggers;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FNetPhysicsMoveResponse>        Responses;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMoveLimits
// 0x0080 (0x0080 - 0x0000)
struct FNetPhysicsMoveLimits final
{
public:
	bool                                          bClampVelocity;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                MaxVelocity;                                       // 0x0008(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampAngularVelocity;                             // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                MaxAngularVelocity;                                // 0x0028(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMaxPosition;                                 // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                MaxPosition;                                       // 0x0048(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMinPosition;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                MinPosition;                                       // 0x0068(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMoveInputCmd
// 0x0038 (0x0038 - 0x0000)
struct FNetPhysicsMoveInputCmd final
{
public:
	TArray<float>                                 AxisValues;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  ActionValues;                                      // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRotator                               ViewRotation;                                      // 0x0020(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMoveObject
// 0x0001 (0x0001 - 0x0000)
struct FNetPhysicsMoveObject final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseMovement.NetPhysicsMoveObjectLocal
// 0x0088 (0x0088 - 0x0000)
struct alignas(0x08) FNetPhysicsMoveObjectLocal final
{
public:
	uint8                                         Pad_0[0x88];                                       // 0x0000(0x0088)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

