#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VerseFortnite_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite.NPCCharacterModifier.BP_ModifySpawnComponentList
// 0x0010 (0x0010 - 0x0000)
struct NPCCharacterModifier_BP_ModifySpawnComponentList final
{
public:
	class UFortAthenaAISpawnerDataComponentList*  OutList;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ComponentOuter;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterModifier.BP_OnPreSpawned
// 0x0008 (0x0008 - 0x0000)
struct NPCCharacterModifier_BP_OnPreSpawned final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterModifier.BP_OnSpawned
// 0x0008 (0x0008 - 0x0000)
struct NPCCharacterModifier_BP_OnSpawned final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterModifier.BP_IsDataValid
// 0x0018 (0x0018 - 0x0000)
struct NPCCharacterModifier_BP_IsDataValid final
{
public:
	TArray<class FText>                           OutErrorMessages;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EDataValidationResult                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function VerseFortnite.NPCCharacterModifier.BP_IsNeededForPreview
// 0x0001 (0x0001 - 0x0000)
struct NPCCharacterModifier_BP_IsNeededForPreview final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterModifier.GetCharacterDefinition
// 0x0008 (0x0008 - 0x0000)
struct NPCCharacterModifier_GetCharacterDefinition final
{
public:
	class UNPCCharacterDefinition*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteMinigameTeamCollection.OnMinigameDestroyed
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteMinigameTeamCollection_OnMinigameDestroyed final
{
public:
	class AActor*                                 DestroyedMinigame;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteMinigameTeamCollection.OnMinigameSetUp
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteMinigameTeamCollection_OnMinigameSetUp final
{
public:
	class AFortMinigame*                          InMinigame;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.FortAthenaAISpawnerDataComponent_Verse.AddUniqueEntityComponent
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAISpawnerDataComponent_Verse_AddUniqueEntityComponent final
{
public:
	TSubclassOf<class UEntityComponent>           EntityComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.FortAthenaAISpawnerDataComponent_Verse.SetAIBehaviorScript
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAISpawnerDataComponent_Verse_SetAIBehaviorScript final
{
public:
	class UAIBehaviorScript*                      InAIBehaviorScript;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.LoadNPCCharacterDefinitionAsync.LoadCharacterDefinitionAsync
// 0x0040 (0x0040 - 0x0000)
struct LoadNPCCharacterDefinitionAsync_LoadCharacterDefinitionAsync final
{
public:
	class UObject*                                ContextObj;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNPCCharacterDefinition> CharacterDefinition;                               // 0x0008(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNPCCharacterModifier*>          AdditionalModifiers;                               // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class ULoadNPCCharacterDefinitionAsync*       ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.LoadAndCreateComponentListAsync.LoadAndCreateComponentListAsync
// 0x0048 (0x0048 - 0x0000)
struct LoadAndCreateComponentListAsync_LoadAndCreateComponentListAsync final
{
public:
	class UObject*                                ContextObj;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNPCCharacterDefinition> CharacterDefinition;                               // 0x0008(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNPCCharacterModifier*>          AdditionalModifiers;                               // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bForPreview;                                       // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class ULoadAndCreateComponentListAsync*       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterDefinition.CreateComponentList
// 0x0028 (0x0028 - 0x0000)
struct NPCCharacterDefinition_CreateComponentList final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNPCCharacterModifier*>          AdditionalModifiers;                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bForPreview;                                       // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortAthenaAISpawnerDataComponentList*  ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterDefinition.GetCharacterBlueprint
// 0x0018 (0x0018 - 0x0000)
struct NPCCharacterDefinition_GetCharacterBlueprint final
{
public:
	TArray<class UNPCCharacterModifier*>          AdditionalModifiers;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterDefinition.GetCharacterCID
// 0x0020 (0x0020 - 0x0000)
struct NPCCharacterDefinition_GetCharacterCID final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNPCCharacterModifier*>          AdditionalModifiers;                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UAthenaCharacterItemDefinition*   ReturnValue;                                       // 0x0018(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterDefinition.GetPreviewMesh
// 0x0030 (0x0030 - 0x0000)
struct NPCCharacterDefinition_GetPreviewMesh final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNPCCharacterModifier*>          AdditionalModifiers;                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FCharacterPreviewMesh>          OutCharacterPreviewMeshes;                         // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class APawn*                                  OutDefaultPawn;                                    // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterDefinition.GetRequiredAssets
// 0x0010 (0x0010 - 0x0000)
struct NPCCharacterDefinition_GetRequiredAssets final
{
public:
	TArray<struct FSoftObjectPath>                OutAssets;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterModifier_CosmeticSpawn.GetCharacterCosmetic
// 0x0020 (0x0020 - 0x0000)
struct NPCCharacterModifier_CosmeticSpawn_GetCharacterCosmetic final
{
public:
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> ReturnValue;                                // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterModifier_PatrolPath.GetPatrolPathToAssign
// 0x0010 (0x0010 - 0x0000)
struct NPCCharacterModifier_PatrolPath_GetPatrolPathToAssign final
{
public:
	class AActor*                                 ModifierOwner;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaPatrolPath*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteActorWrapper.OnActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteActorWrapper_OnActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortnitePlayspace.OnMinigamePlayerAdded
// 0x0038 (0x0038 - 0x0000)
struct VerseFortnitePlayspace_OnMinigamePlayerAdded final
{
public:
	struct FUniqueNetIdRepl                       UniqueNetId;                                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayer;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function VerseFortnite.VerseFortnitePlayspace.OnMinigameSetUp
// 0x0008 (0x0008 - 0x0000)
struct VerseFortnitePlayspace_OnMinigameSetUp final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterType_FromPreset.GetAIToSpawn
// 0x0020 (0x0020 - 0x0000)
struct NPCCharacterType_FromPreset_GetAIToSpawn final
{
public:
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.NPCCharacterType_FromPreset.GetAvailableAIs
// 0x0010 (0x0010 - 0x0000)
struct NPCCharacterType_FromPreset_GetAvailableAIs final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteCharacter.HandlePawnEliminated
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteCharacter_HandlePawnEliminated final
{
public:
	class AFortPlayerPawnAthena*                  EliminatedPawn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteCharacter.HandlePossessedPawnChanged
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteCharacter_HandlePossessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

