#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseColors

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseColors_structs.hpp"


namespace SDK
{

// VerseClass VerseColors.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseColors::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseColors.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseColors::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseColors::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseColors.Colors
// 0x0000 (0x0028 - 0x0028)
class UColors final : public UObject
{
public:
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R(const struct VerseColors::Ftuple_Lfloat_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R(const struct VerseColors::Ftuple_Lfloat_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R(const struct VerseColors::Ftuple_Lint_Mint_Mint_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	static struct VerseColors::Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);
	static struct VerseColors::Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R(const struct Ftuple_Lcolor_Mcolor_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R(const struct Ftuple_Lcolor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R(const struct Ftuple_Lcolor_Mint_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R(const struct Ftuple_Lfloat_Mcolor_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R(const struct Ftuple_Lint_Mcolor_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R(const struct Ftuple_Lcolor_Mcolor_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R(const struct Ftuple_Lcolor_Mcolor_R& __verse_0xB2CDDD72_Argument);
	static TOptional<struct FColors_color> _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R(const struct Ftuple_Lcolor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	static TOptional<struct FColors_color> _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R(const struct Ftuple_Lcolor_Mint_R& __verse_0xB2CDDD72_Argument);
	static struct FColors_color Colors_color_Factory();
	static struct FColors_color Colors_color_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Colors">();
	}
	static class UColors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColors>();
	}
};

// VerseClass VerseColors.Colors_NamedColors
// 0x0DC8 (0x0DF0 - 0x0028)
class UColors_NamedColors final : public UObject
{
public:
	struct FColors_color                          __verse_0x9FBDE6AE_AliceBlue;                      // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xB3F7599D_AntiqueWhite;                   // 0x0040(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x37EE68B4_Aqua;                           // 0x0058(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA52EBB79_Aquamarine;                     // 0x0070(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xD06EFB2A_Azure;                          // 0x0088(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x8CE5D6D0_Beige;                          // 0x00A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC6B3972A_Bisque;                         // 0x00B8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x65E4346F_Black;                          // 0x00D0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x513D3B5F_BlanchedAlmond;                 // 0x00E8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x80217580_Blue;                           // 0x0100(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x31D0653D_BlueViolet;                     // 0x0118(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xAD308F8F_Brown;                          // 0x0130(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xED3A42A8_Burlywood;                      // 0x0148(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x921A6303_CadetBlue;                      // 0x0160(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x9E2BDE1B_Chartreuse;                     // 0x0178(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x082AED19_Chocolate;                      // 0x0190(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x196BEF87_Coral;                          // 0x01A8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC6BCD84F_CornflowerBlue;                 // 0x01C0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEE818697_Cornsilk;                       // 0x01D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6733DEF7_Crimson;                        // 0x01F0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D925695_Cyan;                           // 0x0208(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x935B7248_DarkBlue;                       // 0x0220(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x3EE8515D_DarkCyan;                       // 0x0238(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5817F032_DarkGoldenrod;                  // 0x0250(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x916F3C35_DarkGray;                       // 0x0268(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x37F798B1_DarkGreen;                      // 0x0280(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6B6176B1_DarkGrey;                       // 0x0298(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x9A5F61FB_DarkKhaki;                      // 0x02B0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x97899EDF_DarkMagenta;                    // 0x02C8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC2E62C73_DarkOliveGreen;                 // 0x02E0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x7431D49D_DarkOrange;                     // 0x02F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA0C47F58_DarkOrchid;                     // 0x0310(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA3246E28_DarkRed;                        // 0x0328(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5A06EB6C_DarkSalmon;                     // 0x0340(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xF141484E_DarkSeaGreen;                   // 0x0358(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4167AB57_DarkSlateBlue;                  // 0x0370(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4353E52A_DarkSlateGray;                  // 0x0388(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xB95DAFAE_DarkSlateGrey;                  // 0x03A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x26DA5155_DarkTurquoise;                  // 0x03B8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x3E781A05_DarkViolet;                     // 0x03D0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x53E148EA_DeepPink;                       // 0x03E8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA474CD21_DeepSkyBlue;                    // 0x0400(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEC312FE8_DimGray;                        // 0x0418(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x163F656C_DimGrey;                        // 0x0430(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x617B6862_DodgerBlue;                     // 0x0448(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC636E104_Firebrick;                      // 0x0460(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x06164DB2_FloralWhite;                    // 0x0478(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4939E624_ForestGreen;                    // 0x0490(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x8069E472_Fuchsia;                        // 0x04A8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x71D0705F_Gainsboro;                      // 0x04C0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1EDD5A5B_GhostWhite;                     // 0x04D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x0363FA56_Gold;                           // 0x04F0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x13A0B098_Goldenrod;                      // 0x0508(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x82153BFD_Gray;                           // 0x0520(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x853EAC70_Green;                          // 0x0538(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x94CAEBA0_GreenYellow;                    // 0x0550(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x781B7179_Grey;                           // 0x0568(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6FB30324_Honeydew;                       // 0x0580(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D404B19_Hotpink;                        // 0x0598(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2CE09720_IndianRed;                      // 0x05B0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x180B2901_Indigo;                         // 0x05C8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1086E2EC_Ivory;                          // 0x05E0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2896553A_Khaki;                          // 0x05F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xB93AFCDC_Lavender;                       // 0x0610(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4CF8F931_LavenderBlush;                  // 0x0628(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x08B4792E_LawnGreen;                      // 0x0640(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xCC22276F_LemonChiffon;                   // 0x0658(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x607C97F4_LightBlue;                      // 0x0670(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x89B3D40E_LightCoral;                     // 0x0688(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xCDCFB4E1_LightCyan;                      // 0x06A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6C11FD65_LightGoldenrodYellow;           // 0x06B8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6248D989_LightGray;                      // 0x06D0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x15E697F9_LightGreen;                     // 0x06E8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x9846930D_LightGrey;                      // 0x0700(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC34ABDCC_LightPink;                      // 0x0718(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC57DAB84_LightSalmon;                    // 0x0730(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x0FE57B41_LightSeaGreen;                  // 0x0748(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4077C098_LightSkyBlue;                   // 0x0760(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xCABFF9F6_LightSlateGray;                 // 0x0778(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x30B1B372_LightSlateGrey;                 // 0x0790(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEFD2DF75_LightSteelBlue;                 // 0x07A8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5732C477_LightYellow;                    // 0x07C0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA58A0A97_Lime;                           // 0x07D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC8D6E552_LimeGreen;                      // 0x07F0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xD014B08F_Linen;                          // 0x0808(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC5065659_Magenta;                        // 0x0820(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2C6B6225_Maroon;                         // 0x0838(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x603DC640_MediumAquamarine;               // 0x0850(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x03344EDD_MediumBlue;                     // 0x0868(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEB235F60_MediumOrchid;                   // 0x0880(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x80AC62AF_MediumPurple;                   // 0x0898(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA2F1456A_MediumSeaGreen;                 // 0x08B0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x81A3E0C2_MediumSlateBlue;                // 0x08C8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x8259C923_MediumSpringGreen;              // 0x08E0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xE61E1AC0_MediumTurquoise;                // 0x08F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x750A73D1_MediumVioletRed;                // 0x0910(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x54B068FD_MidnightBlue;                   // 0x0928(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D5517E3_MintCream;                      // 0x0940(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC9B38859_MistyRose;                      // 0x0958(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x045E548D_Moccasin;                       // 0x0970(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x66A473BA_NavajoWhite;                    // 0x0988(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x621CB82D_Navy;                           // 0x09A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4433768E_OldLace;                        // 0x09B8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4ADCED0B_Olive;                          // 0x09D0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x662F5053_OliveDrab;                      // 0x09E8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x7B1B98E3_Orange;                         // 0x0A00(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x31DF128E_OrangeRed;                      // 0x0A18(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xAFEE3326_Orchid;                         // 0x0A30(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA90612F2_PaleGoldenrod;                  // 0x0A48(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6494F519_PaleGreen;                      // 0x0A60(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xD7CBB395_PaleTurquoise;                  // 0x0A78(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xBC04EB9C_PaleVioletred;                  // 0x0A90(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1267A5CE_PapayaWhip;                     // 0x0AA8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5B815063_PeachPuff;                      // 0x0AC0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6A5E8726_Peru;                           // 0x0AD8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x23175FB8_Pink;                           // 0x0AF0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x92124624_Plum;                           // 0x0B08(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x315A9690_PowderBlue;                     // 0x0B20(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC4610EE9_Purple;                         // 0x0B38(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x77CCDA87_Red;                            // 0x0B50(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xFB01846B_RosyBrown;                      // 0x0B68(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA95C80D8_RoyalBlue;                      // 0x0B80(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xFCC2BB8C_SaddleBrown;                    // 0x0B98(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x552CA712_Salmon;                         // 0x0BB0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xE1C22521_SandyBrown;                     // 0x0BC8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x36A1DDC2_SeaGreen;                       // 0x0BE0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x58B624CB_SeaShell;                       // 0x0BF8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x013650B1_Sienna;                         // 0x0C10(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xFA47F979_Silver;                         // 0x0C28(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1EAB27FD_SkyBlue;                        // 0x0C40(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x0AD0EBFD_SlateBlue;                      // 0x0C58(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x08E4A580_SlateGray;                      // 0x0C70(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xF2EAEF04_SlateGrey;                      // 0x0C88(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xE7A26A33_Snow;                           // 0x0CA0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2CD5AEB9_SpringGreen;                    // 0x0CB8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D898303_SteelBlue;                      // 0x0CD0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x09871083_Tan;                            // 0x0CE8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x303C932D_Teal;                           // 0x0D00(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x303F6677_Thistle;                        // 0x0D18(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4DC64808_Tomato;                         // 0x0D30(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6D6D11FF_Turquoise;                      // 0x0D48(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x3152567B_Violet;                         // 0x0D60(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x13A81039_Wheat;                          // 0x0D78(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x27EAE4E0_White;                          // 0x0D90(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xBE90A762_WhiteSmoke;                     // 0x0DA8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC763C8E1_Yellow;                         // 0x0DC0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xF10B434A_YellowGreen;                    // 0x0DD8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Colors_NamedColors">();
	}
	static class UColors_NamedColors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColors_NamedColors>();
	}
};

}

