#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseGameplayTags_0

#include "Basic.hpp"

#include "VerseGameplayTags_structs.hpp"
#include "VerseGameplayTags_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R final
{
public:
	struct Ftuple_Ltag__container_Mtag__container_R __verse_0xB2CDDD72_Argument;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R final
{
public:
	struct Ftuple_Ltag_Mtag_R                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R final
{
public:
	class UTags_tag_search_criteria*              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R
// 0x0010 (0x0010 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R final
{
public:
	struct FVerseGameplayTag                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<class UTags_tag*, true>             RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_NType_20where_20Type_R
// 0x0010 (0x0010 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_NType_20where_20Type_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UTags_tag*, true>             RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R
// 0x0020 (0x0020 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	uint64                                        InstancingGraph;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTags_tag_container*                    __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x0018(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R final
{
public:
	struct FVerseGameplayTagContainer             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm)
	TOptional<class UTags_tag_container*, true>   RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_view._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_view._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_view._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_search_criteria.$InitCDO
// 0x01B0 (0x01B0 - 0x0000)
struct Tags_tag_search_criteria__InitCDO final
{
public:
	TArray<class UTags_tag*>                      _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UTags_tag*>                      _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UTags_tag*>                      _ExprResult_10;                                    // 0x0090(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_9;                        // 0x00A0(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_11;                                     // 0x00B0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_12;                                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_13;                                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_11;                        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x00D1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UTags_tag*>                      _ExprResult_15;                                    // 0x00D8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x00E8(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_16;                                     // 0x00F8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_17;                                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_18;                                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_19 : 1;                                // 0x0119(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UTags_tag*>                      _ExprResult_20;                                    // 0x0120(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_17;                       // 0x0130(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_21;                                     // 0x0140(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_22;                                      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_23;                                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_19;                        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_24 : 1;                                // 0x0161(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UTags_tag*>                      _ExprResult_25;                                    // 0x0168(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_21;                       // 0x0178(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_26;                                     // 0x0188(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_27;                                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_28;                                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_23;                        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_29 : 1;                                // 0x01A9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags final
{
public:
	struct VerseGameplayTags_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTags_tag_container*                    RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum final
{
public:
	struct VerseGameplayTags_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset
// 0x0001 (0x0001 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset final
{
public:
	struct VerseGameplayTags_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

