#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseNative_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseDevices_0_structs.hpp"
#include "VerseDevices_classes.hpp"
#include "VerseAssets_0_classes.hpp"
#include "VerseColors_structs.hpp"
#include "VerseConcurrency_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseClass VerseDevices.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseDevices_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseDevices.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseDevices_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseDevices_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_set_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_base">();
	}
	static class UDevices_device_function_set_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_multi_parameter_base
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_multi_parameter_base : public UDevices_device_function_set_base
{
public:
	TOptional<class UClass*>                      __verse_0xBF5FC553_ReturnType;                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_multi_parameter_base">();
	}
	static class UDevices_device_function_set_multi_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_multi_parameter_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_params_by_name
// 0x0060 (0x00A8 - 0x0048)
class UDevices_device_function_set_params_by_name : public UDevices_device_function_set_multi_parameter_base
{
public:
	FVerseFunctionProperty_                       __verse_0xD67AF8BF__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UClass*>    __verse_0x8F623C81_ParameterTypes;                 // 0x0058(0x0050)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UDevices_function_parameter_base*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R(const TMap<FVerseStringProperty_, class UDevices_function_parameter_base*>& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_params_by_name">();
	}
	static class UDevices_device_function_set_params_by_name* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_params_by_name>();
	}
};

// VerseClass VerseDevices.Devices_creative_object
// 0x0050 (0x0110 - 0x00C0)
#pragma pack(push, 0x1)
class alignas(0x10) UDevices_creative_object : public UVerseCreativeObject
{
public:
	FVerseFunctionProperty_                       __verse_0x5139375F__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0A483613__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Ntransform_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object">();
	}
	static class UDevices_creative_object* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object>();
	}
};
#pragma pack(pop)

// VerseClass VerseDevices.Devices_creative_device_base
// 0x0020 (0x0130 - 0x0110)
class UDevices_creative_device_base final : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0x0182371F__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E46A055__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_base">();
	}
	static class UDevices_creative_device_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_base>();
	}
};

// VerseClass VerseDevices.task_Devices_creative_device$OnBegin
// 0x0010 (0x0150 - 0x0140)
class Utask_Devices_creative_device_OnBegin final : public Utask
{
public:
	class UDevices_creative_device*               _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices_creative_device$OnBegin">();
	}
	static class Utask_Devices_creative_device_OnBegin* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Devices_creative_device_OnBegin>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_vector3
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_vector3 final : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0x3B995A88__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__vector3_N_RInvoke_L_Nvector3_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__vector3_N_RInvoke_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_vector3">();
	}
	static class UDevices_device_function_set_vector3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_vector3>();
	}
};

// VerseClass VerseDevices.Devices
// 0x0008 (0x0030 - 0x0028)
class UDevices final : public UObject
{
public:
	class UDevices_creative_prop_asset*           __verse_0x88F30926_DefaultCreativePropAsset;       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R(class UTags_tag_search_criteria* __verse_0xB2CDDD72_Argument);
	static EDevices_move_to_result _L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_RHandleTeleportToResult_L_Nteleport__to__result_R(EDevices_teleport_to_result __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FSpatialMath_transform _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& __verse_0xB2CDDD72_Argument);
	static EDevices_teleport_to_result _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Ntransform_R(const struct Ftuple_Lcreative__prop__asset_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R(const struct Ftuple_Lcreative__prop__asset_Mvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument);
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_Factory();
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static class Utask* operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class Utask* operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class Utask* operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices">();
	}
	static class UDevices* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices>();
	}
};

// VerseClass VerseDevices.Devices_creative_device
// 0x00A0 (0x0150 - 0x00B0)
class alignas(0x10) UDevices_creative_device final : public UVerseCreativeDevice
{
public:
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEAC73ECC__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0AA415A9__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x826ED8B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x0110(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x592F1135__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow; // 0x0120(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57F532B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide; // 0x0130(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0140(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Ntransform_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class Utask* OnBegin(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device">();
	}
	static class UDevices_creative_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_get_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_base">();
	}
	static class UDevices_device_function_get_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_base>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation_animation_controller_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_animation_controller_debug_log">();
	}
	static class UDevices_CreativeAnimation_animation_controller_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_animation_controller_debug_log>();
	}
};

// VerseClass VerseDevices.Devices_creative_device_asset
// 0x0000 (0x00C8 - 0x00C8)
class UDevices_creative_device_asset final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_asset">();
	}
	static class UDevices_creative_device_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_asset>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop
// 0x0070 (0x0180 - 0x0110)
class UDevices_creative_prop final : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0xC4FF6975__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7DCCC181__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6E31A773__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x60EB84F3__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x909F40CD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R(const struct Ftuple_Lmaterial_M_QIndex_Nint_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R(class UAssets_mesh* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop">();
	}
	static class UDevices_creative_prop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_message
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_message final : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0xEE3C8C22__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_message">();
	}
	static class UDevices_device_function_set_message* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_message>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_agent
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_agent final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x2376EEDD__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_agent">();
	}
	static class UDevices_device_function_get_agent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_agent>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation_InterpolationTypes
// 0x00A0 (0x00C8 - 0x0028)
class UDevices_CreativeAnimation_InterpolationTypes final : public UObject
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9B27EB9D_Linear;             // 0x0028(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9CD14C25_Ease;               // 0x0048(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xB345298C_EaseIn;             // 0x0068(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xF59E2BD2_EaseOut;            // 0x0088(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x29A389AE_EaseInOut;          // 0x00A8(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_InterpolationTypes">();
	}
	static class UDevices_CreativeAnimation_InterpolationTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_InterpolationTypes>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_int
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_int final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x5F417C53__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_int">();
	}
	static class UDevices_device_function_get_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_int>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_base
// 0x0000 (0x0028 - 0x0028)
class UDevices_function_parameter_base : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_base">();
	}
	static class UDevices_function_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_base>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_logic
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_logic final : public UDevices_function_parameter_base
{
public:
	uint8                                         __verse_0x31A8F10C_Value : 1;                      // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_logic">();
	}
	static class UDevices_function_parameter_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_logic>();
	}
};

// VerseClass VerseDevices.Devices_creative_object_interface
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_object_interface final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object_interface">();
	}
	static class UDevices_creative_object_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object_interface>();
	}
};

// VerseClass VerseDevices.task_Devices$operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R
// 0x0C30 (0x0D70 - 0x0140)
class Utask_Devices_operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R final : public Utask
{
public:
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R __verse_0xB2CDDD72_Argument; // 0x0140(0x0080)(Parm, HasGetValueTypeHash)
	EDevices_move_to_internal_result              _RetVal;                                           // 0x01C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<double>                             _ExprResultStack_0;                                // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R __verse_0xA8BECD0D_GetControllerResult_1; // 0x01D8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x01E8(0x0010)(HasGetValueTypeHash)
	class UDevices_CreativeAnimation_animation_controller* __verse_0x995129C4_Controller_4;          // 0x01F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _ExprResultStack_2;      // 0x0200(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_transform                 __verse_0x80B800AD_CurrentTransform_4;             // 0x0210(0x0060)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0270(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R _ExprResult_4;            // 0x0280(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_5;                                     // 0x0290(0x0001)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_6;                                     // 0x0291(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDevices_CreativeAnimation_keyframe_delta> __verse_0xB23BEFD6_KeyframeArray_4;     // 0x0298(0x0010)(ContainsInstancedReference)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDevices_CreativeAnimation_keyframe_delta _ExprResult_7;                                  // 0x02B0(0x0080)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_8;                                // 0x0330(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0380(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x0390(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x03A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x03B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x03C0(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_14;                               // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x03E8(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_Lvector3_Mvector3_R _ExprResult_16;                                // 0x03F8(0x0030)(HasGetValueTypeHash)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         _ExprResultStack_17;                               // 0x0430(0x0020)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0450(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_Lrotation_Mrotation_R _ExprResult_19;                              // 0x0460(0x0040)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_20;                               // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x04B8(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_Lvector3_Mvector3_R _ExprResult_22;                                // 0x04C8(0x0030)(HasGetValueTypeHash)
	EDevices_CreativeAnimation_set_animation_result __verse_0xC40A5F4A_SetAnimationResult_4;         // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDevices_CreativeAnimation_animation_controller* __verse_0x00000000__5;                    // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_23;                                        // 0x0508(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_R _ExprResult_24;             // 0x0518(0x0018)(HasGetValueTypeHash)
	TOptional<EDevices_CreativeAnimation_animation_mode> _ExprResult_25;                             // 0x0530(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_26;                              // 0x0538(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_27;                               // 0x0548(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_28;                                    // 0x0560(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_29;                                    // 0x0570(0x0010)(HasGetValueTypeHash)
	EDevices_CreativeAnimation_playstoppause_result __verse_0x2BCA4545_PlayResult_6;                 // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDevices_CreativeAnimation_animation_controller* __verse_0x00000000__7;                    // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_30;                                        // 0x0590(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_31;                                    // 0x05A0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_32;                              // 0x05A8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_33;                               // 0x05B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x05D0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_35;                                    // 0x05E0(0x0010)(HasGetValueTypeHash)
	EDevices_CreativeAnimation_await_next_keyframe_result __verse_0x95D09D0E_Result_8;               // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDevices_CreativeAnimation_animation_controller* __verse_0x00000000__9;                    // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Utask*                                  _AsyncTask_36;                                     // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_37;                                // 0x0608(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_38;                                    // 0x0618(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         _AsyncResult_39;                                   // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevices_CreativeAnimation_await_next_keyframe_result __verse_0x00000000__10;                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_40;                              // 0x0630(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_41;                               // 0x0640(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_42;                                    // 0x0658(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_43;                                    // 0x0668(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_44;                              // 0x0678(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_45;                               // 0x0688(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_46;                                    // 0x06A0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_47;                                    // 0x06B0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_48;                              // 0x06C0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_49;                               // 0x06D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_50;                                    // 0x06E8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_51;                                    // 0x06F8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_52;                              // 0x0708(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_53;                               // 0x0718(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_54;                                    // 0x0730(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_55;                                    // 0x0740(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_56;                              // 0x0750(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_57;                               // 0x0760(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_58;                                    // 0x0778(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_59;                                    // 0x0788(0x0010)(HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_60;                               // 0x0798(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R __verse_0xA8BECD0D_GetControllerResult_20; // 0x07A8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_61;                                        // 0x07B8(0x0010)(HasGetValueTypeHash)
	class UDevices_CreativeAnimation_animation_controller* __verse_0x995129C4_Controller_23;         // 0x07C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _ExprResultStack_62;     // 0x07D0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_transform                 __verse_0x80B800AD_CurrentTransform_23;            // 0x07E0(0x0060)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_63;                                        // 0x0840(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R _ExprResult_64;           // 0x0850(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_65;                                    // 0x0860(0x0001)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_66;                                    // 0x0861(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_862[0x6];                                      // 0x0862(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDevices_CreativeAnimation_keyframe_delta> __verse_0xB23BEFD6_KeyframeArray_23;    // 0x0868(0x0010)(ContainsInstancedReference)
	uint8                                         Pad_878[0x8];                                      // 0x0878(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDevices_CreativeAnimation_keyframe_delta _ExprResult_67;                                 // 0x0880(0x0080)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_68;                               // 0x0900(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_69;                                    // 0x0950(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_70;                                    // 0x0960(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x0970(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_72;                                    // 0x0980(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_73;                                    // 0x0990(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_74;                               // 0x09A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_75;                                        // 0x09B8(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_Lvector3_Mvector3_R _ExprResult_76;                                // 0x09C8(0x0030)(HasGetValueTypeHash)
	uint8                                         Pad_9F8[0x8];                                      // 0x09F8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         _ExprResultStack_77;                               // 0x0A00(0x0020)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_78;                                        // 0x0A20(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_Lrotation_Mrotation_R _ExprResult_79;                              // 0x0A30(0x0040)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_80;                               // 0x0A70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_81;                                        // 0x0A88(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_Lvector3_Mvector3_R _ExprResult_82;                                // 0x0A98(0x0030)(HasGetValueTypeHash)
	EDevices_CreativeAnimation_set_animation_result __verse_0xC40A5F4A_SetAnimationResult_23;        // 0x0AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC9[0x7];                                      // 0x0AC9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDevices_CreativeAnimation_animation_controller* __verse_0x00000000__24;                   // 0x0AD0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_83;                                        // 0x0AD8(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_R _ExprResult_84;             // 0x0AE8(0x0018)(HasGetValueTypeHash)
	TOptional<EDevices_CreativeAnimation_animation_mode> _ExprResult_85;                             // 0x0B00(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B02[0x6];                                      // 0x0B02(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_86;                              // 0x0B08(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_87;                               // 0x0B18(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_88;                                    // 0x0B30(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_89;                                    // 0x0B40(0x0010)(HasGetValueTypeHash)
	EDevices_CreativeAnimation_playstoppause_result __verse_0x2BCA4545_PlayResult_25;                // 0x0B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B51[0x7];                                      // 0x0B51(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDevices_CreativeAnimation_animation_controller* __verse_0x00000000__26;                   // 0x0B58(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_90;                                        // 0x0B60(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_91;                                    // 0x0B70(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_92;                              // 0x0B78(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_93;                               // 0x0B88(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_94;                                    // 0x0BA0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_95;                                    // 0x0BB0(0x0010)(HasGetValueTypeHash)
	EDevices_CreativeAnimation_await_next_keyframe_result __verse_0x95D09D0E_Result_27;              // 0x0BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDevices_CreativeAnimation_animation_controller* __verse_0x00000000__28;                   // 0x0BC8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Utask*                                  _AsyncTask_96;                                     // 0x0BD0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_97;                                // 0x0BD8(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_98;                                    // 0x0BE8(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_BE9[0x7];                                      // 0x0BE9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         _AsyncResult_99;                                   // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevices_CreativeAnimation_await_next_keyframe_result __verse_0x00000000__29;                    // 0x0BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF9[0x7];                                      // 0x0BF9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_100;                             // 0x0C00(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_101;                              // 0x0C10(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_102;                                   // 0x0C28(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_103;                                   // 0x0C38(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_104;                             // 0x0C48(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_105;                              // 0x0C58(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_106;                                   // 0x0C70(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_107;                                   // 0x0C80(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_108;                             // 0x0C90(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_109;                              // 0x0CA0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_110;                                   // 0x0CB8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_111;                                   // 0x0CC8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_112;                             // 0x0CD8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_113;                              // 0x0CE8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_114;                                   // 0x0D00(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_115;                                   // 0x0D10(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_116;                             // 0x0D20(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_117;                              // 0x0D30(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_118;                                   // 0x0D48(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_119;                                   // 0x0D58(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices$operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R">();
	}
	static class Utask_Devices_operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Devices_operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop_asset
// 0x0000 (0x0090 - 0x0090)
class UDevices_creative_prop_asset final : public UVerseCreativePropAsset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_asset">();
	}
	static class UDevices_creative_prop_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_asset>();
	}
};

// VerseClass VerseDevices.Devices_move_to_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_move_to_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_move_to_debug_log">();
	}
	static class UDevices_move_to_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_move_to_debug_log>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_prop_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_debug_log">();
	}
	static class UDevices_creative_prop_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_debug_log>();
	}
};

// VerseClass VerseDevices.task_Devices_creative_object$MoveTo_L_Ntransform_M_Nfloat_R
// 0x02D0 (0x0410 - 0x0140)
class Utask_Devices_creative_object_MoveTo_L_Ntransform_M_Nfloat_R final : public Utask
{
public:
	class UDevices_creative_object*               _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Ltransform_Mfloat_R             __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0070)(Parm, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x01C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class Utask*                                  _AsyncTask_0;                                      // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x01D0(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R _ExprResult_2;           // 0x01E0(0x0080)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_3;                                     // 0x0260(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_261[0xF];                                      // 0x0261(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Ltransform_Mfloat_R             _ExprResult_4;                                     // 0x0270(0x0070)(HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  _AsyncTask_6;                                      // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_7;                                 // 0x02F0(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R _ExprResult_8;           // 0x0300(0x0080)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_9;                                     // 0x0380(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_381[0xF];                                      // 0x0381(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Ltransform_Mfloat_R             _ExprResult_10;                                    // 0x0390(0x0070)(HasGetValueTypeHash)
	int64                                         _AsyncResult_11;                                   // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

