#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseCreature_0

#include "Basic.hpp"

#include "VerseCreature_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseFortnite_0_structs.hpp"


namespace SDK::Params
{

// Function VerseCreature.task_VerseCreature_creature_component$RoamAround.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseCreature_creature_component_RoamAround_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCreature.task_VerseCreature_creature_component$MaintainFocus_L_Nagent_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseCreature_creature_component_MaintainFocus_L_Nagent_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCreature.task_VerseCreature_creature_component$Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseCreature_creature_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCreature.task_VerseCreature_creature_component$MaintainFocus_L_Nvector3_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseCreature_creature_component_MaintainFocus_L_Nvector3_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_component._L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination
// 0x0028 (0x0028 - 0x0000)
struct VerseCreature_creature_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<struct FSpatialMath_vector3>        RetVal;                                            // 0x0008(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseCreature.VerseCreature_creature_component._L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation
// 0x0001 (0x0001 - 0x0000)
struct VerseCreature_creature_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_component.MaintainFocus_L_Nagent_R
// 0x0028 (0x0028 - 0x0000)
struct VerseCreature_creature_component_MaintainFocus_L_Nagent_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_component.MaintainFocus_L_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct VerseCreature_creature_component_MaintainFocus_L_Nvector3_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class Utask*                                  RetVal;                                            // 0x0030(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_component.MoveInRangeToAttack
// 0x0028 (0x0028 - 0x0000)
struct VerseCreature_creature_component_MoveInRangeToAttack final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_component.NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
// 0x0040 (0x0040 - 0x0000)
struct VerseCreature_creature_component_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseCreature_0::Ftuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0018(0x0020)(Parm, HasGetValueTypeHash)
	class Utask*                                  RetVal;                                            // 0x0038(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_component.RoamAround
// 0x0028 (0x0028 - 0x0000)
struct VerseCreature_creature_component_RoamAround final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_component.Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0030 (0x0030 - 0x0000)
struct VerseCreature_creature_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  RetVal;                                            // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.task_VerseCreature_creature_component$MoveInRangeToAttack.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseCreature_creature_component_MoveInRangeToAttack_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCreature.task_VerseCreature_creature_component$NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseCreature_creature_component_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component.$InitCDO
// 0x00C0 (0x00C0 - 0x0000)
struct VerseCreature_creature_perception_component__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_12;                                    // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_14;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_16;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_18;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_20;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_22;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDamageSettings
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDamageSettings final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_damage_perception_settings*         RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTarget_L_Nagent_R
// 0x0040 (0x0040 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTarget_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<struct FAI_target_info>             RetVal;                                            // 0x0008(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTargets
// 0x0018 (0x0018 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTargets final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FAI_target_info>                RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetHearingSettings
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetHearingSettings final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_hearing_perception_settings*        RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetSightSettings
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetSightSettings final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_sight_perception_settings*          RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetTouchSettings
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetTouchSettings final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_touch_perception_settings*          RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetDamageSettings_L_Ndamage__perception__settings_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetDamageSettings_L_Ndamage__perception__settings_R final
{
public:
	class UAI_damage_perception_settings*         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetHearingSettings_L_Nhearing__perception__settings_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetHearingSettings_L_Nhearing__perception__settings_R final
{
public:
	class UAI_hearing_perception_settings*        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetSightSettings_L_Nsight__perception__settings_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetSightSettings_L_Nsight__perception__settings_R final
{
public:
	class UAI_sight_perception_settings*          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetTouchSettings_L_Ntouch__perception__settings_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetTouchSettings_L_Ntouch__perception__settings_R final
{
public:
	class UAI_touch_perception_settings*          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetAddedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetAddedEvent final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetHeardEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetHeardEvent final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetInfoUpdatedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetInfoUpdatedEvent final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetRemovedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetRemovedEvent final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetSeenEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetSeenEvent final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCreature.VerseCreature_creature_perception_component._L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetTouchedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseCreature_creature_perception_component__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetTouchedEvent final
{
public:
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}

