#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseAIBase_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseGameplayTags_0_classes.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "VerseConcurrency_classes.hpp"
#include "VerseAssets_0_classes.hpp"


namespace SDK
{

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Slide
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_character_movement_interface_Slide final : public Utask
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                     // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Slide">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Slide* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Slide>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$LootObject_L_Nfort__loot__info_R
// 0x0038 (0x0178 - 0x0140)
class Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R final : public Utask
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                      // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_loot_info            __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0028)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0170(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$LootObject_L_Nfort__loot__info_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R>();
	}
};

// VerseClass VerseAIBase.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseAIBase_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseAIBase.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseAIBase_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseAIBase_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Crouch
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_character_movement_interface_Crouch final : public Utask
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                     // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_fallible_action_result           _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Crouch">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Crouch* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Crouch>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackObstacle_L_Nfort__obstacle__info_R
// 0x0038 (0x0178 - 0x0140)
class Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R final : public Utask
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                      // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info        __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0028)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0170(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$AttackObstacle_L_Nfort__obstacle__info_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_item_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_item_tag : public UTags_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_item_tag">();
	}
	static class UVerseAIBase_fort_item_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_item_tag>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_weapon_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_weapon_tag : public UVerseAIBase_fort_item_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_weapon_tag">();
	}
	static class UVerseAIBase_fort_weapon_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_weapon_tag>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_range_weapon_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_range_weapon_tag : public UVerseAIBase_fort_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_range_weapon_tag">();
	}
	static class UVerseAIBase_fort_range_weapon_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_range_weapon_tag>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_pistol_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_pistol_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_pistol_tag">();
	}
	static class UVerseAIBase_fort_pistol_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_pistol_tag>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Jump
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_character_movement_interface_Jump final : public Utask
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                     // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Jump">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Jump* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Jump>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_LMG_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_LMG_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_LMG_tag">();
	}
	static class UVerseAIBase_fort_LMG_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_LMG_tag>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackThreat_L_Ntarget__info_R
// 0x0040 (0x0180 - 0x0140)
class Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Ntarget__info_R final : public Utask
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                      // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAI_target_info                        __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0030)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0178(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$AttackThreat_L_Ntarget__info_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Ntarget__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Ntarget__info_R>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_biplane_gun_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_biplane_gun_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_biplane_gun_tag">();
	}
	static class UVerseAIBase_fort_biplane_gun_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_biplane_gun_tag>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$Revive_L_Nagent_R
// 0x0018 (0x0158 - 0x0140)
class Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R final : public Utask
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                      // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseAIBase_fallible_action_result           _RetVal;                                           // 0x0150(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$Revive_L_Nagent_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_grenade_launcher_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_grenade_launcher_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_grenade_launcher_tag">();
	}
	static class UVerseAIBase_fort_grenade_launcher_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_grenade_launcher_tag>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_loot_perception_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_loot_perception_interface final : public UObject
{
public:
	class UObject* _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectToLootChangedEvent(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FVerseAIBase_fort_loot_info> _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_loot_perception_interface">();
	}
	static class UVerseAIBase_fort_loot_perception_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_loot_perception_interface>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Sprint
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_character_movement_interface_Sprint final : public Utask
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                     // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Sprint">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Sprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Sprint>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$TacticalSprint
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint final : public Utask
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                     // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$TacticalSprint">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_rocket_launcher_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_rocket_launcher_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_rocket_launcher_tag">();
	}
	static class UVerseAIBase_fort_rocket_launcher_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_rocket_launcher_tag>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Walk
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_character_movement_interface_Walk final : public Utask
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                     // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Walk">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Walk* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Walk>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_obstacle_perception_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_obstacle_perception_interface final : public UObject
{
public:
	TOptional<struct FVerseAIBase_fort_obstacle_info> _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_obstacle_perception_interface">();
	}
	static class UVerseAIBase_fort_obstacle_perception_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_obstacle_perception_interface>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_navigatable$MoveInRangeToAttack
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_navigatable_MoveInRangeToAttack final : public Utask
{
public:
	class UVerseAIBase_fort_navigatable*          _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_navigatable$MoveInRangeToAttack">();
	}
	static class Utask_VerseAIBase_fort_navigatable_MoveInRangeToAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_navigatable_MoveInRangeToAttack>();
	}
};

// VerseClass VerseAIBase.VerseAIBase_fort_mini_gun_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_mini_gun_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_mini_gun_tag">();
	}
	static class UVerseAIBase_fort_mini_gun_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_mini_gun_tag>();
	}
};

// VerseClass VerseAIBase.task_VerseAIBase_fort_navigatable$RoamAround
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseAIBase_fort_navigatable_RoamAround final : public Utask
{
public:
	class UVerseAIBase_fort_navigatable*          _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EAI_navigation_result                         _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_navigatable$RoamAround">();
	}
	static class Utask_VerseAIBase_fort_navigatable_RoamAround* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_navigatable_RoamAround>();
	}
};

// VerseClass VerseAIBase.VerseAIBase
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__loot__info_R(const struct FVerseAIBase_fort_loot_info& __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UAI_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
