#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseMovement_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseMovement_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function VerseMovement.VerseMovement._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_N_RGetPlayerMoveComponent_L_Nplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct VerseMovement__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_N_RGetPlayerMoveComponent_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseMovement_movement_component*, true> RetVal;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_config$Factory
// 0x00A0 (0x00A0 - 0x0000)
struct VerseMovement_VerseMovement_move_config_Factory final
{
public:
	struct FVerseMovement_move_config             RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_0;                                   // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0020(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_1;                                    // 0x0030(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0051(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_5;                                   // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0068(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_6;                                    // 0x0078(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0099(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseMovement.VerseMovement.VerseMovement_move_config$OverrideFactory
// 0x0120 (0x0120 - 0x0000)
struct VerseMovement_VerseMovement_move_config_OverrideFactory final
{
public:
	struct FVerseMovement_move_config             RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0070(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_2;                                   // 0x0078(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0088(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_3;                                    // 0x0098(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_4;                                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_5;                                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x00B9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_7;                                // 0x00C0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_8;                                     // 0x00D0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_9;                                   // 0x00D8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x00E8(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_10;                                   // 0x00F8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_11;                                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x0119(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseMovement.VerseMovement.VerseMovement_move_config_entry$Factory
// 0x0170 (0x0170 - 0x0000)
struct VerseMovement_VerseMovement_move_config_entry_Factory final
{
public:
	struct FVerseMovement_move_config_entry       RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm)
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_1;                                     // 0x0040(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0050(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>    _ForResult_2;                                      // 0x0060(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_3;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_4;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0081(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_6;                                     // 0x0088(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0098(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>   _ForResult_7;                                      // 0x00A8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_8;                                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_9;                                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x00C9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_12;                                    // 0x00E0(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_9;                        // 0x00F0(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>    _ForResult_13;                                     // 0x0100(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_14;                                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_15;                                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_11;                        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x0121(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_17;                                    // 0x0128(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x0138(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>   _ForResult_18;                                     // 0x0148(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_19;                                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_20;                                     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_21 : 1;                                // 0x0169(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseMovement.VerseMovement.VerseMovement_move_config_entry$OverrideFactory
// 0x0250 (0x0250 - 0x0000)
struct VerseMovement_VerseMovement_move_config_entry_OverrideFactory final
{
public:
	struct FVerseMovement_move_config_entry       RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0030(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0080(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0090(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_3;                                // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_4;                                     // 0x00B8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_5;                                     // 0x00C0(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x00D0(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>    _ForResult_6;                                      // 0x00E0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0101(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_10;                               // 0x0108(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_11;                                    // 0x0118(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_12;                                    // 0x0120(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0130(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>   _ForResult_13;                                     // 0x0140(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_14;                                      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_15;                                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x0161(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_17;                               // 0x0168(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_18;                                    // 0x0178(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_20;                               // 0x0190(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_21;                                    // 0x01A0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_22;                                    // 0x01A8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_9;                        // 0x01B8(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>    _ForResult_23;                                     // 0x01C8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_24;                                      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_25;                                     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_11;                        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_26 : 1;                                // 0x01E9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_27;                               // 0x01F0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_28;                                    // 0x0200(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_29;                                    // 0x0208(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x0218(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>   _ForResult_30;                                     // 0x0228(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_31;                                      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_32;                                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_33 : 1;                                // 0x0249(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseMovement.VerseMovement.VerseMovement_move_input_trigger_params$Factory
// 0x0178 (0x0178 - 0x0000)
struct VerseMovement_VerseMovement_move_input_trigger_params_Factory final
{
public:
	struct FVerseMovement_move_input_trigger_params RetVal;                                          // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0038(0x0010)(HasGetValueTypeHash)
	TOptional<class UCurves_editable_curve*, true> _ExprResult_1;                                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0050(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_3;                                // 0x0053(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_4;                                     // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_5;                                // 0x0068(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x00C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x00D8(0x0010)(HasGetValueTypeHash)
	TOptional<class UCurves_editable_curve*, true> _ExprResult_9;                                    // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x00F0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x00F2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x00F3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_12;                                    // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_13;                               // 0x0108(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0158(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0168(0x0010)(HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_input_trigger_params$OverrideFactory
// 0x02B8 (0x02B8 - 0x0000)
struct VerseMovement_VerseMovement_move_input_trigger_params_OverrideFactory final
{
public:
	struct FVerseMovement_move_input_trigger_params RetVal;                                          // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0038(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0088(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0098(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x00A0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x00B0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_5;                                // 0x00C8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_6;                                     // 0x00D8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UCurves_editable_curve*, true> _ExprResult_7;                                    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x00E8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x00EA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_9;                                // 0x00EB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_10;                               // 0x00F0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_11;                                    // 0x0100(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_12;                               // 0x0108(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_13;                                    // 0x0118(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_14;                                    // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_15;                               // 0x0130(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_18;                               // 0x01A0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_19;                                    // 0x01B0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_20;                               // 0x01B8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_21;                                    // 0x01C8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResult_22;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_23;                               // 0x01E0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_24;                                    // 0x01F0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UCurves_editable_curve*, true> _ExprResult_25;                                   // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0200(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_26 : 1;                                // 0x0202(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_27;                               // 0x0203(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_28;                               // 0x0208(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_29;                                    // 0x0218(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_30;                               // 0x0220(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_31;                                    // 0x0230(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_32;                                    // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_33;                               // 0x0248(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_34;                                    // 0x0298(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x02A8(0x0010)(HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_physics_trigger_params$Factory
// 0x0048 (0x0048 - 0x0000)
struct VerseMovement_VerseMovement_move_physics_trigger_params_Factory final
{
public:
	struct FVerseMovement_move_physics_trigger_params RetVal;                                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_1;                                     // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_physics_trigger_params$OverrideFactory
// 0x00C8 (0x00C8 - 0x0000)
struct VerseMovement_VerseMovement_move_physics_trigger_params_OverrideFactory final
{
public:
	struct FVerseMovement_move_physics_trigger_params RetVal;                                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0068(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0078(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_2;                                     // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_3;                                // 0x0098(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_4;                                     // 0x00A8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_5;                                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_response$Factory
// 0x01D0 (0x01D0 - 0x0000)
struct VerseMovement_VerseMovement_move_response_Factory final
{
public:
	struct FVerseMovement_move_response           RetVal;                                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<class UCurves_editable_curve*, true> _ExprResult_1;                                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_3;                                // 0x0073(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_4;                                     // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_5;                                // 0x0090(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_9;                                     // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<class UCurves_editable_curve*, true> _ExprResult_10;                                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0130(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_11 : 1;                                // 0x0132(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_12;                               // 0x0133(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_13;                                    // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_14;                               // 0x0150(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x01A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x01C0(0x0010)(HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_response$OverrideFactory
// 0x03D0 (0x03D0 - 0x0000)
struct VerseMovement_VerseMovement_move_response_OverrideFactory final
{
public:
	struct FVerseMovement_move_response           RetVal;                                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0050(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x00A0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x00B0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_2;                                     // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_3;                                // 0x00D0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_4;                                     // 0x00E0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_5;                                // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_6;                                     // 0x00F8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UCurves_editable_curve*, true> _ExprResult_7;                                    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0108(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x010A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_9;                                // 0x010B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_10;                               // 0x0110(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_11;                                    // 0x0120(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_12;                               // 0x0128(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_13;                                    // 0x0138(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_14;                               // 0x0140(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_15;                                    // 0x0150(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_16;                               // 0x0158(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_17;                                    // 0x0168(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_18;                               // 0x0170(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_19;                                    // 0x0180(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_20;                                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_21;                               // 0x01A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_22;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_24;                                    // 0x0210(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_25;                               // 0x0220(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_26;                                    // 0x0230(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_27;                               // 0x0238(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_28;                                    // 0x0248(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_29;                                    // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_30;                               // 0x0268(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_31;                                    // 0x0278(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_32;                               // 0x0280(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_33;                                    // 0x0290(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UCurves_editable_curve*, true> _ExprResult_34;                                   // 0x0298(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x02A0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_35 : 1;                                // 0x02A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_36;                               // 0x02A3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_37;                               // 0x02A8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_38;                                    // 0x02B8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_39;                               // 0x02C0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_40;                                    // 0x02D0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_41;                               // 0x02D8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_42;                                    // 0x02E8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_43;                               // 0x02F0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_44;                                    // 0x0300(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_45;                               // 0x0308(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_46;                                    // 0x0318(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_47;                                    // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_48;                               // 0x0338(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_49;                                    // 0x0388(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_50;                                    // 0x0398(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x03A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_52;                               // 0x03B8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_53;                                    // 0x03C8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_trace_trigger_params$Factory
// 0x0088 (0x0088 - 0x0000)
struct VerseMovement_VerseMovement_move_trace_trigger_params_Factory final
{
public:
	struct FVerseMovement_move_trace_trigger_params RetVal;                                          // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<class UCurves_editable_curve*, true> _ExprResult_1;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0058(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x005A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_3;                                // 0x005B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_4;                                     // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<class UCurves_editable_curve*, true> _ExprResult_5;                                    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0080(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x0082(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_7;                                // 0x0083(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_trace_trigger_params$OverrideFactory
// 0x01C8 (0x01C8 - 0x0000)
struct VerseMovement_VerseMovement_move_trace_trigger_params_OverrideFactory final
{
public:
	struct FVerseMovement_move_trace_trigger_params RetVal;                                          // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0038(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0088(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0098(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector3                   _ExprResult_2;                                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_3;                                // 0x00B8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_4;                                     // 0x00C8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_5;                                // 0x00D0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_6;                                     // 0x00E0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_7;                                // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_8;                                     // 0x00F8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_9;                                // 0x0100(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_10;                                    // 0x0110(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UCurves_editable_curve*, true> _ExprResult_11;                                   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0120(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_12 : 1;                                // 0x0122(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_13;                               // 0x0123(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_14;                               // 0x0128(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_15;                                    // 0x0138(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
