#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseGameplayTags

#include "Basic.hpp"

#include "VerseGameplayTags_structs.hpp"
#include "EntityCore_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseGameplayTags.EntityTagContainerComponent
// 0x0018 (0x0070 - 0x0058)
class UEntityTagContainerComponent : public UEntityComponent
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseGameplayTagContainer             InternalTags;                                      // 0x0060(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityTagContainerComponent">();
	}
	static class UEntityTagContainerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityTagContainerComponent>();
	}
};

// Class VerseGameplayTags.VerseGameplayTagBase
// 0x0000 (0x0028 - 0x0028)
class UVerseGameplayTagBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseGameplayTagBase">();
	}
	static class UVerseGameplayTagBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseGameplayTagBase>();
	}
};

// Class VerseGameplayTags.TaggedObjectQueryWorldSubsystemBase
// 0x0000 (0x0030 - 0x0030)
class UTaggedObjectQueryWorldSubsystemBase : public UWorldSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TaggedObjectQueryWorldSubsystemBase">();
	}
	static class UTaggedObjectQueryWorldSubsystemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaggedObjectQueryWorldSubsystemBase>();
	}
};

// Class VerseGameplayTags.TagRegistrationHandler
// 0x0040 (0x0068 - 0x0028)
class UTagRegistrationHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TagRegistrationHandler">();
	}
	static class UTagRegistrationHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTagRegistrationHandler>();
	}
};

// Class VerseGameplayTags.VerseGameplayTagContainerBase
// 0x0010 (0x0038 - 0x0028)
class UVerseGameplayTagContainerBase : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseGameplayTagContainerBase">();
	}
	static class UVerseGameplayTagContainerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseGameplayTagContainerBase>();
	}
};

// Class VerseGameplayTags.VerseGameplayTagAssetInterface
// 0x0000 (0x0000 - 0x0000)
class IVerseGameplayTagAssetInterface final
{
public:
	void GetOwnedGameplayTags(struct FVerseGameplayTagContainer* TagContainer) const;
	bool HasAllMatchingGameplayTags(const struct FVerseGameplayTagContainer& TagContainer) const;
	bool HasAnyMatchingGameplayTags(const struct FVerseGameplayTagContainer& TagContainer) const;
	bool HasMatchingGameplayTag(const struct FVerseGameplayTag& TagToCheck) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseGameplayTagAssetInterface">();
	}
	static class IVerseGameplayTagAssetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVerseGameplayTagAssetInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class VerseGameplayTags.VerseTagMarkupComponent
// 0x0018 (0x00B8 - 0x00A0)
class UVerseTagMarkupComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseGameplayTagContainer             InternalTags;                                      // 0x00A8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseTagMarkupComponent">();
	}
	static class UVerseTagMarkupComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseTagMarkupComponent>();
	}
};

}

