#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseAssets_0

#include "Basic.hpp"

#include "VerseAssets_0_structs.hpp"


namespace SDK::Params
{

// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load
// 0x0010 (0x0010 - 0x0000)
struct Assets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load final
{
public:
	struct VerseAssets_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class URestricted_sticky_event*, true> RetVal;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType
// 0x0018 (0x0018 - 0x0000)
struct Assets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType final
{
public:
	struct VerseAssets_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UClass*>                      RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent
// 0x0010 (0x0010 - 0x0000)
struct Assets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent final
{
public:
	struct VerseAssets_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class URestricted_sticky_event*, true> RetVal;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad
// 0x0002 (0x0002 - 0x0000)
struct Assets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad final
{
public:
	struct VerseAssets_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseAssets.Assets._L_2fVerse_2eorg_2fAssets_N_RMakeAsset_L_NAssetType_M_N_Kchar_20where_20AssetType_R
// 0x0028 (0x0028 - 0x0000)
struct Assets__L_2fVerse_2eorg_2fAssets_N_RMakeAsset_L_NAssetType_M_N_Kchar_20where_20AssetType_R final
{
public:
	struct VerseAssets_0::Ftuple_Lany_M_Kchar_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	FVerseDynamicProperty_                        RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

}

