#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseEnum VerseFortnite.AI_guard_alert_level
// NumValues: 0x0005
enum class EAI_guard_alert_level : uint8
{
	Unaware                                  = 0,
	Suspicious                               = 1,
	LostTarget                               = 2,
	Alerted                                  = 3,
	AI_guard_alert_MAX                       = 4,
};

// VerseEnum VerseFortnite.AI_navigation_result
// NumValues: 0x0006
enum class EAI_navigation_result : uint8
{
	Reached                                  = 0,
	PartiallyReached                         = 1,
	Interrupted                              = 2,
	Blocked                                  = 3,
	Unreachable                              = 4,
	AI_navigation_MAX                        = 5,
};

// VerseEnum VerseFortnite.AI_play_emote_result
// NumValues: 0x0004
enum class EAI_play_emote_result : uint8
{
	Success                                  = 0,
	Error                                    = 1,
	Interrupted                              = 2,
	AI_play_emote_MAX                        = 3,
};

// VerseEnum VerseFortnite.Teams_team_attitude
// NumValues: 0x0004
enum class ETeams_team_attitude : uint8
{
	Friendly                                 = 0,
	Neutral                                  = 1,
	Hostile                                  = 2,
	Teams_team_MAX                           = 3,
};

// VerseStruct VerseFortnite.AI_target_info
// 0x0030 (0x0030 - 0x0000)
struct FAI_target_info final
{
public:
	class UObject*                                __verse_0x459049A1_Target;                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x4A328DE2_LastKnownPosition;              // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         __verse_0xAC2B8860_HasLineOfSight : 1;             // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	ETeams_team_attitude                          __verse_0xA972C52D_Attitude;                       // 0x0021(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAI_guard_alert_level                         __verse_0x735E7C84_AlertLevel;                     // 0x0022(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0xD];                                       // 0x0023(0x000D)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// VerseStruct VerseFortnite.Characters_stasis_args
// 0x0003 (0x0003 - 0x0000)
struct FCharacters_stasis_args final
{
public:
	uint8                                         __verse_0xADC8E6AA_AllowTurning : 1;               // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_0_1 : 7;                                    // 0x0000(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-8 ])
	uint8                                         __verse_0x04C721DA_AllowFalling : 1;               // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1_1 : 7;                                    // 0x0001(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-8 ])
	uint8                                         __verse_0x178F77CA_AllowEmotes : 1;                // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseFortnite.Game_damage_args
// 0x0018 (0x0018 - 0x0000)
struct FGame_damage_args final
{
public:
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_damage_result
// 0x0020 (0x0020 - 0x0000)
struct FGame_damage_result final
{
public:
	class UObject*                                __verse_0x459049A1_Target;                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_elimination_result
// 0x0010 (0x0010 - 0x0000)
struct FGame_elimination_result final
{
public:
	class UObject*                                __verse_0xC5F618E8_EliminatedCharacter;            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0x9B605FD1_EliminatingCharacter;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_healing_args
// 0x0018 (0x0018 - 0x0000)
struct FGame_healing_args final
{
public:
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_healing_result
// 0x0020 (0x0020 - 0x0000)
struct FGame_healing_result final
{
public:
	class UObject*                                __verse_0x459049A1_Target;                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseFortnite_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Magent_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lagent_Magent_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mfloat_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortnite_0::Ftuple_Lagent_Mfloat_Mfloat_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mteam_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lagent_Mteam_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_team*                       __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lvector3_Mrotation_R
// 0x0040 (0x0040 - 0x0000)
struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R
// 0x0050 (0x0050 - 0x0000)
struct Ftuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R __verse_0x932BF92E_Elem2;                    // 0x0010(0x0040)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class UObject*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class UObject*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lguard__alert__level_Mdamage__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lguard__alert__level_Mdamage__perception__settings_R final
{
public:
	EAI_guard_alert_level                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_damage_perception_settings*         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lguard__alert__level_Mhearing__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lguard__alert__level_Mhearing__perception__settings_R final
{
public:
	EAI_guard_alert_level                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_hearing_perception_settings*        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lguard__alert__level_Msight__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lguard__alert__level_Msight__perception__settings_R final
{
public:
	EAI_guard_alert_level                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_sight_perception_settings*          __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lguard__alert__level_Mtouch__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lguard__alert__level_Mtouch__perception__settings_R final
{
public:
	EAI_guard_alert_level                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAI_touch_perception_settings*          __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
// 0x0020 (0x0020 - 0x0000)
struct VerseFortnite_0::Ftuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R final
{
public:
	class UAI_navigation_target*                  __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<uint8>                              __verse_0x932BF92E_Elem2;                          // 0x0018(0x0002)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lplayer_Mtuple_L_R_Mplayer_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lplayer_Mtuple_L_R_Mplayer_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USimulation_player*                     __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Ltarget__info_Mtuple_L_R_Mtuple_L_R_R
// 0x0038 (0x0038 - 0x0000)
struct VerseFortnite_0::Ftuple_Ltarget__info_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	struct FAI_target_info                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0030)(InstancedReference, NoDestructor)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0030(0x0001)(InstancedReference, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0031(0x0001)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lteam_Mteam_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lteam_Mteam_R final
{
public:
	class USimulation_team*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_team*                       __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lvector3_Mfloat_Mfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseFortnite_0::Ftuple_Lvector3_Mfloat_Mfloat_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

