#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortniteInternal

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortniteInternal.FortControllerStateHandlerComponent.NotifyOfStateChange
// 0x0018 (0x0018 - 0x0000)
struct FortControllerStateHandlerComponent_NotifyOfStateChange final
{
public:
	class FString                                 State;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Active;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function VerseFortniteInternal.FortPlayspaceComponentHelper.HandlePlayerDied
// 0x0008 (0x0008 - 0x0000)
struct FortPlayspaceComponentHelper_HandlePlayerDied final
{
public:
	class AFortPlayerPawnAthena*                  FortPlayerPawnAthena;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortPlayspaceComponentHelper.HandlePlayerPawnPossessed
// 0x0008 (0x0008 - 0x0000)
struct FortPlayspaceComponentHelper_HandlePlayerPawnPossessed final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

