#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortniteInternal_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseFortniteInternal_classes.hpp"
#include "VersePlayspace_0_classes.hpp"
#include "VerseFortniteInternal_0_structs.hpp"
#include "VerseAssets_0_classes.hpp"
#include "EntityCore_classes.hpp"
#include "VerseSimulation_0_classes.hpp"
#include "EntityFortnite_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseConcurrency_classes.hpp"


namespace SDK
{

// VerseClass VerseFortniteInternal.Game_stat_container
// 0x0040 (0x0068 - 0x0028)
class UGame_stat_container : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xBD62F3AE__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x15ECECB2__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF8339FFD__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R(const struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R(const struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_stat_container">();
	}
	static class UGame_stat_container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_stat_container>();
	}
};

// VerseClass VerseFortniteInternal.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseFortniteInternal_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseFortniteInternal.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFortniteInternal_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFortniteInternal_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerStatus
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerStatus final : public UObject
{
public:
	static uint8 _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R(const struct Ftuple_Lplayer__component_Mplayer__status__type_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerStatus">();
	}
	static class UGame_Player_PlayerStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerStatus>();
	}
};

// VerseClass VerseFortniteInternal.Game_Item_PlayerPickupComponent
// 0x0000 (0x0028 - 0x0028)
class UGame_Item_PlayerPickupComponent final : public UObject
{
public:
	static TOptional<class UGame_Item_player_pickup_component*, true> _L_2fFortnite_2ecom_2fGame_2fItem_2fPlayerPickupComponent_N_RcreatePickup_L_Ncomponent_M_Nfort__item__definition_M_Nint_M_Nvector3_R(const struct Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Item_PlayerPickupComponent">();
	}
	static class UGame_Item_PlayerPickupComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Item_PlayerPickupComponent>();
	}
};

// VerseClass VerseFortniteInternal.Game_fort_building_settings_component
// 0x0050 (0x00D8 - 0x0088)
class UGame_fort_building_settings_component final : public UFortBuildingSettingsComponentBase
{
public:
	FVerseFunctionProperty_                       __verse_0x4AEE10CB__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x59E03D8E__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAEABD061__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5073BE0E__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5FED9001__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R(EGame_PlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R(EGame_PlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R(EGame_PlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R(EGame_PlayerSettingState __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R(EGame_PlayerSettingState __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_fort_building_settings_component">();
	}
	static class UGame_fort_building_settings_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_fort_building_settings_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_fort_item_definition
// 0x0000 (0x00C8 - 0x00C8)
class UGame_fort_item_definition final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_fort_item_definition">();
	}
	static class UGame_fort_item_definition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_fort_item_definition>();
	}
};

// VerseClass VerseFortniteInternal.Game_fort_playspace_component
// 0x0038 (0x0170 - 0x0138)
class UGame_fort_playspace_component final : public UPlayspace_playspace_component
{
public:
	FVerseFunctionProperty_                       __verse_0x43E273F3___WaitForPlayerEliminated;      // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_148[0x28];                                     // 0x0148(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class Utask* __WaitForPlayerEliminated(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_fort_playspace_component">();
	}
	static class UGame_fort_playspace_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_fort_playspace_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_fortnite_building_component
// 0x0058 (0x00B0 - 0x0058)
class UGame_fortnite_building_component final : public UEntityComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xAD9C3374__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9298102F__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x49AF8941__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA0138077__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x63EC639A__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_fortnite_building_component">();
	}
	static class UGame_fortnite_building_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_fortnite_building_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_Item_item_type
// 0x0008 (0x0030 - 0x0028)
class UGame_Item_item_type final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Item_item_type">();
	}
	static class UGame_Item_item_type* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Item_item_type>();
	}
};

// VerseClass VerseFortniteInternal.Game_Item_player_pickup_component
// 0x0058 (0x00B0 - 0x0058)
class UGame_Item_player_pickup_component final : public UEntityComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x89400523__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC3A81506__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF4552B58__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCBCBC029__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x92CBECB5__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R(const struct Ftuple_Litem__type_Mint_Mplayer__component_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R(class UGame_Item_item_type* __verse_0xB2CDDD72_Argument);
	class UGame_Item_item_type* _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R(class USimulation_player_component* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R(const struct Ftuple_Lvector3_M_Qplayer__component_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Item_player_pickup_component">();
	}
	static class UGame_Item_player_pickup_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Item_player_pickup_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerTeam
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerTeam final : public UObject
{
public:
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RContainsHumanPlayers_L_Nplayer__team_R(const struct FGame_Player_player_team& __verse_0xB2CDDD72_Argument);
	static uint8 _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_REquals_L_Nplayer__team_M_Nplayer__team_R(const struct Ftuple_Lplayer__team_Mplayer__team_R& __verse_0xB2CDDD72_Argument);
	static struct FGame_Player_player_team _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetFirstTeam(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static struct FGame_Player_player_team _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetInvalidTeam(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static struct FGame_Player_player_team _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetNextTeam_L_Nplayer__team_R(const struct FGame_Player_player_team& __verse_0xB2CDDD72_Argument);
	static struct FGame_Player_player_team _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeam_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static struct FColors_color _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamColor_L_Nplayer__team_R(const struct FGame_Player_player_team& __verse_0xB2CDDD72_Argument);
	static TArray<class USimulation_player*> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamMembers_L_Nplayer__team_R(const struct FGame_Player_player_team& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamSize_L_Nplayer__team_R(const struct FGame_Player_player_team& __verse_0xB2CDDD72_Argument);
	static struct FGame_Player_player_team _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RPickTeam_L_Nplayer_M_Nplayer__team_R(const struct Ftuple_Lplayer_Mplayer__team_R& __verse_0xB2CDDD72_Argument);
	static uint8 _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RSetTeam_L_Nplayer_M_Nplayer__team_R(const struct Ftuple_Lplayer_Mplayer__team_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerTeam">();
	}
	static class UGame_Player_PlayerTeam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerTeam>();
	}
};

// VerseClass VerseFortniteInternal.Game_Movement_projectile_movement_component
// 0x0060 (0x00E8 - 0x0088)
class UGame_Movement_projectile_movement_component final : public UVerseFortniteMovementComponentBase
{
public:
	FVerseFunctionProperty_                       __verse_0x0B25997B__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6C4C17DB__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7B2D42E9__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF24F59C9__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8040185E__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x68515442__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Movement_projectile_movement_component">();
	}
	static class UGame_Movement_projectile_movement_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Movement_projectile_movement_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player
// 0x0000 (0x0028 - 0x0028)
class UGame_Player final : public UObject
{
public:
	static struct FGame_Player_player_team Game_Player_player_team_Factory();
	static struct FGame_Player_player_team Game_Player_player_team_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player">();
	}
	static class UGame_Player* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player>();
	}
};

// VerseClass VerseFortniteInternal.Game_player_eliminated_result
// 0x0010 (0x0038 - 0x0028)
class UGame_player_eliminated_result final : public UObject
{
public:
	class USimulation_player_component*           __verse_0x7C71103B_EliminatedPlayer;               // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_player_component*, true> __verse_0xB989E158_Eliminator;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_player_eliminated_result">();
	}
	static class UGame_player_eliminated_result* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_player_eliminated_result>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_fort_player_component
// 0x0040 (0x0120 - 0x00E0)
class UGame_Player_fort_player_component final : public USimulation_player_component
{
public:
	FVerseFunctionProperty_                       __verse_0x3DB6B216__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB834237F__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFF6DF990__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD2D3E7C6__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RGetUniqueID; // 0x0110(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RGetUniqueID(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_fort_player_component">();
	}
	static class UGame_Player_fort_player_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_fort_player_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_match_stats
// 0x00F0 (0x0158 - 0x0068)
class UGame_match_stats final : public UGame_stat_container
{
public:
	FVerseFunctionProperty_                       __verse_0x822BA24C__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1F493C56__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF099193F__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAD5EC947__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x384BE6C0__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDDA80A55__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC5F988D4__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD6C53453__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAB54707E__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0F1148C3__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_108[0x50];                                     // 0x0108(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R(const struct Ftuple_Lplayer_Mint_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R(const struct Ftuple_Lplayer__team_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R(const struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R(const struct Ftuple_Lplayer_Mint_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R(const struct Ftuple_Lplayer__team_Mint_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R(const struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R(const struct Ftuple_Lplayer_Mint_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R(const struct Ftuple_Lplayer__team_Mint_Mint_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_match_stats">();
	}
	static class UGame_match_stats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_match_stats>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_player_start_component
// 0x0030 (0x0088 - 0x0058)
class UGame_Player_player_start_component final : public UEntityComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xCC113DCA__L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RaddTags_L_N_K_Kchar_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC6B8FBBB__L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RgetPosition; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	TArray<FVerseStringProperty_>                 __verse_0x7C32BFF7_tags;                           // 0x0078(0x0010)(Edit, InstancedReference, SaveGame, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RaddTags_L_N_K_Kchar_R(const TArray<FVerseStringProperty_>& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RgetPosition(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_player_start_component">();
	}
	static class UGame_Player_player_start_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_player_start_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerAttributes
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerAttributes final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RAddToNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_Nfloat_R(const struct Ftuple_Lplayer_MPlayerAttribute_Mfloat_R& __verse_0xB2CDDD72_Argument);
	static double _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RGetNumericAttributeValue_L_Nplayer_M_NPlayerAttribute_R(const struct Ftuple_Lplayer_MPlayerAttribute_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RModifyNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_NPlayerAttributeOperation_M_Nfloat_R(const struct Ftuple_Lplayer_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerAttributes">();
	}
	static class UGame_Player_PlayerAttributes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerAttributes>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerInventory
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerInventory final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RClearDroppableItems_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static uint8 _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RRemoveFromInventory_L_Nplayer_M_N_Kchar_M_Nint_R(const struct Ftuple_Lplayer_M_Kchar_Mint_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddItemToInventory_L_Nplayer_M_Nfort__item__definition_M_Nint_M_Nlogic_R(const struct Ftuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddToInventory_L_Nplayer_M_N_Kchar_M_Nint_M_Nlogic_R(const struct Ftuple_Lplayer_M_Kchar_Mint_Mlogic_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerInventory">();
	}
	static class UGame_Player_PlayerInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerInventory>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerInvulnerable
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerInvulnerable final : public UObject
{
public:
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RIsPlayerInvulnerable_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RSetPlayerInvulnerability_L_Nplayer_M_Nlogic_R(const struct Ftuple_Lplayer_Mlogic_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerInvulnerable">();
	}
	static class UGame_Player_PlayerInvulnerable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerInvulnerable>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerSpectator
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerSpectator final : public UObject
{
public:
	static TArray<class USimulation_player*> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RGetPlayersSpectatingTarget_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSetSpectator_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectateEliminator_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectatePlayer_L_Nplayer_M_Nplayer_R(const struct Ftuple_Lplayer_Mplayer_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerSpectator">();
	}
	static class UGame_Player_PlayerSpectator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerSpectator>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerStartComponent
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerStartComponent final : public UObject
{
public:
	static TArray<class UGame_Player_player_start_component*> _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStartComponent_N_RfindAllInPlayspaceWithTags_L_Ncomponent_M_N_K_Kchar_R(const struct Ftuple_Lcomponent_M_K_Kchar_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerStartComponent">();
	}
	static class UGame_Player_PlayerStartComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerStartComponent>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerStasis
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerStasis final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasis_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasisAdvanced_L_Nplayer_M_Nlogic_M_Nlogic_M_Nlogic_R(const struct Ftuple_Lplayer_Mlogic_Mlogic_Mlogic_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RReleaseFromStasis_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerStasis">();
	}
	static class UGame_Player_PlayerStasis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerStasis>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerTravel
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerTravel final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerTravel">();
	}
	static class UGame_Player_PlayerTravel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerTravel>();
	}
};

// VerseClass VerseFortniteInternal.Game_Player_PlayerVisibility
// 0x0000 (0x0028 - 0x0028)
class UGame_Player_PlayerVisibility final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerVisibility_N_RSetIsHidden_L_Nplayer_M_Nlogic_R(const struct Ftuple_Lplayer_Mlogic_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Player_PlayerVisibility">();
	}
	static class UGame_Player_PlayerVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Player_PlayerVisibility>();
	}
};

// VerseClass VerseFortniteInternal.Game_player_stat_values
// 0x0008 (0x0070 - 0x0068)
class UGame_player_stat_values final : public UGame_stat_container
{
public:
	class USimulation_player*                     __verse_0xDEE8E111_OwningPlayer;                   // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_player_stat_values">();
	}
	static class UGame_player_stat_values* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_player_stat_values>();
	}
};

// VerseClass VerseFortniteInternal.Game_StormController_storm_controller_component
// 0x0080 (0x00E8 - 0x0068)
class UGame_StormController_storm_controller_component final : public UEntityFortniteStormControllerComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x7675A710__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4D705B14__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD93DC734__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x64AA7497__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD763A2FA__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_RsetBattleRoyalePhases; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF5FB08F4__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0xA5122212_startRadius;                    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xE6BD5D91_boundsRadius;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGame_StormController_storm_phase*> __verse_0xC2790393_phases;                      // 0x00D8(0x0010)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_RsetBattleRoyalePhases(const struct VerseFortniteInternal_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_StormController_storm_controller_component">();
	}
	static class UGame_StormController_storm_controller_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_StormController_storm_controller_component>();
	}
};

// VerseClass VerseFortniteInternal.Game_StormController_storm_phase
// 0x0068 (0x0090 - 0x0028)
class UGame_StormController_storm_phase final : public UObject
{
public:
	double                                        __verse_0x4CDBEC4D_waitTime;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x96A9475A_endRadius;                      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex;                    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves : 1;                      // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        __verse_0xA376E20D_minMovementDistance;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x2C327F1D_maxMovementDistance;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation;                    // 0x0078(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_StormController_storm_phase">();
	}
	static class UGame_StormController_storm_phase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_StormController_storm_phase>();
	}
};

// VerseClass VerseFortniteInternal.Game_team_stat_values
// 0x0088 (0x00F0 - 0x0068)
class UGame_team_stat_values final : public UGame_stat_container
{
public:
	FVerseFunctionProperty_                       __verse_0xE0516D12__L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFFA43169__L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RGetPlayerStat_L_Nplayer_M_Nint_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFE7BA9E0__L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_98[0x50];                                      // 0x0098(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGame_Player_player_team               __verse_0x555B2F95_Team;                           // 0x00E8(0x0004)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RGetPlayerStat_L_Nplayer_M_Nint_R(const struct Ftuple_Lplayer_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R(const struct Ftuple_Lplayer_Mint_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R(const struct Ftuple_Lplayer_Mint_Mint_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_team_stat_values">();
	}
	static class UGame_team_stat_values* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_team_stat_values>();
	}
};

// VerseClass VerseFortniteInternal.Game_VerseFortniteHacks
// 0x0000 (0x0028 - 0x0028)
class UGame_VerseFortniteHacks final : public UObject
{
public:
	static TArray<class UEntityComponent*> _L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_NType_20where_20Type_R(const struct Ftuple_Lcomponent_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R(class USimulation_player_component* __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R(const struct Ftuple_Lplayer__component_Mplayer__start__component_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R(const struct Ftuple_Lcomponent_Mlogic_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_VerseFortniteHacks">();
	}
	static class UGame_VerseFortniteHacks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_VerseFortniteHacks>();
	}
};

// VerseClass VerseFortniteInternal.task_Game_fort_playspace_component$__WaitForPlayerEliminated
// 0x0018 (0x0158 - 0x0140)
class Utask_Game_fort_playspace_component___WaitForPlayerEliminated final : public Utask
{
public:
	class UGame_fort_playspace_component*         _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UGame_player_eliminated_result*         _RetVal;                                           // 0x0150(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Game_fort_playspace_component$__WaitForPlayerEliminated">();
	}
	static class Utask_Game_fort_playspace_component___WaitForPlayerEliminated* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Game_fort_playspace_component___WaitForPlayerEliminated>();
	}
};

}

