#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseSimulation_0

#include "Basic.hpp"

#include "VerseSimulation_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R final
{
public:
	struct VerseSimulation_0::Ftuple_Lint_Many_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R final
{
public:
	struct Ftuple_Lplayer__component_Many_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R final
{
public:
	struct VerseSimulation_0::Ftuple_Lint_Many_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R final
{
public:
	struct Ftuple_Lplayer__component_Many_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_player_component*, true> RetVal;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetSession
// 0x0010 (0x0010 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USimulation_session*                    RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime
// 0x0010 (0x0010 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R
// 0x0020 (0x0020 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_localizable_agent*          RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_0;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation.Sleep_L_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct Simulation_Sleep_L_Nfloat_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation_player_component._L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle
// 0x0010 (0x0010 - 0x0000)
struct Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USimulation_player*                     RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation_player._L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive
// 0x0003 (0x0003 - 0x0000)
struct Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseSimulation.Simulation_player_array_helper._L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseSimulation.task_Simulation$Sleep_L_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_Simulation_Sleep_L_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

