#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseWorldPartition_0

#include "Basic.hpp"

#include "VerseWorldPartition_0_structs.hpp"


namespace SDK::Params
{

// Function VerseWorldPartition.VerseWorldPartition._L_2fUnrealEngine_2ecom_2fWorldPartition_2fVerseWorldPartition_N_RGetDataLayerManager
// 0x0010 (0x0010 - 0x0000)
struct VerseWorldPartition__L_2fUnrealEngine_2ecom_2fWorldPartition_2fVerseWorldPartition_N_RGetDataLayerManager final
{
public:
	struct VerseWorldPartition_0::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UVerseWorldPartition_data_layer_manager*, true> RetVal;                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseWorldPartition.VerseWorldPartition_data_layer_manager._L_2fUnrealEngine_2ecom_2fWorldPartition_2fVerseWorldPartition_2fdata__layer__manager_N_RGetDataLayerEffectiveRuntimeState_L_Ndata__layer__asset_R
// 0x0010 (0x0010 - 0x0000)
struct VerseWorldPartition_data_layer_manager__L_2fUnrealEngine_2ecom_2fWorldPartition_2fVerseWorldPartition_2fdata__layer__manager_N_RGetDataLayerEffectiveRuntimeState_L_Ndata__layer__asset_R final
{
public:
	class UVerseWorldPartition_data_layer_asset*  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseWorldPartition_data_layer_runtime_state RetVal;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseWorldPartition.VerseWorldPartition_data_layer_manager._L_2fUnrealEngine_2ecom_2fWorldPartition_2fVerseWorldPartition_2fdata__layer__manager_N_RSetDataLayerRuntimeState_L_Ndata__layer__asset_M_Ndata__layer__runtime__state_M_Nlogic_R
// 0x0018 (0x0018 - 0x0000)
struct VerseWorldPartition_data_layer_manager__L_2fUnrealEngine_2ecom_2fWorldPartition_2fVerseWorldPartition_2fdata__layer__manager_N_RSetDataLayerRuntimeState_L_Ndata__layer__asset_M_Ndata__layer__runtime__state_M_Nlogic_R final
{
public:
	struct Ftuple_Ldata__layer__asset_Mdata__layer__runtime__state_Mlogic_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

}

