#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "VerseDevices_0_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK::Params
{

// Function VerseDevices.Devices_device_function_set_multi_parameter_base.$InitCDO
// 0x0030 (0x0030 - 0x0000)
struct Devices_device_function_set_multi_parameter_base__InitCDO final
{
public:
	TOptional<class UClass*>                      _ExprResult_0;                                     // 0x0000(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x0012(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x0013(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UClass*>                      _ExprResult_3;                                     // 0x0018(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x002B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_function_set_params_by_name._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R
// 0x0058 (0x0058 - 0x0000)
struct Devices_device_function_set_params_by_name__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R final
{
public:
	TMap<FVerseStringProperty_, class UDevices_function_parameter_base*> __verse_0xB2CDDD72_Argument; // 0x0000(0x0050)(Parm, ContainsInstancedReference)
	TOptional<class UDevices_function_parameter_base*, true> RetVal;                                 // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_object._L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R
// 0x0190 (0x0190 - 0x0000)
struct Devices_creative_object__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0060(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_0;                                // 0x0062(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0068(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtransform_R _ExprResult_2;                           // 0x0080(0x0070)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_3;                                     // 0x00F0(0x0001)(HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_4;                                // 0x00F1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x00F8(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtransform_R _ExprResult_6;                           // 0x0110(0x0070)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_7;                                     // 0x0180(0x0001)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_object._L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R
// 0x01C0 (0x01C0 - 0x0000)
struct Devices_creative_object__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R final
{
public:
	struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0040(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_0;                                // 0x0042(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0048(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R _ExprResult_2;          // 0x0060(0x0050)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_3;                                     // 0x00B0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R _ExprResult_4;                                // 0x00C0(0x0040)(HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0100(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0108(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R _ExprResult_7;          // 0x0120(0x0050)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_8;                                     // 0x0170(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R _ExprResult_9;                                // 0x0180(0x0040)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_object._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
// 0x00C0 (0x00C0 - 0x0000)
struct Devices_creative_object__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0070(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R _ExprResult_1;                           // 0x0080(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_2;                                     // 0x0090(0x0001)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_3;                                     // 0x0091(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0098(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R _ExprResult_5;                           // 0x00A8(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_6;                                     // 0x00B8(0x0001)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_7;                                     // 0x00B9(0x0001)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_object.MoveTo_L_Ntransform_M_Nfloat_R
// 0x00A0 (0x00A0 - 0x0000)
struct Devices_creative_object_MoveTo_L_Ntransform_M_Nfloat_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Ltransform_Mfloat_R             __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0070)(Parm, HasGetValueTypeHash)
	class Utask*                                  RetVal;                                            // 0x0090(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_object.MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0080 (0x0080 - 0x0000)
struct Devices_creative_object_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lvector3_Mrotation_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0050)(Parm, HasGetValueTypeHash)
	class Utask*                                  RetVal;                                            // 0x0070(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_device_base._L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal
// 0x0001 (0x0001 - 0x0000)
struct Devices_creative_device_base__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_device_base._L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal
// 0x0001 (0x0001 - 0x0000)
struct Devices_creative_device_base__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseDevices.task_Devices_creative_device$OnBegin.Update
// 0x0008 (0x0008 - 0x0000)
struct task_Devices_creative_device_OnBegin_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_function_set_vector3._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__vector3_N_RInvoke_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct Devices_device_function_set_vector3__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__vector3_N_RInvoke_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Rdevice__event
// 0x0030 (0x0030 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Rdevice__event final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R
// 0x0010 (0x0010 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R final
{
public:
	class UTags_tag_search_criteria*              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R
// 0x04B8 (0x04B8 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R final
{
public:
	EDevices_move_to_internal_result              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_result                       RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0008(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_1;                                // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_4;                               // 0x0050(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_5;                                // 0x0060(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_3;                     // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_8;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__4;                             // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_9;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00B8(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_11;                                    // 0x00C8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_5;                        // 0x00F0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x0100(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_14;                                    // 0x0110(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_6;                        // 0x0120(0x0010)(ContainsInstancedReference)
	struct VerseDevices_0::Ftuple_L_Kchar_M_Kchar_R __verse_0x00000000__7;                           // 0x0130(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_16;                               // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_18;                               // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_19;                               // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_20;                                     // 0x01A0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_21;                                      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_22;                                     // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_9;                         // 0x01C0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_23;                                    // 0x01D0(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_10;                       // 0x01E0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_24;                                     // 0x01F0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_25;                                      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_26;                                     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_12;                        // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        _ExprResult_27;                                    // 0x0218(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_28;                                     // 0x0228(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_29;                                      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_30;                                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_14;                        // 0x0248(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_31;                                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             _ExprResult_32;                                    // 0x0259(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_33;                              // 0x0260(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_34;                               // 0x0270(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_35;                                    // 0x0288(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_36;                                    // 0x0298(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_37;                              // 0x02A8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_38;                               // 0x02B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_39;                                    // 0x02D0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_40;                                    // 0x02E0(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_17;                    // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_41;                               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__18;                            // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_42;                         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_43;                                        // 0x0310(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_44;                                    // 0x0320(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_45;                                    // 0x0338(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_19;                       // 0x0348(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_46;                                        // 0x0358(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_47;                                    // 0x0368(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_20;                       // 0x0378(0x0010)(ContainsInstancedReference)
	struct VerseDevices_0::Ftuple_L_Kchar_M_Kchar_R __verse_0x00000000__21;                          // 0x0388(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_48;                                    // 0x03A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_49;                               // 0x03B8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_50;                                        // 0x03C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_51;                               // 0x03D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_52;                               // 0x03E8(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_53;                                     // 0x03F8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_54;                                      // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_55;                                     // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_23;                        // 0x0418(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_56;                                    // 0x0428(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_24;                       // 0x0438(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_57;                                     // 0x0448(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_58;                                      // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_59;                                     // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_26;                        // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        _ExprResult_60;                                    // 0x0470(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_61;                                     // 0x0480(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_62;                                      // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_63;                                     // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_28;                        // 0x04A0(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_64;                                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             _ExprResult_65;                                    // 0x04B1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RHandleTeleportToResult_L_Nteleport__to__result_R
// 0x0730 (0x0730 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_RHandleTeleportToResult_L_Nteleport__to__result_R final
{
public:
	EDevices_teleport_to_result                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_1;                               // 0x0008(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_2;                                // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_4;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_3;                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x8BA81554_LogString_3;                    // 0x0060(0x0010)(HasGetValueTypeHash)
	EDevices_teleport_to_result                   __verse_0x00000000__4;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_6;                               // 0x0078(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_7;                                // 0x0088(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_8;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_9;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_10;                              // 0x00C0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_11;                               // 0x00D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_12;                                    // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_13;                                    // 0x00F8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_14;                              // 0x0108(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_15;                               // 0x0118(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_16;                                    // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_17;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_18;                              // 0x0150(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_19;                               // 0x0160(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_20;                                    // 0x0178(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_21;                                    // 0x0188(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__10;                            // 0x0198(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_22;                         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_23;                                        // 0x01A8(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_24;                                    // 0x01B8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_11;                       // 0x01E0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x01F0(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_27;                                    // 0x0200(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_12;                       // 0x0210(0x0010)(ContainsInstancedReference)
	struct VerseDevices_0::Ftuple_L_Kchar_M_Kchar_R __verse_0x00000000__13;                          // 0x0220(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_28;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_29;                               // 0x0250(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_30;                                        // 0x0260(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_31;                               // 0x0270(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_32;                               // 0x0280(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_33;                                     // 0x0290(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_34;                                      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_35;                                     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_15;                        // 0x02B0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_36;                                    // 0x02C0(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_16;                       // 0x02D0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_37;                                     // 0x02E0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_38;                                      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_39;                                     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_18;                        // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        _ExprResult_40;                                    // 0x0308(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_41;                                     // 0x0318(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_42;                                      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_43;                                     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_20;                        // 0x0338(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_44;                                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             _ExprResult_45;                                    // 0x0349(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B[0x5];                                      // 0x034B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_46;                              // 0x0350(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_47;                               // 0x0360(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_48;                                    // 0x0378(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_49;                                    // 0x0388(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_50 : 1;                                // 0x0398(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_51;                              // 0x03A0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_52;                               // 0x03B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_53;                                    // 0x03C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_54;                                    // 0x03D8(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_23;                    // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_55;                               // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x8BA81554_LogString_23;                   // 0x03F8(0x0010)(HasGetValueTypeHash)
	EDevices_teleport_to_result                   __verse_0x00000000__24;                            // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_56;                              // 0x0410(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_57;                               // 0x0420(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_58;                                    // 0x0438(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_59;                                    // 0x0448(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_60;                              // 0x0458(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_61;                               // 0x0468(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_62;                                    // 0x0480(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_63;                                    // 0x0490(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_64;                              // 0x04A0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_65;                               // 0x04B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_66;                                    // 0x04C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_67;                                    // 0x04D8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_68;                              // 0x04E8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_69;                               // 0x04F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_70;                                    // 0x0510(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_71;                                    // 0x0520(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__30;                            // 0x0530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_72;                         // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_73;                                        // 0x0540(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_74;                                    // 0x0550(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_75;                                    // 0x0568(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_31;                       // 0x0578(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_76;                                        // 0x0588(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_77;                                    // 0x0598(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_32;                       // 0x05A8(0x0010)(ContainsInstancedReference)
	struct VerseDevices_0::Ftuple_L_Kchar_M_Kchar_R __verse_0x00000000__33;                          // 0x05B8(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_78;                                    // 0x05D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_79;                               // 0x05E8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_80;                                        // 0x05F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_81;                               // 0x0608(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_82;                               // 0x0618(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_83;                                     // 0x0628(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_84;                                      // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_85;                                     // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_35;                        // 0x0648(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_86;                                    // 0x0658(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_36;                       // 0x0668(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_87;                                     // 0x0678(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_88;                                      // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_89;                                     // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_38;                        // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        _ExprResult_90;                                    // 0x06A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_91;                                     // 0x06B0(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_92;                                      // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_93;                                     // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_40;                        // 0x06D0(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_94;                                    // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             _ExprResult_95;                                    // 0x06E1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3[0x5];                                      // 0x06E3(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        InvokeResultDummy_96;                              // 0x06E8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_97;                               // 0x06F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_98;                                    // 0x0710(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_99;                                    // 0x0720(0x0010)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0070 (0x0070 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R
// 0x01C0 (0x01C0 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R final
{
public:
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0070)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0070(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevices_teleport_to_result                   __verse_0x95D09D0E_Result_1;                       // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0078(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R _ExprResult_2;            // 0x0090(0x0070)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_3;                                     // 0x0100(0x0001)(HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_4;                                // 0x0101(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0108(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_6;                                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevices_teleport_to_result                   __verse_0x95D09D0E_Result_2;                       // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0120(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R _ExprResult_8;            // 0x0130(0x0070)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_9;                                     // 0x01A0(0x0001)(HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_10;                               // 0x01A1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01A8(0x0010)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R
// 0x02C0 (0x02C0 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R final
{
public:
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0050)(Parm, HasGetValueTypeHash)
