#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseEngine

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "VerseEngine_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseConcurrency_classes.hpp"


namespace SDK
{

// VerseClass VerseEngine.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseEngine::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseEngine.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseEngine::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseEngine::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseEngine.VerseEngine_multicast_delegate_base
// 0x0000 (0x0028 - 0x0028)
class UVerseEngine_multicast_delegate_base : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_multicast_delegate_base">();
	}
	static class UVerseEngine_multicast_delegate_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_multicast_delegate_base>();
	}
};

// VerseClass VerseEngine.VerseEngine_multicast_delegate
// 0x0070 (0x0098 - 0x0028)
class UVerseEngine_multicast_delegate : public UVerseEngine_multicast_delegate_base
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       __verse_0x885C3C19__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE4680DC9__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty(const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_multicast_delegate">();
	}
	static class UVerseEngine_multicast_delegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_multicast_delegate>();
	}
};

// VerseClass VerseEngine.VerseEngine_Entity_entity
// 0x00B8 (0x00E0 - 0x0028)
class UVerseEngine_Entity_entity final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x370466DA__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6CDE1760__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFF4720DE__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF82444AF__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6C470E29__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6F1CCD75__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0D438DE2__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD0A22E5C__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFD2C7399__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x13AF8BC4__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF9F147A4__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy(const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TArray<class UEntityComponent*> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname(const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName(const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R(class UVerseEngine_Entity_entity* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_Entity_entity">();
	}
	static class UVerseEngine_Entity_entity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_Entity_entity>();
	}
};

// VerseClass VerseEngine.task_VerseEngine_subscribable_event$Await
// 0x0020 (0x0160 - 0x0140)
class Utask_VerseEngine_subscribable_event_Await final : public Utask
{
public:
	class UVerseEngine_subscribable_event*        _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseEngine::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseDynamicProperty_                        _RetVal;                                           // 0x0150(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseEngine_subscribable_event$Await">();
	}
	static class Utask_VerseEngine_subscribable_event_Await* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseEngine_subscribable_event_Await>();
	}
};

// VerseClass VerseEngine.VerseEngine
// 0x0000 (0x0028 - 0x0028)
class UVerseEngine final : public UObject
{
public:
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate(const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event(const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine">();
	}
	static class UVerseEngine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine>();
	}
};

// VerseClass VerseEngine.VerseEngine_multicast_delegate_subscription
// 0x0028 (0x0050 - 0x0028)
class UVerseEngine_multicast_delegate_subscription final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x08089514__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UVerseEngine_multicast_delegate_base*, true> __verse_0xC5BA7E5B_InternalDelegate; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_multicast_delegate_subscription">();
	}
	static class UVerseEngine_multicast_delegate_subscription* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_multicast_delegate_subscription>();
	}
};

// VerseClass VerseEngine.VerseEngine_Entity_EntityHelpers
// 0x0000 (0x0028 - 0x0028)
class UVerseEngine_Entity_EntityHelpers final : public UObject
{
public:
	static uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);
	static TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R(const struct VerseEngine::Ftuple_Lcomponent_Many_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVerseEngine_Entity_entity*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_Entity_EntityHelpers">();
	}
	static class UVerseEngine_Entity_EntityHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_Entity_EntityHelpers>();
	}
};

// VerseClass VerseEngine.VerseEngine_subscribable_event
// 0x0038 (0x00D0 - 0x0098)
class UVerseEngine_subscribable_event final : public UVerseEngine_multicast_delegate
{
public:
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await;                          // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class Utask* Await(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseEngine::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_subscribable_event">();
	}
	static class UVerseEngine_subscribable_event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_subscribable_event>();
	}
};

}

