#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseUI

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseAssets_0_classes.hpp"
#include "VerseUI_0_classes.hpp"
#include "VerseUI_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK
{

// VerseClass VerseUI.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseUI::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseUI.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseUI::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseUI::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseUI.UI
// 0x0000 (0x0028 - 0x0028)
class VerseUI::UUI final : public UObject
{
public:
	static TOptional<class UUI_player_ui*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RGetPlayerUI_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static struct FUI_canvas_slot _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RMakeCanvasSlot_L_Nwidget_M_Nvector2_M_N_QSize_Nvector2_20_3d_20_2e_2e_2e_M_N_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_N_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R(const struct Ftuple_Lwidget_Mvector2_M_QSize_Nvector2_20_3d_20_2e_2e_2e_M_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	static struct FUI_anchors UI_anchors_Factory();
	static struct FUI_anchors UI_anchors_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_button_slot UI_button_slot_Factory();
	static struct FUI_button_slot UI_button_slot_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_canvas_slot UI_canvas_slot_Factory();
	static struct FUI_canvas_slot UI_canvas_slot_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_margin UI_margin_Factory();
	static struct FUI_margin UI_margin_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_overlay_slot UI_overlay_slot_Factory();
	static struct FUI_overlay_slot UI_overlay_slot_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_player_ui_slot UI_player_ui_slot_Factory();
	static struct FUI_player_ui_slot UI_player_ui_slot_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_stack_box_slot UI_stack_box_slot_Factory();
	static struct FUI_stack_box_slot UI_stack_box_slot_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_user_widget_slot UI_user_widget_slot_Factory();
	static struct FUI_user_widget_slot UI_user_widget_slot_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FUI_widget_message UI_widget_message_Factory();
	static struct FUI_widget_message UI_widget_message_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseUI.UI", true>();
	}
	static class VerseUI::UUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseUI::UUI>();
	}
};

// VerseClass VerseUI.UI_player_ui
// 0x0030 (0x0108 - 0x00D8)
class UUI_player_ui final : public UVersePlayerUIEntityComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xE8471EC0__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9CAF6A3C__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x500B452A__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R(const struct Ftuple_Lwidget_Mplayer__ui__slot_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R(class UUI_widget* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R(class UUI_widget* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_player_ui">();
	}
	static class UUI_player_ui* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_player_ui>();
	}
};

// VerseClass VerseUI.UI_widget
// 0x0060 (0x0098 - 0x0038)
class UUI_widget : public UVerseWidgetNativeBase
{
public:
	FVerseFunctionProperty_                       __verse_0x0D44E5E4__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x865377A1__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBCEF040C__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x162E45CB__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB06CF1AE__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6548A497__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UUI_widget*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UUI_widget*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EUI_widget_visibility _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R(EUI_widget_visibility __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_widget">();
	}
	static class UUI_widget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_widget>();
	}
};

// VerseClass VerseUI.UI_material_block
// 0x0090 (0x0128 - 0x0098)
class UUI_material_block final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0x3E0643A9__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x27C1539A__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4706072B__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC1A3BE6B__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA495D8AC__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x259457F8__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_material*                       __verse_0x800C064C_DefaultImage;                   // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColors_color                          __verse_0xC0C585F9_DefaultTint;                    // 0x0100(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   __verse_0x4DD253BC_DefaultDesiredSize;             // 0x0118(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAssets_material* _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R(const struct FSpatialMath_vector2& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R(class UAssets_material* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_material_block">();
	}
	static class UUI_material_block* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_material_block>();
	}
};

// VerseClass VerseUI.UI_canvas
// 0x0030 (0x00C8 - 0x0098)
class UUI_canvas final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0x5E20D1F1__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x76C2E6B2__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	TArray<struct FUI_canvas_slot>                __verse_0x5AE077E0_Slots;                          // 0x00B8(0x0010)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R(const struct FUI_canvas_slot& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R(class UUI_widget* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_canvas">();
	}
	static class UUI_canvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_canvas>();
	}
};

// VerseClass VerseUI.UI_text_base
// 0x00D0 (0x0168 - 0x0098)
class UUI_text_base : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0x62A68F6D__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetText_L_Nmessage_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0FA1D51C__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetText; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x54FF9ADE__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetJustification_L_Ntext__justification_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBDD9B245__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetJustification; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6A27BF3C__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetOverflowPolicy_L_Ntext__overflow__policy_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE154BECE__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetOverflowPolicy; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8E631792__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextColor_L_Ncolor_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6A63948C__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextColor; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x184A045A__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x27B864A9__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextOpacity; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0xEDB05B46_DefaultText;                    // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x5DC97209_DefaultTextColor;               // 0x0140(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x1EA9AC7C_DefaultTextOpacity;             // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUI_text_justification                        __verse_0x616A37A2_DefaultJustification;           // 0x0160(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUI_text_overflow_policy                      __verse_0x5C09BE1D_DefaultOverflowPolicy;          // 0x0161(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	EUI_text_justification _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetJustification(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EUI_text_overflow_policy _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetOverflowPolicy(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetText(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextColor(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextOpacity(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetJustification_L_Ntext__justification_R(EUI_text_justification __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetOverflowPolicy_L_Ntext__overflow__policy_R(EUI_text_overflow_policy __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextColor_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_text_base">();
	}
	static class UUI_text_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_text_base>();
	}
};

// VerseClass VerseUI.UI_text_block_internal
// 0x0000 (0x0168 - 0x0168)
class UUI_text_block_internal final : public UUI_text_base
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_text_block_internal">();
	}
	static class UUI_text_block_internal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_text_block_internal>();
	}
};

// VerseClass VerseUI.UI_button
// 0x0058 (0x00F0 - 0x0098)
class UUI_button final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0x3902EF20__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_RSetWidget_L_Nbutton__slot_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x337F5016__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_ROnClick; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	struct FUI_button_slot                        __verse_0x9693E4CD_Slot;                           // 0x00B8(0x0030)(InstancedReference, NoDestructor)
	class UVerseEngine_subscribable_event*        __verse_0x6B2BB37E_OnClickInternal;                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_ROnClick(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_RSetWidget_L_Nbutton__slot_R(const struct FUI_button_slot& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_button">();
	}
	static class UUI_button* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_button>();
	}
};

// VerseClass VerseUI.UI_color_block
// 0x0090 (0x0128 - 0x0098)
class UUI_color_block final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0xCAEFE031__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetColor_L_Ncolor_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x67ABD452__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetColor; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAD1CAB99__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4EB70EF4__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetOpacity; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCB251B4C__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetDesiredSize_L_Nvector2_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFDF14587__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetDesiredSize; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	struct FColors_color                          __verse_0xA0FC371C_DefaultColor;                   // 0x00F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x5DA10C15_DefaultOpacity;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   __verse_0x4DD253BC_DefaultDesiredSize;             // 0x0118(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetColor(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetDesiredSize(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetOpacity(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetColor_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetDesiredSize_L_Nvector2_R(const struct FSpatialMath_vector2& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_color_block">();
	}
	static class UUI_color_block* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_color_block>();
	}
};

// VerseClass VerseUI.UI_overlay
// 0x0030 (0x00C8 - 0x0098)
class UUI_overlay final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0xA6255407__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RAddWidget_L_Noverlay__slot_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8C9DA1CF__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RRemoveWidget_L_Nwidget_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	TArray<struct FUI_overlay_slot>               __verse_0x5AE077E0_Slots;                          // 0x00B8(0x0010)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RAddWidget_L_Noverlay__slot_R(const struct FUI_overlay_slot& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RRemoveWidget_L_Nwidget_R(class UUI_widget* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_overlay">();
	}
	static class UUI_overlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_overlay>();
	}
};

// VerseClass VerseUI.UI_simple_button_internal
// 0x0030 (0x00C8 - 0x0098)
class UUI_simple_button_internal final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0x7A4CBAF8__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_RSetText_L_Nmessage_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF7FC2FF5__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_ROnClick; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0xEDB05B46_DefaultText;                    // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x6B2BB37E_OnClickInternal;                // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_ROnClick(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_RSetText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_simple_button_internal">();
	}
	static class UUI_simple_button_internal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_simple_button_internal>();
	}
};

// VerseClass VerseUI.UI_stack_box
// 0x0038 (0x00D0 - 0x0098)
class UUI_stack_box final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0xA38332DB__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RAddWidget_L_Nstack__box__slot_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA1994F42__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RRemoveWidget_L_Nwidget_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	TArray<struct FUI_stack_box_slot>             __verse_0x5AE077E0_Slots;                          // 0x00B8(0x0010)(InstancedReference, ContainsInstancedReference)
	EUI_orientation                               __verse_0x4DFAB8C8_Orientation;                    // 0x00C8(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RAddWidget_L_Nstack__box__slot_R(const struct FUI_stack_box_slot& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RRemoveWidget_L_Nwidget_R(class UUI_widget* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_stack_box">();
	}
	static class UUI_stack_box* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_stack_box>();
	}
};

// VerseClass VerseUI.UI_texture_block
// 0x00B8 (0x0150 - 0x0098)
class UUI_texture_block final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0xAA969F34__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetImage_L_Ntexture_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6D457009__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetImage; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x529AC274__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTint_L_Ncolor_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDBC5F34C__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTint; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4E2F72CD__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetDesiredSize_L_Nvector2_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFD3FDB6D__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetDesiredSize; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1BFD369D__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTiling_L_Nimage__tiling_M_Nimage__tiling_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB26FF2D8__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTiling; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_texture*                        __verse_0x800C064C_DefaultImage;                   // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColors_color                          __verse_0xC0C585F9_DefaultTint;                    // 0x0120(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   __verse_0x4DD253BC_DefaultDesiredSize;             // 0x0138(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	EUI_image_tiling                              __verse_0xAF9B7624_DefaultHorizontalTiling;        // 0x0148(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUI_image_tiling                              __verse_0xF679588B_DefaultVerticalTiling;          // 0x0149(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetDesiredSize(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAssets_texture* _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetImage(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Ftuple_Limage__tiling_Mimage__tiling_R _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTiling(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTint(const struct VerseUI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetDesiredSize_L_Nvector2_R(const struct FSpatialMath_vector2& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetImage_L_Ntexture_R(class UAssets_texture* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTiling_L_Nimage__tiling_M_Nimage__tiling_R(const struct Ftuple_Limage__tiling_Mimage__tiling_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTint_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_texture_block">();
	}
	static class UUI_texture_block* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_texture_block>();
	}
};

// VerseClass VerseUI.UI_user_widget
// 0x0028 (0x00C0 - 0x0098)
class UUI_user_widget final : public UUI_widget
{
public:
	FVerseFunctionProperty_                       __verse_0xCF873285__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fuser__widget_N_RSetWidget_L_Nuser__widget__slot_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UUI_widget_class*                       __verse_0x26CD6686_Asset;                          // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FUI_user_widget_slot>           __verse_0x5AE077E0_Slots;                          // 0x00B0(0x0010)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fuser__widget_N_RSetWidget_L_Nuser__widget__slot_R(const struct FUI_user_widget_slot& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_user_widget">();
	}
	static class UUI_user_widget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_user_widget>();
	}
};

// VerseClass VerseUI.UI_widget_class
// 0x0000 (0x00C8 - 0x00C8)
class UUI_widget_class final : public UAssets_client_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_widget_class">();
	}
	static class UUI_widget_class* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_widget_class>();
	}
};

}

