#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseCreature_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "VerseConcurrency_classes.hpp"
#include "VerseCreature_0_structs.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "VerseAIBase_classes.hpp"
#include "VerseCreature_classes.hpp"


namespace SDK
{

// VerseClass VerseCreature.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseCreature_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseCreature.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseCreature_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseCreature_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseCreature.task_VerseCreature_creature_component$RoamAround
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseCreature_creature_component_RoamAround final : public Utask
{
public:
	class UVerseCreature_creature_component*      _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EAI_navigation_result                         _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseCreature_creature_component$RoamAround">();
	}
	static class Utask_VerseCreature_creature_component_RoamAround* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseCreature_creature_component_RoamAround>();
	}
};

// VerseClass VerseCreature.task_VerseCreature_creature_component$MaintainFocus_L_Nagent_R
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseCreature_creature_component_MaintainFocus_L_Nagent_R final : public Utask
{
public:
	class UVerseCreature_creature_component*      _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseCreature_creature_component$MaintainFocus_L_Nagent_R">();
	}
	static class Utask_VerseCreature_creature_component_MaintainFocus_L_Nagent_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseCreature_creature_component_MaintainFocus_L_Nagent_R>();
	}
};

// VerseClass VerseCreature.task_VerseCreature_creature_component$Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0018 (0x0158 - 0x0140)
class Utask_VerseCreature_creature_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R final : public Utask
{
public:
	class UVerseCreature_creature_component*      _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseCreature_creature_component$Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R">();
	}
	static class Utask_VerseCreature_creature_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseCreature_creature_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R>();
	}
};

// VerseClass VerseCreature.task_VerseCreature_creature_component$MaintainFocus_L_Nvector3_R
// 0x0020 (0x0160 - 0x0140)
class Utask_VerseCreature_creature_component_MaintainFocus_L_Nvector3_R final : public Utask
{
public:
	class UVerseCreature_creature_component*      _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseCreature_creature_component$MaintainFocus_L_Nvector3_R">();
	}
	static class Utask_VerseCreature_creature_component_MaintainFocus_L_Nvector3_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseCreature_creature_component_MaintainFocus_L_Nvector3_R>();
	}
};

// VerseClass VerseCreature.VerseCreature_creature_component
// 0x0080 (0x0110 - 0x0090)
class UVerseCreature_creature_component : public UAIActionsComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xA9D01BCC_RoamAround;                     // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x514829C1_MoveInRangeToAttack;            // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1EAD0FC6_MaintainFocus_L_Nvector3_R;     // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0A187AEF_MaintainFocus_L_Nagent_R;       // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x122D082A__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1B82C516_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD5205DFA__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0413F356_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<struct FSpatialMath_vector3> _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* MaintainFocus_L_Nagent_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class Utask* MaintainFocus_L_Nvector3_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	class Utask* MoveInRangeToAttack(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseCreature_0::Ftuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class Utask* RoamAround(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, TOptional<double> __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCreature_creature_component">();
	}
	static class UVerseCreature_creature_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreature_creature_component>();
	}
};

// VerseClass VerseCreature.task_VerseCreature_creature_component$MoveInRangeToAttack
// 0x0010 (0x0150 - 0x0140)
class Utask_VerseCreature_creature_component_MoveInRangeToAttack final : public Utask
{
public:
	class UVerseCreature_creature_component*      _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseCreature_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0148(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0149(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseCreature_creature_component$MoveInRangeToAttack">();
	}
	static class Utask_VerseCreature_creature_component_MoveInRangeToAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseCreature_creature_component_MoveInRangeToAttack>();
	}
};

// VerseClass VerseCreature.task_VerseCreature_creature_component$NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
// 0x0030 (0x0170 - 0x0140)
class Utask_VerseCreature_creature_component_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R final : public Utask
{
public:
	class UVerseCreature_creature_component*      _Self;                                             // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseCreature_0::Ftuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0148(0x0020)(Parm, HasGetValueTypeHash)
	EAI_navigation_result                         _RetVal;                                           // 0x0168(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseCreature_creature_component$NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R">();
	}
	static class Utask_VerseCreature_creature_component_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseCreature_creature_component_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R>();
	}
};

// VerseClass VerseCreature.VerseCreature_creature_perception_component
// 0x0150 (0x01E0 - 0x0090)
class UVerseCreature_creature_perception_component final : public UCreaturePerceptionComponentBase
{
public:
	class UVerseEngine_subscribable_event*        __verse_0x37CE090D_TargetAddedEventInternal;       // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x28B5F127_TargetInfoUpdatedEventInternal; // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xD6383700_TargetRemovedEventInternal;     // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xE42441E1_TargetSeenEventInternal;        // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xB168CA6A_TargetHeardEventInternal;       // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xDEC602CE_TargetTouchedEventInternal;     // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_C0[0x20];                                      // 0x00C0(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseFunctionProperty_                       __verse_0x7E0D7504__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTargets; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB6D0F238__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTarget_L_Nagent_R; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDF072BFE__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetAddedEvent; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8BA8255B__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetInfoUpdatedEvent; // 0x0110(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x42F9EC3C__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetRemovedEvent; // 0x0120(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xABF0E3C3__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetSeenEvent; // 0x0130(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF1FD6A21__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetHeardEvent; // 0x0140(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x25004E1E__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetTouchedEvent; // 0x0150(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB4EC626B__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetSightSettings; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x096625A1__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetSightSettings_L_Nsight__perception__settings_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x482B15BC__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetHearingSettings; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x077D18FC__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetHearingSettings_L_Nhearing__perception__settings_R; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAB32EF42__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetTouchSettings; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8190F056__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetTouchSettings_L_Ntouch__perception__settings_R; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1D4517F5__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDamageSettings; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB6014F43__L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetDamageSettings_L_Ndamage__perception__settings_R; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UAI_damage_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDamageSettings(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FAI_target_info> _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTarget_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TArray<struct FAI_target_info> _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTargets(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAI_hearing_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetHearingSettings(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAI_sight_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetSightSettings(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAI_touch_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetTouchSettings(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetDamageSettings_L_Ndamage__perception__settings_R(class UAI_damage_perception_settings* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetHearingSettings_L_Nhearing__perception__settings_R(class UAI_hearing_perception_settings* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetSightSettings_L_Nsight__perception__settings_R(class UAI_sight_perception_settings* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetTouchSettings_L_Ntouch__perception__settings_R(class UAI_touch_perception_settings* __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetAddedEvent(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetHeardEvent(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetInfoUpdatedEvent(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetRemovedEvent(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetSeenEvent(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetTouchedEvent(const struct VerseCreature_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCreature_creature_perception_component">();
	}
	static class UVerseCreature_creature_perception_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreature_creature_perception_component>();
	}
};

}

