#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseUI

#include "Basic.hpp"

#include "VerseUI_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK::Params
{

// Function VerseUI.UI._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RGetPlayerUI_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct UI__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RGetPlayerUI_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UUI_player_ui*, true>         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseUI.UI._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RMakeCanvasSlot_L_Nwidget_M_Nvector2_M_N_QSize_Nvector2_20_3d_20_2e_2e_2e_M_N_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_N_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R
// 0x00C0 (0x00C0 - 0x0000)
struct UI__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RMakeCanvasSlot_L_Nwidget_M_Nvector2_M_N_QSize_Nvector2_20_3d_20_2e_2e_2e_M_N_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_N_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Lwidget_Mvector2_M_QSize_Nvector2_20_3d_20_2e_2e_2e_M_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0058)(Parm, HasGetValueTypeHash)
	struct FUI_canvas_slot                        RetVal;                                            // 0x0058(0x0068)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseUI.UI.UI_anchors$Factory
// 0x0220 (0x0220 - 0x0000)
struct UI_UI_anchors_Factory final
{
public:
	struct FUI_anchors                            RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   _ExprResult_0;                                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0030(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector2                   _ExprResult_4;                                     // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_5;                                // 0x00B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector2                   _ExprResult_8;                                     // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_9;                                // 0x0130(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector2                   _ExprResult_12;                                    // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_13;                               // 0x01B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0210(0x0010)(HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_anchors$OverrideFactory
// 0x02D0 (0x02D0 - 0x0000)
struct UI_UI_anchors_OverrideFactory final
{
public:
	struct FUI_anchors                            RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0020(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0070(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0080(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_2;                                     // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x0098(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_6;                                // 0x0108(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_7;                                     // 0x0118(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_8;                                     // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_9;                                // 0x0130(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_12;                               // 0x01A0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_13;                                    // 0x01B0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_14;                                    // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_15;                               // 0x01C8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x0218(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0228(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_18;                               // 0x0238(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_19;                                    // 0x0248(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_20;                                    // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_21;                               // 0x0260(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_22;                                    // 0x02B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x02C0(0x0010)(HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_button_slot$Factory
// 0x0070 (0x0070 - 0x0000)
struct UI_UI_button_slot_Factory final
{
public:
	struct FUI_button_slot                        RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FUI_margin                             _ExprResult_0;                                     // 0x0030(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FUI_margin                             _ExprResult_1;                                     // 0x0050(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_button_slot$OverrideFactory
// 0x0150 (0x0150 - 0x0000)
struct UI_UI_button_slot_OverrideFactory final
{
public:
	struct FUI_button_slot                        RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0030(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0080(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0090(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x0098(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x00A8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_4;                                // 0x00B0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_5;                                     // 0x00C0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_6;                                     // 0x00C8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_7;                                // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_8;                                     // 0x00F8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_9;                                // 0x0100(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_10;                                    // 0x0110(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_11;                               // 0x0118(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_12;                                    // 0x0128(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_13;                                    // 0x0130(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_canvas_slot$Factory
// 0x01E8 (0x01E8 - 0x0000)
struct UI_UI_canvas_slot_Factory final
{
public:
	struct FUI_canvas_slot                        RetVal;                                            // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FUI_anchors                            _ExprResult_0;                                     // 0x0068(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FUI_margin                             _ExprResult_1;                                     // 0x0088(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   _ExprResult_2;                                     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x00B8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0108(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0118(0x0010)(HasGetValueTypeHash)
	struct FUI_anchors                            _ExprResult_6;                                     // 0x0128(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FUI_margin                             _ExprResult_7;                                     // 0x0148(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   _ExprResult_8;                                     // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_9;                                // 0x0178(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_canvas_slot$OverrideFactory
// 0x0328 (0x0328 - 0x0000)
struct UI_UI_canvas_slot_OverrideFactory final
{
public:
	struct FUI_canvas_slot                        RetVal;                                            // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0068(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x00B8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x00C8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_anchors                            _ExprResult_2;                                     // 0x00D0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_3;                                // 0x00F0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_4;                                     // 0x0100(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_5;                                     // 0x0108(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_6;                                // 0x0128(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_7;                                     // 0x0138(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_8;                                // 0x0140(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_9;                                     // 0x0150(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_10;                                    // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_11;                               // 0x0168(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_14;                               // 0x01D8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_15;                                    // 0x01E8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_16;                               // 0x01F0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_17;                                    // 0x0200(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_anchors                            _ExprResult_18;                                    // 0x0208(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_19;                               // 0x0228(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_20;                                    // 0x0238(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_21;                                    // 0x0240(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_22;                               // 0x0260(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_23;                                    // 0x0270(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_24;                               // 0x0278(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_25;                                    // 0x0288(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   _ExprResult_26;                                    // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_27;                               // 0x02A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_28;                                    // 0x02F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_29;                                    // 0x0300(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_30;                               // 0x0310(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_31;                                    // 0x0320(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_margin$Factory
// 0x0020 (0x0020 - 0x0000)
struct UI_UI_margin_Factory final
{
public:
	struct FUI_margin                             RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_margin$OverrideFactory
// 0x0130 (0x0130 - 0x0000)
struct UI_UI_margin_OverrideFactory final
{
public:
	struct FUI_margin                             RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0020(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0070(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0080(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x0088(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x0098(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_4;                                // 0x00A0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_5;                                     // 0x00B0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_6;                                // 0x00B8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_7;                                     // 0x00C8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_8;                                // 0x00D0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_9;                                     // 0x00E0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_10;                               // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_11;                                    // 0x00F8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_12;                               // 0x0100(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_13;                                    // 0x0110(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_14;                               // 0x0118(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_15;                                    // 0x0128(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_overlay_slot$Factory
// 0x0070 (0x0070 - 0x0000)
struct UI_UI_overlay_slot_Factory final
{
public:
	struct FUI_overlay_slot                       RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FUI_margin                             _ExprResult_0;                                     // 0x0030(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FUI_margin                             _ExprResult_1;                                     // 0x0050(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_overlay_slot$OverrideFactory
// 0x0150 (0x0150 - 0x0000)
struct UI_UI_overlay_slot_OverrideFactory final
{
public:
	struct FUI_overlay_slot                       RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0030(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0080(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0090(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x0098(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x00A8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_4;                                // 0x00B0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_5;                                     // 0x00C0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_6;                                     // 0x00C8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_7;                                // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_8;                                     // 0x00F8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_9;                                // 0x0100(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_10;                                    // 0x0110(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_11;                               // 0x0118(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_12;                                    // 0x0128(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_13;                                    // 0x0130(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_player_ui_slot$Factory
// 0x0010 (0x0010 - 0x0000)
struct UI_UI_player_ui_slot_Factory final
{
public:
	struct FUI_player_ui_slot                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_player_ui_slot$OverrideFactory
// 0x00C0 (0x00C0 - 0x0000)
struct UI_UI_player_ui_slot_OverrideFactory final
{
public:
	struct FUI_player_ui_slot                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0070(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x0078(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x0088(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_4;                                // 0x0090(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_5;                                     // 0x00A0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_6;                                // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_7;                                     // 0x00B8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_stack_box_slot$Factory
// 0x00B0 (0x00B0 - 0x0000)
struct UI_UI_stack_box_slot_Factory final
{
public:
	struct FUI_stack_box_slot                     RetVal;                                            // 0x0000(0x0040)(Parm, OutParm, ReturnParm)
	struct FUI_margin                             _ExprResult_0;                                     // 0x0040(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<double>                             _ExprResult_1;                                     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_3;                                // 0x0073(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_4;                                     // 0x0078(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<double>                             _ExprResult_5;                                     // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x00A8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x00AA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_7;                                // 0x00AB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_stack_box_slot$OverrideFactory
// 0x01C0 (0x01C0 - 0x0000)
struct UI_UI_stack_box_slot_OverrideFactory final
{
public:
	struct FUI_stack_box_slot                     RetVal;                                            // 0x0000(0x0040)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0040(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0090(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x00A0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x00B8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_4;                                // 0x00C0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_5;                                     // 0x00D0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_6;                                     // 0x00D8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_7;                                // 0x00F8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_8;                                     // 0x0108(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<double>                             _ExprResult_9;                                     // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0120(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x0122(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x0123(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_12;                               // 0x0128(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_13;                                    // 0x0138(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_14;                               // 0x0140(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_15;                                    // 0x0150(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	FVerseStringProperty_                         _ExprResultStack_16;                               // 0x0158(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_17;                                    // 0x0168(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUI_margin                             _ExprResult_18;                                    // 0x0170(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         _ExprResultStack_19;                               // 0x0190(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_20;                                    // 0x01A0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<double>                             _ExprResult_21;                                    // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x01B8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_22 : 1;                                // 0x01BA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_23;                               // 0x01BB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_user_widget_slot$Factory
// 0x0018 (0x0018 - 0x0000)
struct UI_UI_user_widget_slot_Factory final
{
public:
	struct FUI_user_widget_slot                   RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function VerseUI.UI.UI_user_widget_slot$OverrideFactory
// 0x0068 (0x0068 - 0x0000)
struct UI_UI_user_widget_slot_OverrideFactory final
{
public:
	struct FUI_user_widget_slot                   RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VerseUI.UI.UI_widget_message$Factory
// 0x0010 (0x0010 - 0x0000)
struct UI_UI_widget_message_Factory final
{
public:
	struct FUI_widget_message                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseUI.UI.UI_widget_message$OverrideFactory
// 0x0060 (0x0060 - 0x0000)
struct UI_UI_widget_message_OverrideFactory final
{
public:
	struct FUI_widget_message                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VerseUI.UI_player_ui._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R
// 0x0018 (0x0018 - 0x0000)
struct UI_player_ui__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R final
{
public:
	struct Ftuple_Lwidget_Mplayer__ui__slot_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseUI.UI_player_ui._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_player_ui__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_player_ui._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_player_ui__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget
// 0x0010 (0x0010 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UUI_widget*, true>            RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget
// 0x0010 (0x0010 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TOptional<class UUI_widget*, true>            RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility
// 0x0002 (0x0002 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EUI_widget_visibility                         RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled
// 0x0002 (0x0002 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R
// 0x0001 (0x0001 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R final
{
public:
	EUI_widget_visibility                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_material_block.$InitCDO
// 0x0100 (0x0100 - 0x0000)
struct UI_material_block__InitCDO final
{
public:
	struct FSpatialMath_vector2                   _ExprResult_0;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0010(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0060(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0070(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector2                   _ExprResult_4;                                     // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_5;                                // 0x0090(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize
// 0x0018 (0x0018 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage
// 0x0010 (0x0010 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAssets_material*                       RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint
// 0x0020 (0x0020 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R
// 0x0010 (0x0010 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R final
{
public:
	struct FSpatialMath_vector2                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R
// 0x0008 (0x0008 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R final
{
public:
	class UAssets_material*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R
// 0x0018 (0x0018 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_canvas.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct UI_canvas__InitCDO final
{
public:
	TArray<struct FUI_canvas_slot>                _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<struct FUI_canvas_slot>                _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUI_canvas_slot>                _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<struct FUI_canvas_slot>                _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_canvas._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R
// 0x0068 (0x0068 - 0x0000)
struct UI_canvas__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R final
{
public:
	struct FUI_canvas_slot                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0068)(Parm, NoDestructor)
};

// Function VerseUI.UI_canvas._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_canvas__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base.$InitCDO
// 0x0350 (0x0350 - 0x0000)
struct UI_text_base__InitCDO final
{
public:
	class UVerse_message*                         _ExprResultStack_0;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct VerseUI::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_2;          // 0x0018(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_5;                      // 0x00A8(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_1;                          // 0x00F8(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_6;                       // 0x0148(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_3;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_3;                        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x01A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1A2_1 : 7;                                  // 0x01A2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-8 ])
	uint8                                         _ExprResult_9 : 1;                                 // 0x01A3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UVerse_message*                         _ExprResultStack_10;                               // 0x01A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01B0(0x0010)(HasGetValueTypeHash)
	struct VerseUI::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_12;         // 0x01C0(0x0070)(HasGetValueTypeHash)
