#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VGameplayRst

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct VGameplayRst.ActiveSoundInfo
// 0x0008 (0x0008 - 0x0000)
struct FActiveSoundInfo final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VGameplayRst.DatastoreEntry
// 0x0014 (0x0020 - 0x000C)
struct FDatastoreEntry final : public FFastArraySerializerItem
{
public:
	class FName                                   KeyName;                                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ValueData;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VGameplayRst.DatastoreState
// 0x0020 (0x0128 - 0x0108)
struct FDatastoreState final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDatastoreEntry>                EntriesArray;                                      // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UDatastoreComponentBase*                OwningComponent;                                   // 0x0120(0x0008)(ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct VGameplayRst.VerseLevelStreamingLevelStatus
// 0x0028 (0x0028 - 0x0000)
struct FVerseLevelStreamingLevelStatus final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class ULevelStreamingDynamic*                 Streamer;                                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVerseAssetPtr*                         LevelAsset;                                        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VGameplayRst.VerseLevelStreamingLevelIdentifier
// 0x0028 (0x0028 - 0x0000)
struct FVerseLevelStreamingLevelIdentifier final
{
public:
	struct FSoftObjectPath                        LevelPath;                                         // 0x0000(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelNameOverride;                                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

