#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VKEditGameplay

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class VKEditGameplay.VKEditGameplayAssetsToCook
// 0x0010 (0x0040 - 0x0030)
class UVKEditGameplayAssetsToCook final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UObject>>         Assets;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VKEditGameplayAssetsToCook">();
	}
	static class UVKEditGameplayAssetsToCook* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVKEditGameplayAssetsToCook>();
	}
};

// Class VKEditGameplay.PlayspaceComponent_PlaysetRootSpawner
// 0x0048 (0x0140 - 0x00F8)
class UPlayspaceComponent_PlaysetRootSpawner final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0x48];                                      // 0x00F8(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_PlaysetRootSpawner">();
	}
	static class UPlayspaceComponent_PlaysetRootSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_PlaysetRootSpawner>();
	}
};

// Class VKEditGameplay.PlayspaceComponent_VKEditCreativeToolsPermission
// 0x0000 (0x0218 - 0x0218)
class UPlayspaceComponent_VKEditCreativeToolsPermission final : public UPlayspaceComponent_CreativeToolsPermission
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_VKEditCreativeToolsPermission">();
	}
	static class UPlayspaceComponent_VKEditCreativeToolsPermission* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_VKEditCreativeToolsPermission>();
	}
};

// Class VKEditGameplay.VKEditPlayspace
// 0x0120 (0x07E0 - 0x06C0)
class AVKEditPlayspace final : public AFortPlayspace
{
public:
	uint8                                         Pad_6C0[0x50];                                     // 0x06C0(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftClassPtr<class UClass>                   EditorOnlyMinigameSettingsMachineClassToSpawn;     // 0x0710(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   EditorOnlyWorldManagerClassToSpawn;                // 0x0730(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLevelStreamComponent*              LevelStreamComponent;                              // 0x0750(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortProjectEditComponent*              ProjectEditComponent;                              // 0x0758(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_PlayStopPauseManager* PlayStopPauseManager;                            // 0x0760(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_EditConnectionManager* EditConnectionManager;                          // 0x0768(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_LiveEdit*           LiveEditComponent;                                 // 0x0770(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_VKEditCreativeToolsPermission* CreativeToolsPermission;                // 0x0778(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_CreativeLoadingStateProxy* CreativeLoadingStateProxy;                  // 0x0780(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_SpatialGameplay*    SpatialGameplayComponent;                          // 0x0788(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVolumeObjectTrackingComponent*     ObjectTrackingComponent;                           // 0x0790(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_DeviceTracking*     DeviceTrackerComponent;                            // 0x0798(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_CreativeInventory*  CreativeInventoryComponent;                        // 0x07A0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_ActorMemoryTracker* ActorMemoryTrackerComponent;                       // 0x07A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeDynamicXpComponent*        FortCreativeDynamicXp;                             // 0x07B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_CreativeModifyEmotes* CreativeModifyEmotesComponent;                   // 0x07B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPlayspaceComponent_WorldTimeOfDayOverride* WorldTimeOfDayOverrideComponent;           // 0x07C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPlayspaceComponent_NaniteSettingsOverride* NaniteSettingsOverrideComponent;           // 0x07C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_PlaysetRootSpawner* PlaysetRootSpawnerComponent;                       // 0x07D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_PlayerPawnOverrides* PlayerPawnOverridesComponent;                     // 0x07D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnClientActivatedContent(const struct FUniqueNetIdRepl& ClientNetId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VKEditPlayspace">();
	}
	static class AVKEditPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVKEditPlayspace>();
	}
};

// Class VKEditGameplay.PlayspaceComponent_EditConnectionManager
// 0x00E8 (0x01E0 - 0x00F8)
class UPlayspaceComponent_EditConnectionManager final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0xC0];                                      // 0x00F8(0x00C0)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         EditConnections;                                   // 0x01B8(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVkEditStatus                                 VkEditStatus;                                      // 0x01BC(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  UITagsToHide;                                      // 0x01C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_EditConnections() const;
	void OnRep_VkEditStatus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_EditConnectionManager">();
	}
	static class UPlayspaceComponent_EditConnectionManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_EditConnectionManager>();
	}
};

}

