#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VoiceRep

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "VoiceRep_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VoiceRep.FortVoiceReportIntroModal
// 0x0010 (0x0410 - 0x0400)
class UFortVoiceReportIntroModal : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                       Text_VoiceReportingTitle;                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleTurnOffClicked();
	void HandleTurnOnClicked();
	void UpdateVisuals(const EUFortVoiceReportIntroModalType DescriptionType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVoiceReportIntroModal">();
	}
	static class UFortVoiceReportIntroModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVoiceReportIntroModal>();
	}
};

// Class VoiceRep.VoiceRepTooltipBase
// 0x0008 (0x0468 - 0x0460)
class UVoiceRepTooltipBase final : public UFortSidebarOnboardTooltipWidget
{
public:
	int32                                         AutoDismissTimerInterval;                          // 0x0460(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoiceRepTooltipBase">();
	}
	static class UVoiceRepTooltipBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceRepTooltipBase>();
	}
};

// Class VoiceRep.VoiceRepDataAsset
// 0x0020 (0x0050 - 0x0030)
class UVoiceRepDataAsset final : public UDataAsset
{
public:
	TSubclassOf<class UWidget>                    VoiceChatTooltipWidgetClass;                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UWidget>                    FirstOnboardingWidgetClass;                        // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UWidget>                    SecondOnboardingWidgetClass;                       // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UWidget>                    ReportVoiceWidgetClass;                            // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoiceRepDataAsset">();
	}
	static class UVoiceRepDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceRepDataAsset>();
	}
};

}

