#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_MOTD_Full_TileItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MOTD_Full_TileItem.WBP_MOTD_Full_TileItem_C
// 0x00B8 (0x03A8 - 0x02F0)
class UWBP_MOTD_Full_TileItem_C final : public UFortDynamicMotdFullscreenTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMotdViewModel*                         MotdViewModel;                                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loaded;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichTextBlock_SelectedNewsBody;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichTextBlock_SelectedNewsTitle;                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Buttons;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material;                                          // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UTexture2D*>                     Teaser_Images;                                     // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMotdViewModel*                         As_Motd_View_Model;                                // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCMSImage_C*                            NewVar;                                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMotdButton>                    Motd_Buttons;                                      // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Loading;                                           // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWidget*                                Parent;                                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CloseWidget;                                       // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FMotdButton>                    Buttons_Array;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Button_Index;                                      // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetMotdViewModel(class UMotdViewModel* ViewModel);
	void Set_Active(bool Active, class UWidget* Parent_0);
	void Regular_Button_Call_Action(class UCommonButtonBase* Button);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnImageLoadingComplete_Event();
	void Loud_Button_Call_Action(class UCommonButtonBase* Button);
	void GoUp();
	void GoDown();
	void Get_CMS_Image(const class FString& URL);
	void Get_Buttons(const TArray<struct FMotdButton>& Buttons_Array_0);
	void Get_Background_Image(const struct FMotdBackground& Motd_Background);
	void ExecuteUbergraph_WBP_MOTD_Full_TileItem(int32 EntryPoint);
	class UWidget* DoCustomNavigation_Up(EUINavigation Navigation_0);
	class UWidget* DoCustomNavigation_Down(EUINavigation Navigation_0);
	class UWidget* Do_Custom_Navigation_Right(EUINavigation Navigation_0);
	class UWidget* Do_Custom_Navigation_Left(EUINavigation Navigation_0);
	void Button_Pressed(class UMotdActionBase* Action);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MOTD_Full_TileItem_C">();
	}
	static class UWBP_MOTD_Full_TileItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MOTD_Full_TileItem_C>();
	}
};

}

