#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_MPLocker_Categories

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPLocker_Categories.WBP_MPLocker_Categories_C
// 0x00E0 (0x03A0 - 0x02C0)
class UWBP_MPLocker_Categories_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLockerVM*                          FortLockerVM;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortLoadoutsVM*                        FortLoadoutsVM;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Generic_C*            Button_ClearAllBangsIcon;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Generic_C*            Button_ClearLoadout;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutTitleButton_C*              Button_QuickRename;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Generic_C*            Button_RandomizeLoadout;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Generic_C*            Button_RevertLoadout;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CategorySet_C*                     WBP_CategorySet;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Generic_C*            WBP_UIKit_Button_Generic;                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_ContextMenuAnchorButton_C*   WBP_UIKit_ContextMenuAnchorButton;                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_ItemDescription_MPL_C*       WPB_ItemDescription;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Clear_All_Bangs_Action_Info_Display_Name;          // 0x0328(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Revert_Loadout_In_Action_Info_Display_Name;        // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Randomize_Loadout_In_Action_Info_Display_Name;     // 0x0358(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Clear_Loadout_In_Action_Info_Display_Name;         // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnCharacterSaved;                                  // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 RenameLoadoutWidgetClass;                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MPLocker_Categories(int32 EntryPoint);
	void OnRenameConfirmed(const class FString& NewName);
	void BndEvt__WBP_MPLocker_Categories_WBP_UIKit_Button_Generic_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ClearLoadoutVM();
	void ClearLoadout();
	void RandomizeLoadout();
	void Construct();
	void RevertLoadout();
	void ClearAllBangs();
	void OnInitialized();
	void Clear_Loadouts();
	void BndEvt__FortMPLocker_Button_QuickRename_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__FortMPLocker_Button_ClearLoadout_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__FortMPLocker_Button_RandomizeLoadout_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__FortMPLocker_Button_RevertLoadout_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__FortMPLocker_Button_ClearAllBangsIcon_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void OnOperationCompleted_73AD0586498B08073FED9B9BD4C2C97A(bool Success);
	void OnOperationCompleted_C0A8E1E640AF79AE6D36ACADC06D06B9(bool Success);
	void OnOperationCompleted_985F43B14F994F42018E87B4C21CB14B(bool Success);
	void HandleModified(bool IsModified);
	void SetupCategorySet(class UFortLockerCategoryGroupVM* ViewModel);
	void SetContextMenuActionContext(const TDelegate<void()>& ClearAllBangsInInteractionDelegate, const TDelegate<void()>& RevertLoadoutInInteractionDelegate, const TDelegate<void()>& RandomizeLoadoutInInteractionDelegate, const TDelegate<void()>& ClearLoadoutInInteractionDelegate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPLocker_Categories_C">();
	}
	static class UWBP_MPLocker_Categories_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPLocker_Categories_C>();
	}
};

}

