#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_StatsOptionsModalButtons

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatsOptionsModalButtons.WBP_StatsOptionsModalButtons_C
// 0x00B0 (0x0370 - 0x02C0)
class UWBP_StatsOptionsModalButtons_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhover;                                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unselected;                                        // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_59;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectionIndicator;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsOptionModalButtonsStyle_C*    WBP_StatsOptionModalButtonsStyle;                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& ID, int32 Index)> OnClicked;                  // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Button_text;                                       // 0x0310(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   ButtonTextForDisplayRow;                           // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 ID;                                                // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(int32 Index)>   RequestNavigationToIndex;                          // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HoveredStyle;                                      // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectedStyle;                                     // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetRadioSelectionVisualIndicator(bool Selected_0, bool Animate);
	void SetRadioSelectionHoverBorder(bool Hovered, bool Animate);
	void SetIsSelected(bool InSelected, bool bGiveClickFeedback);
	void SetFocusToButton();
	void PreConstruct(bool IsDesignTime);
	class UWidget* NavigateToPrevious(EUINavigation Navigation_0);
	class UWidget* NavigateToNext(EUINavigation Navigation_0);
	bool IsSelected();
	void ExecuteUbergraph_WBP_StatsOptionsModalButtons(int32 EntryPoint);
	void BndEvt__WBP_StatsOptionsModalButtons_WBP_StatsOptionModalButtonsStyle_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_StatsOptionsModalButtons_WBP_StatsOptionModalButtonsStyle_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_StatsOptionsModalButtons_WBP_StatsOptionModalButtonsStyle_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_StatsOptionsModalButtons_WBP_StatsOptionModalButtonsStyle_K2Node_ComponentBoundEvent_14_CommonSelectedStateChangedBase__DelegateSignature(class UCommonButtonBase* Button, bool Selected_0);
	void BndEvt__WBP_StatsOptionsModalButtons_WBP_StatsOptionModalButtonsStyle_K2Node_ComponentBoundEvent_13_OnFocusChanged__DelegateSignature(bool HasFocus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatsOptionsModalButtons_C">();
	}
	static class UWBP_StatsOptionsModalButtons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatsOptionsModalButtons_C>();
	}
};

}

