#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_Dialog_Base

#include "Basic.hpp"

#include "S_UI_Image_structs.hpp"
#include "Engine_structs.hpp"
#include "S_UI_Text_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_UI_DialogTextType_structs.hpp"
#include "S_UI_Backplate_structs.hpp"
#include "S_UI_DialogButtons_structs.hpp"
#include "S_UI_SizeBox_structs.hpp"
#include "S_UI_Placement_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Dialog_Base.WBP_UIKit_Dialog_Base_C
// 0x04E0 (0x07A0 - 0x02C0)
class UWBP_UIKit_Dialog_Base_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIKitDialogViewModel*                  UIKitDialogViewModel;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnDeactivate_Base;                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnActivate_Base;                              // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonsContainer;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Content;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Main;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Root;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Text;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Dialog;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Background;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Content;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Main;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Root;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_UIKit_ButtonCTA_Base_C*>    ButtonWidgets;                                     // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCommonButtonGroupBase*                 ButtonGroup;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> DialogButtonClickedDispatcher;                 // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             DefaultInputActionDataTable;                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Scrim_C*                     Scrim;                                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseScrim;                                          // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        Blur;                                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DimColor;                                          // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      DimMaterial;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseClickCatch;                                     // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTitle;                                          // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonTextBlock*                       ContentTitle;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ContentText;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ContentRichText;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_UI_DialogTextType                           UseText;                                           // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FS_UI_Text                             TitleProperties;                                   // 0x03B8(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_Text                             TextProperties;                                    // 0x0478(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UImage*                                 ContentImage;                                      // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseImage;                                          // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FS_UI_Image                            ImageProperties;                                   // 0x0548(0x0058)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          ImageMatchTextureSize;                             // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UImage*                                 ContentBackground;                                 // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackplate;                                      // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FS_UI_Backplate                        BackplateProperties;                               // 0x05B8(0x0050)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackground;                                     // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FS_UI_Image                            BackgroundProperties;                              // 0x0610(0x0058)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_SizeBox                          DialogSIze;                                        // 0x0668(0x0080)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_DialogButtons                    Buttons;                                           // 0x06E8(0x0070)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_Placement                        DialogPlacement;                                   // 0x0758(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Glass_C*           ContentBackplate;                                  // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void SetUIKitDialogViewModel(class UUIKitDialogViewModel* ViewModel);
	void SetTitleProperties(const struct FS_UI_Text& Data);
	void SetTextProperties(const struct FS_UI_Text& Data);
	void SetSizeBox(const struct FS_UI_SizeBox& Data);
	void SetScrim(float Blur_Strength, const struct FLinearColor& Color, class UMaterialInstance* Material_Instance, bool Enable);
	void SetPlacement(class UWidget* Widget, const struct FS_UI_Placement& Placement);
	void SetImageProperties(const struct FS_UI_Image& Data);
	void SetGridPadding(class UWidget* Widget, const struct FMargin& Padding_0);
	void SetGridNudge(class UWidget* Widget, const struct FVector2D& Nudge);
	void SetGridLayer(class UWidget* Widget, int32 Layer);
	void SetGridColumnAndRow(class UWidget* Widget, int32 Row, int32 Row_Span, int32 Column, int32 Column_Span);
	void SetGridAlignment(class UWidget* Widget, EHorizontalAlignment Horizontal, EVerticalAlignment Vertical);
	void SetDialogTitle(const class FText& Title);
	void SetDialogText(const class FText& Text);
	void SetDialogImage(class UTexture2D* Texture);
	void SetDialogData(class UUIKitDialogViewModel* Data);
	void SetButtonsProperties(const struct FS_UI_DialogButtons& Data);
	void SetButtonFocus(int32& Focus_Index);
	void SetButton(class UWBP_UIKit_ButtonCTA_Base_C*& Button, class UUIKitDialogButtonViewModel* Button_Data);
	void SetBackplateProperties(const struct FS_UI_Backplate& Data);
	void SetBackgroundProperties(const struct FS_UI_Image& Data);
	void PresetForDesignTime();
	void OnDialogButtonClicked(class UCommonButtonBase* AssociatedButton, int32 ButtonIndex);
	void InitializeDialog();
	void ExecuteUbergraph_WBP_UIKit_Dialog_Base(int32 EntryPoint);
	void DeactivateDialog(class UWidgetAnimation* OutroAnimation);
	void ClearButtonWidgets();
	void Cleanup(class UWidget* Widget);
	void AddTitle();
	void AddText();
	void AddScrim();
	void AddImage();
	void AddDialogButtons(TArray<class UUIKitDialogButtonViewModel*>& Action_Buttons);
	void AddBackplate();
	void AddBackground();
	void ActivateDialog(class UWidgetAnimation* IntroAnimation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Dialog_Base_C">();
	}
	static class UWBP_UIKit_Dialog_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Dialog_Base_C>();
	}
};

}

