#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_ItemDescription_MPL

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_ItemDescription_MPL.WBP_UIKit_ItemDescription_MPL_C.SetFortItemDetailsVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_ItemDescription_MPL_C_SetFortItemDetailsVM final
{
public:
	class UFortItemDetailsVM*                     ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_ItemDescription_MPL.WBP_UIKit_ItemDescription_MPL_C.GetRarityColors
// 0x0104 (0x0104 - 0x0000)
struct WBP_UIKit_ItemDescription_MPL_C_GetRarityColors final
{
public:
	bool                                          IsSeries;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortColorPalette                      FortColorPalette;                                  // 0x0004(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FFortColorPalette                      RarityColors;                                      // 0x0054(0x0050)(Parm, OutParm, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortColorPalette                      K2Node_MakeStruct_FortColorPalette;                // 0x00B4(0x0050)(NoDestructor)
};

// Function WBP_UIKit_ItemDescription_MPL.WBP_UIKit_ItemDescription_MPL_C.__569107d4-4513-b561-d0f9-999fd629fbc7_SourceToDest
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_UIKit_ItemDescription_MPL_C___569107d4_4513_b561_d0f9_999fd629fbc7_SourceToDest final
{
public:
	struct FFortColorPalette                      RarityColors;                                      // 0x0000(0x0050)(Parm, OutParm, NoDestructor)
	struct FFortColorPalette                      CallFunc_GetRarityColors_RarityColors;             // 0x0050(0x0050)(NoDestructor)
};

}

