#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_ContentGate_RatingTag

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ContentGate_RatingTag.WBP_ContentGate_RatingTag_C.SetGameActivity
// 0x0008 (0x0008 - 0x0000)
struct WBP_ContentGate_RatingTag_C_SetGameActivity final
{
public:
	class UFortGameActivity*                      GameActivity;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ContentGate_RatingTag.WBP_ContentGate_RatingTag_C.ExecuteUbergraph_WBP_ContentGate_RatingTag
// 0x0030 (0x0030 - 0x0000)
struct WBP_ContentGate_RatingTag_C_ExecuteUbergraph_WBP_ContentGate_RatingTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortGameActivity*                      K2Node_Event_GameActivity;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAgeRatingShortText_ReturnValue;        // 0x0010(0x0018)(ConstParm)
	bool                                          CallFunc_HasAgeRating_ReturnValue;                 // 0x0028(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

