#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_StatsOptionModalButtonsStyle

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_StatsOptionModalButtonsStyle.WBP_StatsOptionModalButtonsStyle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatsOptionModalButtonsStyle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_StatsOptionModalButtonsStyle.WBP_StatsOptionModalButtonsStyle_C.OverrideStyle
// 0x0018 (0x0018 - 0x0000)
struct WBP_StatsOptionModalButtonsStyle_C_OverrideStyle final
{
public:
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonBackground_CTA_C*      K2Node_DynamicCast_AsWBP_UIKit_Button_Background_CTA; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_StatsOptionModalButtonsStyle.WBP_StatsOptionModalButtonsStyle_C.ExecuteUbergraph_WBP_StatsOptionModalButtonsStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatsOptionModalButtonsStyle_C_ExecuteUbergraph_WBP_StatsOptionModalButtonsStyle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

