#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_CosmeticVariantItemTile_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.SetupPreviewImage
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_SetupPreviewImage final
{
public:
	bool                                          DoSetup;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.SetLockedVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_SetLockedVisibility final
{
public:
	bool                                          Owned;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.SetConflictVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_SetConflictVisibility final
{
public:
	bool                                          HasConflict;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.SetActiveVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_SetActiveVisibility final
{
public:
	bool                                          Equipped;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.Set Variant Preview Image
// 0x0078 (0x0078 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_Set_Variant_Preview_Image final
{
public:
	TSoftObjectPtr<class UTexture2D>              VariantPreviewImage;                               // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UMaterialInstance*                      DynamicMaterial;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0030(0x0020)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_InEditor_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0058(0x0020)(HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.Set Variant Preview Color
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_Set_Variant_Preview_Color final
{
public:
	struct FSlateColor                            VariantColor;                                      // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               DynMat;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.GetImageWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_GetImageWidget final
{
public:
	class UImage*                                 NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_CosmeticVariantItemTile_Base.WBP_UIKit_CosmeticVariantItemTile_Base_C.ExecuteUbergraph_WBP_UIKit_CosmeticVariantItemTile_Base
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_CosmeticVariantItemTile_Base_C_ExecuteUbergraph_WBP_UIKit_CosmeticVariantItemTile_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

