#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_Button_RoundedCorners_ModeSet

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Button_RoundedCorners_ModeSet.WBP_UIKit_Button_RoundedCorners_ModeSet_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Button_RoundedCorners_ModeSet_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Button_RoundedCorners_ModeSet.WBP_UIKit_Button_RoundedCorners_ModeSet_C.OverrideFontMaterial
// 0x0220 (0x0220 - 0x0000)
struct WBP_UIKit_Button_RoundedCorners_ModeSet_C_OverrideFontMaterial final
{
public:
	class UMaterialInstance*                      PrimaryFontMaterial;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SecondaryFontMaterial;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0010(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0068(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_2;                 // 0x00C0(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_3;                 // 0x0118(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_4;                 // 0x0170(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_5;                 // 0x01C8(0x0058)(HasGetValueTypeHash)
};

// Function WBP_UIKit_Button_RoundedCorners_ModeSet.WBP_UIKit_Button_RoundedCorners_ModeSet_C.ExecuteUbergraph_WBP_UIKit_Button_RoundedCorners_ModeSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_Button_RoundedCorners_ModeSet_C_ExecuteUbergraph_WBP_UIKit_Button_RoundedCorners_ModeSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

