#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_Discovery_MessageNoResults

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Discovery_MessageNoResults.WBP_Discovery_NoResultsMessage_C.Set Message Text Overrides
// 0x0030 (0x0030 - 0x0000)
struct WBP_Discovery_NoResultsMessage_C_Set_Message_Text_Overrides final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InMessage;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Discovery_MessageNoResults.WBP_Discovery_NoResultsMessage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Discovery_NoResultsMessage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Discovery_MessageNoResults.WBP_Discovery_NoResultsMessage_C.ExecuteUbergraph_WBP_Discovery_NoResultsMessage
// 0x001C (0x001C - 0x0000)
struct WBP_Discovery_NoResultsMessage_C_ExecuteUbergraph_WBP_Discovery_NoResultsMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

