#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_PanelRebootRally_Header

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PanelRebootRally_Header.WBP_PanelRebootRally_Header_C.OnRebootRallyEligibilityUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PanelRebootRally_Header_C_OnRebootRallyEligibilityUpdated final
{
public:
	bool                                          bEligible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PanelRebootRally_Header.WBP_PanelRebootRally_Header_C.ExecuteUbergraph_WBP_PanelRebootRally_Header
// 0x0020 (0x0020 - 0x0000)
struct WBP_PanelRebootRally_Header_C_ExecuteUbergraph_WBP_PanelRebootRally_Header final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEligible;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select_Default;                             // 0x0008(0x0018)(ConstParm)
};

}

