#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_SidebarAvatarButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SidebarAvatarButton.WBP_SidebarAvatarButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SidebarAvatarButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_SidebarAvatarButton.WBP_SidebarAvatarButton_C.ExecuteUbergraph_WBP_SidebarAvatarButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_SidebarAvatarButton_C_ExecuteUbergraph_WBP_SidebarAvatarButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

