#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_IslandTile_Full

#include "Basic.hpp"

#include "WBP_IslandTile_Minimal_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IslandTile_Full.WBP_IslandTile_Full_C
// 0x0030 (0x1700 - 0x16D0)
class UWBP_IslandTile_Full_C final : public UWBP_IslandTile_Minimal_C
{
public:
	class UWidgetAnimation*                       Anim_OnFullHoverSelect;                            // 0x16D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               OriginalContentEpicBanner;                         // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_IslandName;                                   // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Island_State_Favorite_C*           WBP_Island_State_Favorite;                         // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LockedStatus_C*                    WBP_LockedStatus;                                  // 0x16F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetPurchaseRequired(bool IsPurchaseRequired);
	void SetIslandName(const class FText& IslandName);
	void SetIsFavorite(bool IsFavorited);
	void SetByEpicBanner(bool IsByEpic);
	void OnTileSelectionNotActive();
	void OnTileSelectionActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IslandTile_Full_C">();
	}
	static class UWBP_IslandTile_Full_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IslandTile_Full_C>();
	}
};

}

