#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_Block_EditableText

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetFont
// 0x0060 (0x0060 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetFont final
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetFontMaterial
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetFontMaterial final
{
public:
	class UMaterialInstance*                      Material_Instance;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetHintText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetHintText final
{
public:
	class FText                                   Hint_Text;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetIsPassword
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetIsPassword final
{
public:
	bool                                          IsPassword;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetJustification
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetJustification final
{
public:
	ETextJustify                                  Justification;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetMinDesiredWidth
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetMinDesiredWidth final
{
public:
	double                                        Min_Width;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinimumDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetMobileFontSizeMultiplier
// 0x0004 (0x0004 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetMobileFontSizeMultiplier final
{
public:
	float                                         MobileFontSizeMultiplier;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetReadOnly
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetReadOnly final
{
public:
	bool                                          IsReadOnly;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Block_EditableText_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

