#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_STI_Label

#include "Basic.hpp"

#include "ETempItemLabelType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_STI_Label.WBP_STI_Label_C
// 0x0028 (0x02E8 - 0x02C0)
class UWBP_STI_Label_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Border_Background;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LabelIcon;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LabelText;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETempItemLabelType                            LabelType;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Setup_Label(ETempItemLabelType Selection, const class FText& Text);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_STI_Label(int32 EntryPoint);
	void Apply_Effect(const class FText& Text, const struct FSlateColor& TextColor, class UMaterialInstance* BackgroundMaterial, ESlateVisibility IconVisibility, class UMaterial* IconMaterial, const struct FLinearColor& IconColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_STI_Label_C">();
	}
	static class UWBP_STI_Label_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_STI_Label_C>();
	}
};

}

