#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_MPItemShop_SectionNavigator

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPItemShop_SectionNavigator.WBP_MPItemShop_SectionNavigator_C
// 0x00A0 (0x0360 - 0x02C0)
class UWBP_MPItemShop_SectionNavigator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemShopVM*                        FortItemShopVM;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Collapse;                                          // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Hitbox;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Generic_C*            Button_OpenNav_PromptBelowNav;                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_All;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_C*                      TabGroup;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCollapsed;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUIKitTabGroupViewModel*                TabGroupViewModel;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIKitTabGroupButtonViewModel*>  TabButtonsViewModels;                              // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortItemShopSectionVM*>         SectionsViewModels;                                // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnSectionNavigatorFocused;                         // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IgnoreNextLayoutUpdate;                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnSectionNavigatorUnfocused;                       // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IgnoreHoverUntilUnhover;                           // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             NavScrollhSound;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Update_Featured_Layout(int32 ButtonIndex);
	void SetTabButtonsCollapsedState();
	void SetIsCollapsed(bool ShouldCollapse);
	void SetFortItemShopVM(class UFortItemShopVM* ViewModel);
	void OnTabSelected(class FName TabID);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnFeaturedLayoutUpdated(const struct FFortItemShopLayout& NewLayout);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	bool IsQuickNavCollapsible();
	void GetTabIndexFromFeaturedLayout(const class FString& SectionId, int32* Index_0);
	TArray<class UWidget*> GetTabButtons();
	int32 GetSelectedTabIndex();
	void GetSectionAtIndex(int32 Index_0, class UFortItemShopSectionVM** Output);
	class UWidget* GetButtonAtIndex(int32 Index_0);
	void GenerateTabsFromSections(TArray<class UFortItemShopSectionVM*>& SectionViewModels);
	void ForceSetFocus();
	void ExecuteUbergraph_WBP_MPItemShop_SectionNavigator(int32 EntryPoint);
	void CreateTabBindings();
	void Construct();
	void Clear3DPreview();
	void CheckIsHovered(bool* IsHovered_0);
	void BndEvt__WBP_MPItemShop_SectionNavigator_Button_Open_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_SectionNavigator_Button_Hitbox_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_SectionNavigator_Button_Hitbox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void AnalyticsSectionInteracted(struct FFortItemShopLayout& NewFeaturedLayout);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPItemShop_SectionNavigator_C">();
	}
	static class UWBP_MPItemShop_SectionNavigator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPItemShop_SectionNavigator_C>();
	}
};

}

