#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_Button_Quiet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "WBP_UIKit_ButtonCTA_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Quiet.WBP_UIKit_Button_Quiet_C
// 0x0020 (0x1AD0 - 0x1AB0)
#pragma pack(push, 0x1)
class alignas(0x10) UWBP_UIKit_Button_Quiet_C : public UWBP_UIKit_ButtonCTA_Base_C
{
public:
	uint8                                         Pad_1AA4[0x4];                                     // 0x1AA4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Quiet_C;           // 0x1AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          isDarkBackground;                                  // 0x1AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB1[0x7];                                     // 0x1AB1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstance*                      QuietLightBackgroundMaterial;                      // 0x1AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietDarkBackgroundMaterial;                       // 0x1AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnInputMethodChanged(ECommonInputType CurrentInputType_0);
	void BP_OnPressed();
	void BP_OnReleased();
	void BP_OnWidgetStyled();
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_Button_Quiet(int32 EntryPoint);
	void HideBackground(ECommonInputType InputType);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Quiet_C">();
	}
	static class UWBP_UIKit_Button_Quiet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Quiet_C>();
	}
};
#pragma pack(pop)

}

