#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_ItemDescription_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "E_UIKit_ItemDescription_TextWrapType_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.SetWidgetLayout
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_SetWidgetLayout final
{
public:
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_2;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.SetTitleText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_SetTitleText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.SetRarityText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_SetRarityText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.SetRarityTagVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_SetRarityTagVisibility final
{
public:
	bool                                          ShowTag;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.SetRarityTagColors
// 0x0050 (0x0050 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_SetRarityTagColors final
{
public:
	struct FFortColorPalette                      FortColorPalette;                                  // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.SetCategoryText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_SetCategoryText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.SetBodyText
// 0x0020 (0x0020 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_SetBodyText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.PresetForDesignTime
// 0x0078 (0x0078 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_PresetForDesignTime final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0038(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0060(0x0018)()
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.InitializeWidget
// 0x000A (0x000A - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_InitializeWidget final
{
public:
	E_UIKit_ItemDescription_TextWrapType          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UIKit_ItemDescription_TextWrapType          Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_ItemDescription_Base.WBP_UIKit_ItemDescription_Base_C.ExecuteUbergraph_WBP_UIKit_ItemDescription_Base
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_ItemDescription_Base_C_ExecuteUbergraph_WBP_UIKit_ItemDescription_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

