#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_Button_Tab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_Alignment_structs.hpp"
#include "WBP_UIKit_Button_Selectable_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Tab.WBP_UIKit_Button_Tab_C
// 0x0050 (0x1770 - 0x1720)
class UWBP_UIKit_Button_Tab_C final : public UWBP_UIKit_Button_Selectable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Tab_C;             // 0x1718(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMargin                                TopAlignmentPadding;                               // 0x1720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                BottomAlignmentPadding;                            // 0x1730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                LeftAlignmentPadding;                              // 0x1740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                RightAlignmentPadding;                             // 0x1750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_UI_Alignment                                SelectedBarPosition;                               // 0x1760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePadding(E_UI_Alignment SelectionAlignment);
	void UpdateAlignment(E_UI_Alignment Selection_Alignment);
	void SetSelectionAlignment(E_UI_Alignment Selection_Alignment);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_UIKit_Button_Tab(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Tab_C">();
	}
	static class UWBP_UIKit_Button_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Tab_C>();
	}
};

}

