#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_StatsOptionsModalSection

#include "Basic.hpp"

#include "BPS_StatsOptionsModalButtonData_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatsOptionsModalSection.WBP_StatsOptionsModalSection_C
// 0x0088 (0x0348 - 0x02C0)
class UWBP_StatsOptionsModalSection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_SectionTitle;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ButtonsContainer;                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FBPS_StatsOptionsModalButtonData> ButtonsData;                                     // 0x02D8(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(const class FString& ID, int32 Index)> OnButtonClicked;            // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_StatsOptionsModalButtons_C*> ButtonsReference;                                 // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                   Label;                                             // 0x0308(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 DefaultSelectedId;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 FromSectionIndex, int32 ToSectionIndex)> RequestNavigationFromTo; // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Index_0;                                           // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetFocusToLastButton();
	void SetFocusToFirstButton();
	void ResetDefaultSelected();
	void PreConstruct(bool IsDesignTime);
	void HandleOnButtonClicked(const class FString& ID, int32 Param_Index_0);
	void HandleNavigationRequestedToButtonIndex(int32 ToButtonIndex);
	void GetSelectedTextForDisplayRow(class FText* Button_text);
	class FString GetSelectedId();
	class UWBP_StatsOptionsModalButtons_C* GetSelectedButtonReference();
	void ExecuteUbergraph_WBP_StatsOptionsModalSection(int32 EntryPoint);
	void CreateButtons(TArray<struct FBPS_StatsOptionsModalButtonData>& inButtonsData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatsOptionsModalSection_C">();
	}
	static class UWBP_StatsOptionsModalSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatsOptionsModalSection_C>();
	}
};

}

