#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_ButtonCTA_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "ModularButtonSize_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ButtonCTA_Base.WBP_UIKit_ButtonCTA_Base_C
// 0x0600 (0x1AB0 - 0x14B0)
#pragma pack(push, 0x1)
class alignas(0x10) UWBP_UIKit_ButtonCTA_Base_C : public UFortCTAButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Pressed_Base;                                 // 0x14B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Base;                                 // 0x14C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Image_C*               Block_Image;                                       // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonText_CTA_C*            Block_SecondaryText;                               // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonText_CTA_C*            Block_Text;                                        // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Content;                                           // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldIcon;                                          // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldProgressBar;                                   // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Prompt;                                            // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             PromptAlignment;                                   // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Root;                                              // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             TextAndIcon;                                       // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Text;                                  // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         LargePrimaryFont;                                  // 0x1520(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         LargeSecondaryFont;                                // 0x1578(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         MediumPrimaryFont;                                 // 0x15D0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         MeduimSecondaryFont;                               // 0x1628(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SmallPrimaryFont;                                  // 0x1680(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SmallSecondaryFont;                                // 0x16D8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	EModularButtonSize                            ButtonSize;                                        // 0x1730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1731[0x3];                                     // 0x1731(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMargin                                SingleTextLargePadding;                            // 0x1734(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                SingleTextMediumPadding;                           // 0x1744(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                SingleTextSmallPadding;                            // 0x1754(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DoubleTextLargePadding;                            // 0x1764(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DoubleTextMediumPadding;                           // 0x1774(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DoubleTextSmallPadding;                            // 0x1784(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DoubleTextSecondaryLargePadding;                   // 0x1794(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DoubleTextSecondaryMediumPadding;                  // 0x17A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DoubleTextSecondarySmallPadding;                   // 0x17B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17C4[0x4];                                     // 0x17C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Text;                                              // 0x17C8(0x0018)(Edit, BlueprintVisible)
	class FText                                   TextSecondary;                                     // 0x17E0(0x0018)(Edit, BlueprintVisible)
	bool                                          OverrideSecondaryTextSize;                         // 0x17F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17F9[0x7];                                     // 0x17F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        OverrideSecondaryTextSizeMultiplier;               // 0x1800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BackgroundClass;                                   // 0x1808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BackgroundMaterial;                                // 0x1810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BorderMaterial;                                    // 0x1818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBorderAdditive;                                  // 0x1820(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1821[0x3];                                     // 0x1821(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         LargeHeight;                                       // 0x1824(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MediumHeight;                                      // 0x1828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SmallHeight;                                       // 0x182C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_BlockBackground_Base_C*      Block_Background;                                  // 0x1830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         GridUnit;                                          // 0x1838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183C[0x4];                                     // 0x183C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWidgetTransform                       LeftToRightTransform;                              // 0x1840(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FWidgetTransform                       RightToLeftTransform;                              // 0x1878(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          SingleText;                                        // 0x18B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B1[0x7];                                     // 0x18B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(bool HasFocus)> OnFocusChanged;                                    // 0x18B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        MobileFontSizeMultiplierLarge;                     // 0x18C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileFontSizeMultiplierMedium;                    // 0x18D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileFontSizeMultiplierSmall;                     // 0x18D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobileMinWidth;                                    // 0x18E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideDefaultHeight;                             // 0x18E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E5[0x3];                                     // 0x18E5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         MobileMinHeight;                                   // 0x18E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobileLargeHeight;                                 // 0x18EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobileMediumHeight;                                // 0x18F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobileSmallHeight;                                 // 0x18F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                MobileSingleTextLargePadding;                      // 0x18F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileSingleTextMediumPadding;                     // 0x1908(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileSingleTextSmallPadding;                      // 0x1918(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileDoubleTextLargePadding;                      // 0x1928(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileDoubleTextMediumPadding;                     // 0x1938(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileDoubleTextSmallPadding;                      // 0x1948(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileDoubleTextSecondaryLargePadding;             // 0x1958(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileDoubleTextSecondaryMediumPadding;            // 0x1968(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileDoubleTextSecondarySmallPadding;             // 0x1978(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        MobileFontSizeMultiplierSecondaryLarge;            // 0x1988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileFontSizeMultiplierSecondaryMedium;           // 0x1990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileFontSizeMultiplierSecondarySmall;            // 0x1998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideDefaultMobileFontSizeMultiplier;           // 0x19A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A1[0x7];                                     // 0x19A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        MobileFontSizeMultiplierOverride;                  // 0x19A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoText;                                            // 0x19B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoIcon;                                            // 0x19B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoPrompt;                                          // 0x19B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastEnabledEvent;                                  // 0x19B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B4[0x4];                                     // 0x19B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        FadeInTime;                                        // 0x19B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutTime;                                       // 0x19C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PressedSound;                                      // 0x19C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoveredSound;                                      // 0x19D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldPressedSound;                                  // 0x19D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x19E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldReleasedSound;                                 // 0x19E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldCompletedSound;                                // 0x19F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HoldSoundAudioComponent;                           // 0x19F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PressedSoundAudioComponent;                        // 0x1A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CurrentInputType;                                  // 0x1A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A09[0x7];                                     // 0x1A09(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             Icon;                                              // 0x1A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IconBeforeText;                                    // 0x1A18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A19[0x7];                                     // 0x1A19(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstance*                      IconMaterial;                                      // 0x1A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LargeIconSize;                                     // 0x1A28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MediumIconSize;                                    // 0x1A38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SmallIconSize;                                     // 0x1A48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHoldCompleted;                                   // 0x1A58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        MobileFontSizeMultiplierSecondaryOverride;         // 0x1A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHoldProgress;                               // 0x1A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HoldProgressDynamicMaterial;                       // 0x1A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                IconPadding;                                       // 0x1A80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PromptWithContent;                                 // 0x1A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A91[0x3];                                     // 0x1A91(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMargin                                PromptPadding;                                     // 0x1A94(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AddBackground();
	void BP_OnClicked();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnFocusLost();
	void BP_OnFocusReceived();
	void BP_OnHovered();
	void BP_OnInputActionTriggered();
	void BP_OnInputActionUpdated();
	void BP_OnInputMethodChanged(ECommonInputType CurrentInputType_0);
	void BP_OnPressed();
	void BP_OnReleased();
	void BP_OnUnhovered();
	void BP_OnWidgetStyled();
	void BP_SetSecondaryText(const class FText& Text_0);
	void BP_SetText(const class FText& Text_0);
	void Cleanup(class UWidget* Widget);
	void Construct();
	void Destruct();
	void EventOnFocusedManually();
	void ExecuteUbergraph_WBP_UIKit_ButtonCTA_Base(int32 EntryPoint);
	void Fade_Out_Sound();
	void InitializeButton();
	void IsPromptHoldable(bool* Holdable);
	void IsPromptIcon(bool* Valid);
	void OnActionProgress(float HeldPercent);
	void PlaySoundHoldCompleted();
	void PlaySoundHoldPressed();
	void PlaySoundHovered();
	void PlaySoundPressed();
	void PreConstruct(bool IsDesignTime);
	void RegisterBlocks();
	void ResetButtonState();
	void SetBackgroundMaterial(class UMaterialInstance* Background);
	void SetBackgroundVisibility(bool Visible);
	void SetBorderMaterial(class UMaterialInstance* BorderMaterial_0, bool IsAdditive);
	void SetButtonIsEnabled();
	void SetButtonSize(EModularButtonSize ButtonSize_0);
	void SetHoldPercentage(double HeldPercentageValue);
	void SetIcon(class UTexture2D* Icon_0);
	void SetIconMaterial(class UMaterialInstance* IconMaterial_0);
	void SetLanguageDirection();
	void SetPrompt();
	void ShowInputActionText();
	void ShowPromptFallbackAction(bool Show);
	void Stop_Sound_Hold_Released();
	void TryAddBackground();
	void UnregisterBlocks();
	void UpdateBackground();
	void UpdateButtonSIze();
	void UpdateButtonSizeToGrid();
	void UpdateFonts();
	void UpdateIcon();
	void UpdatePrompt(ECommonInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ButtonCTA_Base_C">();
	}
	static class UWBP_UIKit_ButtonCTA_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ButtonCTA_Base_C>();
	}
};
#pragma pack(pop)

}

