#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_Habanero_Icon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Habanero_Icon.WBP_Habanero_Icon_C
// 0x0078 (0x04A8 - 0x0430)
class UWBP_Habanero_Icon_C final : public UFortHabaneroTierWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                IconSizeSpacer;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TierBackground;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TierForeground;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              IconMinSize;                                       // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       DebugForeground;                                   // 0x0460(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       DebugBackground;                                   // 0x0480(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          DisplayLargeIcon;                                  // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWidgetDisplay(const struct FFortHabaneroTier& DisplayData);
	void UpdateDetailsFromTierData(const struct FFortHabaneroTier& FortHabaneroTier);
	void UpdateDetails(TSoftObjectPtr<class UMaterialInstance> ForegroundIcon, TSoftObjectPtr<class UMaterialInstance> BackgroundIcon, const class FText& Title);
	void SetSize(const struct FVector2D& IconSize);
	void SetIcon(TSoftObjectPtr<class UMaterialInstance> ForegroundInstance, TSoftObjectPtr<class UMaterialInstance> BackgroundInstance);
	void PreConstruct(bool IsDesignTime);
	void Get_Tier_Foreground_Color(struct FLinearColor* Color);
	void ExecuteUbergraph_WBP_Habanero_Icon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Habanero_Icon_C">();
	}
	static class UWBP_Habanero_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Habanero_Icon_C>();
	}
};

}

