#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_Block_EditableText

#include "Basic.hpp"

#include "WBP_UIKit_Block_Base_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C
// 0x0030 (0x0328 - 0x02F8)
class UWBP_UIKit_Block_EditableText_C final : public UWBP_UIKit_Block_Base_C
{
public:
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered_Transition;                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIKitEditableText*                     EditableText;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FontDynamicMaterial;                               // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetFont(const struct FSlateFontInfo& Font);
	void SetFontMaterial(class UMaterialInstance* Material_Instance);
	void SetHintText(const class FText& Hint_Text);
	void SetIsPassword(bool IsPassword);
	void SetJustification(ETextJustify Justification);
	void SetMinDesiredWidth(double Min_Width);
	void SetMobileFontSizeMultiplier(float MobileFontSizeMultiplier);
	void SetReadOnly(bool IsReadOnly);
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_EditableText_C">();
	}
	static class UWBP_UIKit_Block_EditableText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_EditableText_C>();
	}
};

}

