#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_ContextMenuAnchorButton_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C
// 0x0058 (0x0350 - 0x02F8)
class UWBP_UIKit_ContextMenuAnchorButton_Base_C : public UUIKitContextMenuAnchor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UIKit_Button_Generic_C*            ContextMenuButton;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EMenuPlacement                                MenuPlacement;                                     // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUIKitContextMenuViewModel*             ViewModel;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUIKitContextMenuActionContext*         InteractionContext;                                // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOpen;                                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             ButtonIcon;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0330(0x0018)(Edit, BlueprintVisible)
	bool                                          IsMouseOver;                                       // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateText(const class FText& Text);
	void UpdateIcon(class UTexture2D* Icon);
	void SetContext(class UUIKitContextMenuActionContext* InteractionContext_Data);
	void PreConstruct(bool IsDesignTime);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Init_Context_Menu(class UObject* Widget);
	void ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base(int32 EntryPoint);
	void Construct();
	void BP_OnMenuSpawned(class UUserWidget* Widget);
	void BndEvt__WBP_UIKit_ToolTipCallButton_ContextMenuButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ContextMenuAnchorButton_Base_C">();
	}
	static class UWBP_UIKit_ContextMenuAnchorButton_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ContextMenuAnchorButton_Base_C>();
	}
};

}

