#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_UIKit_ItemCard_Locker

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ItemCard_Locker.WBP_UIKit_ItemCard_Locker_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_UIKit_ItemCard_Locker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLockerCategoryItemVM*              FortLockerCategoryItemVM;                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortItemVM*                            FortItemVM;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_UIKit_ItemCard_Base_C*             ItemCard_Base;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemVM*                            ItemInfo;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetItemIsArchived(bool Is_Archived);
	void SetFortLockerCategoryItemVM(class UFortLockerCategoryItemVM* ViewModel);
	void SetFortItemVM(class UFortItemVM* ViewModel);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_WBP_UIKit_ItemCard_Locker(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void BndEvt__WBP_UIKit_ItemCard_Locker_ItemCard_Base_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_UIKit_ItemCard_Locker_ItemCard_Base_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ItemCard_Locker_C">();
	}
	static class UWBP_UIKit_ItemCard_Locker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ItemCard_Locker_C>();
	}
};

}

