#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_SidebarAvatarButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Button_Generic_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SidebarAvatarButton.WBP_SidebarAvatarButton_C
// 0x0030 (0x1750 - 0x1720)
class UWBP_SidebarAvatarButton_C final : public UWBP_UIKit_Button_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SidebarAvatarButton_C;          // 0x1720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SB_mobileSizeGuard;                                // 0x1728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerAvatar_C*                    WBP_PlayerAvatar;                                  // 0x1730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Outline_C*            WBP_UIKit_Button_Outline;                          // 0x1738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           WBP_UIKit_StatusIndicator;                         // 0x1740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_SidebarAvatarButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SidebarAvatarButton_C">();
	}
	static class UWBP_SidebarAvatarButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SidebarAvatarButton_C>();
	}
};

}

