#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: XpEverywhereUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "XpEverywhereUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class XpEverywhereUI.XpEverywhereAccoladesWidget
// 0x0078 (0x03A0 - 0x0328)
class UXpEverywhereAccoladesWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x68];                                     // 0x0328(0x0068)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x0390(0x0002)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_392[0xE];                                      // 0x0392(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CloseWidget();
	void OnEventAdded();
	void OnStompedByOtherWidget();
	void OpenWidget(const class UFortAccoladeItemDefinition* AccoladeDef, const int32 XpValue, const class FText& DisplayName, const TSoftObjectPtr<class UTexture2D>& AccoladeLargePreviewImageOverride, const class FText& SimulatedName, const class FText& SimulatedText, const EFortSimulatedXPSize SimulatedXpSize);

	bool HasMoreXPEvents() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XpEverywhereAccoladesWidget">();
	}
	static class UXpEverywhereAccoladesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpEverywhereAccoladesWidget>();
	}
};

// Class XpEverywhereUI.XpEverywhereBar
// 0x00D8 (0x04D8 - 0x0400)
class UXpEverywhereBar final : public UCommonActivatableWidget
{
public:
	bool                                          bXpBarAlwaysActive;                                // 0x0400(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortSocialAvatarIcon*                  SocialAvatarIcon;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_410[0xC8];                                     // 0x0410(0x00C8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void DoneUpdatingXpBar();
	void OnXpBarInitialized(int32 CurrentXP, int32 CurrentLevel, int32 CurrentRemainingRestXP);
	void OnXpBarUpdated(int32 ShownXP, int32 ShownLevel, int32 NewDesiredXP, int32 NewDesiredLevel, int32 NewRemainingRestXP);

	int32 GetTotalXpRequiredForLevel(const int32 InLevel) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XpEverywhereBar">();
	}
	static class UXpEverywhereBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpEverywhereBar>();
	}
};

// Class XpEverywhereUI.XpEverywhereLevelUpWidget
// 0x0008 (0x0408 - 0x0400)
class UXpEverywhereLevelUpWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void DoneLevelingUp();
	void OnShowWidget(const int32 NewLevel);

	void DisplayLevelUpRewards() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XpEverywhereLevelUpWidget">();
	}
	static class UXpEverywhereLevelUpWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpEverywhereLevelUpWidget>();
	}
};

// Class XpEverywhereUI.XpEverywhereReticleWidget
// 0x0018 (0x0340 - 0x0328)
class UXpEverywhereReticleWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x18];                                     // 0x0328(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ForwardEvents();
	void HandleProfileUpdated();
	void UpdateRestXP(int32 RestXpRemaining);
	void UpdateXPAmount(int32 NewAmount, class USoundCue* Cue, const EFortSimulatedXPSize SimulatedXpSize);
	void UpdateXPSource(const class FText& NewSourceText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XpEverywhereReticleWidget">();
	}
	static class UXpEverywhereReticleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpEverywhereReticleWidget>();
	}
};

// Class XpEverywhereUI.XpEverywhereRewardWidget
// 0x0090 (0x03B8 - 0x0328)
class UXpEverywhereRewardWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x48];                                     // 0x0328(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UFortNotificationEntry>     DefaultEntryClass;                                 // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPrioritizedWidgetFocus;                        // 0x0378(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortNotificationEntry*                 ActiveWidget;                                      // 0x0380(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortNotificationEntry*>         WidgetQueue;                                       // 0x0388(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UVerticalBox*                           NotificationUpdatesBox;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FXpEverywhereNotificationWidgetClass> NotificationClassPoolData;                   // 0x03A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x03B0(0x0002)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleNotificationUpdateFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XpEverywhereRewardWidget">();
	}
	static class UXpEverywhereRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpEverywhereRewardWidget>();
	}
};

// Class XpEverywhereUI.XpEverywhereUIComponent
// 0x00C0 (0x0160 - 0x00A0)
class UXpEverywhereUIComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x90];                                      // 0x00A0(0x0090)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  XpEverywhereHiddenElementTags;                     // 0x0130(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XpEverywhereUIComponent">();
	}
	static class UXpEverywhereUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpEverywhereUIComponent>();
	}
};

}

