#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: XpEverywhereUI

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct XpEverywhereUI.XpEverywhereNotificationWidgetClass
// 0x0020 (0x0020 - 0x0000)
struct FXpEverywhereNotificationWidgetClass final
{
public:
	TSubclassOf<class UFortNotificationEntry>     NotificationWidgetClass;                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitialPoolSize;                                   // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanIncreasePoolSizeAtRunTime;                     // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UFortNotificationEntry*>         WidgetPool;                                        // 0x0010(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};

}

