#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ZoneGraph

#include "Basic.hpp"

#include "ZoneGraph_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class ZoneGraph.ZoneGraphData
// 0x0130 (0x03C0 - 0x0290)
class AZoneGraphData final : public AActor
{
public:
	uint8                                         Pad_290[0x1];                                      // 0x0290(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bEnableDrawing;                                    // 0x0291(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UZoneGraphRenderingComponent*           RenderingComp;                                     // 0x0298(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphStorage                      ZoneStorage;                                       // 0x02A0(0x00F0)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_390[0x28];                                     // 0x0390(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        CombinedShapeHash;                                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphData">();
	}
	static class AZoneGraphData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphData>();
	}
};

// Class ZoneGraph.ZoneGraphRenderingComponent
// 0x0010 (0x0590 - 0x0580)
class UZoneGraphRenderingComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_578[0x18];                                     // 0x0578(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphRenderingComponent">();
	}
	static class UZoneGraphRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphRenderingComponent>();
	}
};

// Class ZoneGraph.ZoneGraphSettings
// 0x01E0 (0x0210 - 0x0030)
class UZoneGraphSettings final : public UDeveloperSettings
{
public:
	TArray<struct FZoneLaneProfile>               LaneProfiles;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTagInfo                      Tags[0x20];                                        // 0x0040(0x000C)(Edit, Config, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTagMask                      VisualizedTags;                                    // 0x01C0(0x0004)(Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ShapeMaxDrawDistance;                              // 0x01C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphBuildSettings                BuildSettings;                                     // 0x01C8(0x0040)(Edit, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bBuildZoneGraphWhileEditing;                       // 0x0208(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphSettings">();
	}
	static class UZoneGraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphSettings>();
	}
};

// Class ZoneGraph.ZoneGraphSubsystem
// 0x0050 (0x0090 - 0x0040)
class UZoneGraphSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FRegisteredZoneGraphData>       RegisteredZoneGraphData;                           // 0x0068(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphSubsystem">();
	}
	static class UZoneGraphSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphSubsystem>();
	}
};

// Class ZoneGraph.ZoneShape
// 0x0008 (0x0298 - 0x0290)
class AZoneShape final : public AActor
{
public:
	class UZoneShapeComponent*                    ShapeComponent;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneShape">();
	}
	static class AZoneShape* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneShape>();
	}
};

// Class ZoneGraph.ZoneShapeComponent
// 0x0060 (0x05E0 - 0x0580)
class UZoneShapeComponent final : public UPrimitiveComponent
{
public:
	struct FZoneLaneProfileRef                    LaneProfile;                                       // 0x0578(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bReverseLaneProfile;                               // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FZoneLaneProfileRef>            PerPointLaneProfiles;                              // 0x0590(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FZoneShapePoint>                Points;                                            // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	EFZoneShapeType                               ShapeType;                                         // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EZoneShapePolygonRoutingType                  PolygonRoutingType;                                // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B2[0x2];                                      // 0x05B2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FZoneGraphTagMask                      Tags;                                              // 0x05B4(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FZoneShapeConnector>            ShapeConnectors;                                   // 0x05B8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FZoneShapeConnection>           ConnectedShapes;                                   // 0x05C8(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetPolygonRoutingType(const EZoneShapePolygonRoutingType NewType);
	bool SetReverseLaneProfile(bool bReverse);
	void SetShapeType(EFZoneShapeType Type);
	void SetTags(const struct FZoneGraphTagMask& NewTags);

	EFZoneShapeType GetShapeType() const;
	struct FZoneGraphTagMask GetTags() const;
	bool IsLaneProfileReversed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneShapeComponent">();
	}
	static class UZoneShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneShapeComponent>();
	}
};

}

